{"input": "For Halloween Debby and her sister combined the candy they received. Debby had 32 pieces of candy while her sister had 42. If they ate 35 pieces the first night, how many pieces do they have left?", "output": ["Debby had 32 pieces of candy while her sister had 42. That means there were originally 32 + 42 = 74 pieces of candy. 35 have been eaten. So in total they still have 74 - 35 = 39 pieces of candy. The answer is 39."], "answer": "39"}
{"input": "A pet store had 13 siamese cats and 5 house cats. During a sale they sold 10 cats. How many cats do they have left?", "output": ["They had 13 siamese cats and 5 house cats. They sold 10 cats. That means they sold 10 siamese cats and 5 house cats. So now they have 13 - 10 = 3 siamese cats and 5 - 5 = 0 house cats. The answer is 3."], "answer": "8"}
{"input": "Luke was trying to expand his game collection. He bought 2 games from a friend and bought 2 more at a garage sale. If 2 of the games didn't work, how many good games did he end up with?", "output": ["He bought 2 games from a friend and bought 2 more at a garage sale. That means he bought 4 games in total. 2 of them didn't work, so he ended up with 2 good games. The answer is 2."], "answer": "2"}
{"input": "The school cafeteria ordered 42 red apples and 7 green apples for students lunches. But, if only 9 students wanted fruit, how many extra did the cafeteria end up with?", "output": ["The cafeteria ordered 42 red apples and 7 green apples. If only 9 students wanted fruit, then the cafeteria must have ordered 42 - 9 = 33 red apples and 7 - 9 = 2 green apples. So the cafeteria ended up with 33 red apples and 2 green apples. The answer is 35 apples."], "answer": "40"}
{"input": "Lana picked 36 tulips and 37 roses to make flower bouquets. If she only used 70 of the flowers though, how many extra flowers did Lana pick?", "output": ["She picked 36 tulips and 37 roses. She used 70 flowers. That means she used 70 - 36 = 34 flowers. She picked 34 extra flowers. The answer is 34."], "answer": "3"}
{"input": "Carol and her mom were picking carrots from their garden. Carol picked 29 and her mother picked 16. If only 38 of the carrots were good, how many bad carrots did they have?", "output": ["Carol picked 29 and her mother picked 16. That means there were 29 + 16 = 45 carrots in the garden. 38 of them were good. So the number of bad carrots must be 45 - 38 = 7. The answer is 7."], "answer": "7"}
{"input": "Roger had 16 dollars. For his birthday he got 28 more dollars but spent 25 on a new game. How much money does he have now?", "output": ["He had 16 dollars. He got 28 more dollars, so now he has 16 + 28 = 44 dollars. He spent 25 dollars on a new game, so now he has 44 - 25 = 19 dollars. The answer is 19."], "answer": "19"}
{"input": "While on vacation, Megan took 15 pictures at the zoo and 18 at the museum. If she later deleted 31 of the pictures, how many pictures from her vacation did she still have?", "output": ["She took 15 pictures at the zoo and 18 at the museum. She later deleted 31 pictures. That means she deleted 31 - 15 = 16 pictures. She still has 16 pictures. The answer is 16."], "answer": "2"}
{"input": "Rachel bought two coloring books. One had 23 pictures and the other had 32. After one week she had already colored 44 of the pictures. How many pictures does she still have to color?", "output": ["She has 44 pictures to color. She has already colored 44 pictures. The number of pictures she has left to color is the difference between the number of pictures in the coloring books and the number of pictures she has already colored. The number of pictures in the coloring books is 23 + 32 = 55. The number of pictures she has already colored is 44. The difference is 55 - 44 = 11. The answer is 11."], "answer": "11"}
{"input": "Ned had to wash 9 short sleeve shirts and 21 long sleeve shirts before school. If he had only washed 29 of them by the time school started, how many did he not wash?", "output": ["He had to wash 9 short sleeve shirts and 21 long sleeve shirts. He washed 29 of them. That means he did not wash 9 - 29 = 20 short sleeve shirts and 21 - 29 = 10 long sleeve shirts. The answer is 20 short sleeve shirts and 10 long sleeve shirts."], "answer": "1"}
{"input": "Oliver had to wash 39 short sleeve shirts and 47 long sleeve shirts before school. If he had only washed 20 of them by the time school started, how many did he not wash?", "output": ["He had to wash 39 short sleeve shirts and 47 long sleeve shirts. He washed 20 of them. That means he did not wash 39 - 20 = 19 short sleeve shirts and 47 - 20 = 27 long sleeve shirts. The answer is 19 + 27 = 46."], "answer": "66"}
{"input": "For the school bake sale Wendy made pastries. She baked 4 cupcakes and 29 cookies. After the sale she had 24 to take back home. How many pastries did she sell?", "output": ["She baked 4 cupcakes and 29 cookies. She sold 24 pastries. That means she sold 24 - 4 - 29 = -5 cookies. The answer is -5."], "answer": "9"}
{"input": "While on vacation, Debby took 24 pictures at the zoo and 12 at the museum. If she later deleted 14 of the pictures, how many pictures from her vacation did she still have?", "output": ["She took 24 pictures at the zoo and 12 at the museum. She later deleted 14 pictures. So now she has 24 - 14 = 10 pictures left. The answer is 10."], "answer": "22"}
{"input": "Katie picked 3 tulips and 9 roses to make flower bouquets. If she only used 10 of the flowers though, how many extra flowers did Katie pick?", "output": ["She picked 3 tulips and 9 roses. She used 10 flowers. That means she used 3 + 9 = 12 flowers. She picked 3 tulips and 9 roses, so she picked 3 + 9 = 12 tulips and 9 roses. She picked 12 tulips and 9 roses, but she only used 10 flowers. So she picked 12 - 10 = 2 extra tulips. The answer is 2."], "answer": "2"}
{"input": "Faye had 46 math problems and 9 science problems for homework. If she finished 40 of the problems at school, how many problems did she have to do for homework?", "output": ["Faye had 46 math problems and 9 science problems for homework. She finished 40 problems at school. That means she has 46 - 40 = 6 math problems left. She has 9 science problems left. So in total she has 6 + 9 = 15 problems left. The answer is 15."], "answer": "15"}
{"input": "Amy had 4 music files and 21 video files on her flash drive. If she deleted 23 of the files, how many files were still on her flash drive?", "output": ["She had 4 music files and 21 video files. If she deleted 23 files, she must have deleted 23 video files. She still has 4 music files and 21 video files. The answer is 21."], "answer": "2"}
{"input": "Ned was trying to expand his game collection. He bought 11 games from a friend and bought 22 more at a garage sale. If 19 of the games didn't work, how many good games did he end up with?", "output": ["He bought 11 games from a friend and bought 22 more at a garage sale. That means he bought 33 games in total. 19 of them didn't work, so he had 33 - 19 = 14 good games. The answer is 14."], "answer": "14"}
{"input": "Chloe was playing a trivia game. In the first round she scored 40 points and in the second round she scored 50 points. In the last round she lost 4 points. How many points did she have at the end of the game?", "output": ["She scored 40 points in the first round. She scored 50 points in the second round. She lost 4 points in the last round. So in total she scored 40 + 50 - 4 = 94 points. The answer is 94."], "answer": "86"}
{"input": "At the arcade, Tom won 32 tickets playing 'whack a mole' and 25 tickets playing 'skee ball'. If he spent 7 of his tickets on a hat, how many tickets does Tom have left?", "output": ["Tom won 32 tickets playing 'whack a mole' and 25 tickets playing 'skee ball'. He spent 7 tickets on a hat, so now he has 32 - 7 = 25 tickets left. The answer is 25."], "answer": "50"}
{"input": "Bianca and her mom were picking carrots from their garden. Bianca picked 26 and her mother picked 15. If only 16 of the carrots were good, how many bad carrots did they have?", "output": ["Bianca picked 26 and her mother picked 15. That means there were 26 + 15 = 41 carrots in the garden. 16 of them were good, so the rest were bad. So, 41 - 16 = 25 bad carrots. The answer is 25."], "answer": "25"}
{"input": "For the school bake sale Katie made pastries. She baked 7 cupcakes and 5 cookies. After the sale she had 8 to take back home. How many pastries did she sell?", "output": ["She baked 7 cupcakes and 5 cookies. She sold 8 pastries. That means she sold 8 - 7 = 1 cupcake and 5 - 5 = 0 cookies. The answer is 1 cupcake and 0 cookies."], "answer": "4"}
{"input": "Zoe bought two coloring books. One had 44 pictures and the other had 44. After one week she had already colored 20 of the pictures. How many pictures does she still have to color?", "output": ["She has 44 pictures. She colored 20 of them. That means she has 44 - 20 = 24 pictures left. The answer is 24."], "answer": "68"}
{"input": "John was trying to expand his game collection. He bought 21 games from a friend and bought 8 more at a garage sale. If 23 of the games didn't work, how many good games did he end up with?", "output": ["He bought 21 games from a friend and bought 8 more at a garage sale. That means he bought 29 games in total. 23 of them didn't work, so he ended up with 29 - 23 = 6 good games. The answer is 6."], "answer": "6"}
{"input": "Henry had 11 dollars. For his birthday he got 18 more dollars but spent 10 on a new game. How much money does he have now?", "output": ["He had 11 dollars. He got 18 more dollars, so now he has 11 + 18 = 29 dollars. He spent 10 dollars on a new game, so now he has 29 - 10 = 19 dollars. The answer is 19."], "answer": "19"}
{"input": "While on vacation, Gwen took 41 pictures at the zoo and 29 at the museum. If she later deleted 15 of the pictures, how many pictures from her vacation did she still have?", "output": ["She took 41 pictures at the zoo and 29 at the museum. She later deleted 15 of the pictures. So now she has 41 - 15 = 26 pictures from the zoo and 29 - 15 = 14 pictures from the museum. The answer is 40."], "answer": "55"}
{"input": "Sam had to wash 40 short sleeve shirts and 23 long sleeve shirts before school. If he had only washed 29 of them by the time school started, how many did he not wash?", "output": ["He had to wash 40 short sleeve shirts and 23 long sleeve shirts. He washed 29 of them. That means he did not wash 40 - 29 = 11 short sleeve shirts and 23 - 29 = 4 long sleeve shirts. The answer is 11 short sleeve shirts and 4 long sleeve shirts."], "answer": "34"}
{"input": "A pet store had 12 siamese cats and 20 house cats. During a sale they sold 20 cats. How many cats do they have left?", "output": ["They had 12 siamese cats and 20 house cats. They sold 20 cats. That means they sold all the house cats. They still have 12 siamese cats. The answer is 12."], "answer": "12"}
{"input": "Faye and her mom were picking carrots from their garden. Faye picked 23 and her mother picked 5. If only 12 of the carrots were good, how many bad carrots did they have?", "output": ["Faye picked 23 and her mother picked 5. That means there were originally 23 + 5 = 28 carrots. 12 of them were good, so in total there were 12 + 28 = 40 carrots. The answer is 40."], "answer": "16"}
{"input": "The school cafeteria ordered 43 red apples and 32 green apples for students lunches. But, if only 2 students wanted fruit, how many extra did the cafeteria end up with?", "output": ["The cafeteria ordered 43 red apples and 32 green apples. If only 2 students wanted fruit, then the cafeteria must have ordered 43 + 32 - 2 = 75 apples. The answer is 75."], "answer": "73"}
{"input": "There were 39 girls and 4 boys trying out for the schools basketball team. If only 26 of them got called back, how many students didn't make the cut?", "output": ["There were 39 girls and 4 boys trying out for the schools basketball team. If only 26 of them got called back, that means the rest didn't make the cut. So, the number of students who didn't make the cut is 39 - 26 = 13. The answer is 13."], "answer": "17"}
{"input": "A pet store had 38 siamese cats and 25 house cats. During a sale they sold 45 cats. How many cats do they have left?", "output": ["They had 38 siamese cats and 25 house cats. They sold 45 cats. That means they sold 45 - 38 = 7 siamese cats and 45 - 25 = 20 house cats. They have 7 siamese cats and 20 house cats left. The answer is 27."], "answer": "18"}
{"input": "For the school bake sale Paige made pastries. She baked 36 cupcakes and 9 cookies. After the sale she had 4 to take back home. How many pastries did she sell?", "output": ["She baked 36 cupcakes and 9 cookies. She sold 4 pastries. That means she sold 36 - 4 = 32 cupcakes and 9 - 4 = 5 cookies. The answer is 32 cupcakes and 5 cookies."], "answer": "41"}
{"input": "Carol was playing a trivia game. In the first round she scored 17 points and in the second round she scored 6 points. In the last round she lost 16 points. How many points did she have at the end of the game?", "output": ["She scored 17 points in the first round. She scored 6 points in the second round. She lost 16 points in the last round. That means she had 17 + 6 - 16 = 3 points at the end of the game. The answer is 3."], "answer": "7"}
{"input": "Gwen bought two coloring books. One had 10 pictures and the other had 39. After one week she had already colored 13 of the pictures. How many pictures does she still have to color?", "output": ["She has two coloring books. One has 10 pictures and the other has 39. She has already colored 13 pictures. So she has 10 - 13 = 7 pictures left to color in the first coloring book. She has 39 - 13 = 26 pictures left to color in the second coloring book. The answer is 7 + 26 = 33."], "answer": "36"}
{"input": "For Halloween Janet and her sister combined the candy they received. Janet had 34 pieces of candy while her sister had 33. If they ate 4 pieces the first night, how many pieces do they have left?", "output": ["Janet had 34 pieces of candy while her sister had 33. That means there were 34 + 33 = 67 pieces of candy. They ate 4 pieces the first night, so now they have 67 - 4 = 63 pieces of candy. The answer is 63."], "answer": "63"}
{"input": "Haley and her mom were picking carrots from their garden. Haley picked 39 and her mother picked 38. If only 64 of the carrots were good, how many bad carrots did they have?", "output": ["Haley picked 39 and her mother picked 38. That means they picked a total of 77 carrots. 64 of them were good. So the number of bad carrots must be 77 - 64 = 13. The answer is 13."], "answer": "13"}
{"input": "There were 30 girls and 36 boys trying out for the schools basketball team. If only 10 of them got called back, how many students didn't make the cut?", "output": ["There were 30 girls and 36 boys trying out for the schools basketball team. If only 10 of them got called back, that means the rest didn't make the cut. So, the number of students who didn't make the cut is 30 + 36 - 10 = 66. The answer is 66."], "answer": "56"}
{"input": "Roger had 29 dollars. For his birthday he got 20 more dollars but spent 34 on a new game. How much money does he have now?", "output": ["He had 29 dollars. He got 20 more dollars, so now he has 29 + 20 = 49 dollars. He spent 34 dollars on a new game, so now he has 49 - 34 = $15. The answer is 15."], "answer": "15"}
{"input": "Dave had to wash 29 short sleeve shirts and 11 long sleeve shirts before school. If he had only washed 35 of them by the time school started, how many did he not wash?", "output": ["He had to wash 29 short sleeve shirts and 11 long sleeve shirts. He washed 35 of them. That means he did not wash 29 - 35 = -6 short sleeve shirts. He also did not wash 11 - 35 = -24 long sleeve shirts. The answer is -6 short sleeve shirts and -24 long sleeve shirts."], "answer": "5"}
{"input": "Edward was trying to expand his game collection. He bought 41 games from a friend and bought 14 more at a garage sale. If 31 of the games didn't work, how many good games did he end up with?", "output": ["Edward bought 41 games from a friend and bought 14 more at a garage sale. That means he bought 55 games in total. 31 of the games didn't work, so that means there were 55 - 31 = 24 good games. The answer is 24."], "answer": "24"}
{"input": "At the schools book fair Sam bought 13 adventure books and 17 mystery books. If 15 of the books were used, how many new books did he buy?", "output": ["Sam bought 13 adventure books and 17 mystery books. If 15 of the books were used, that means he used 15 adventure books and 17 mystery books. So he used 13 + 17 = 30 books. He bought 13 adventure books and 17 mystery books. So he bought 13 + 17 = 30 - 30 = 0 books. The answer is 0."], "answer": "15"}
{"input": "Amy had 26 music files and 36 video files on her flash drive. If she deleted 48 of the files, how many files were still on her flash drive?", "output": ["She had 26 music files and 36 video files on her flash drive. If she deleted 48 of the files, then she must have deleted 48 - 26 = 22 music files and 48 - 36 = 12 video files. So she still has 26 - 22 = 4 music files and 36 - 12 = 24 video files. The answer is 24."], "answer": "14"}
{"input": "Oliver had 35 dollars. For his birthday he got 50 more dollars but spent 84 on a new game. How much money does he have now?", "output": ["He had 35 dollars. He got 50 more dollars, so now he has 85 dollars. He spent 84 dollars on a new game, so now he has 85 - 84 = 1 dollar. The answer is 1."], "answer": "1"}
{"input": "Emily was playing a trivia game. In the first round she scored 16 points and in the second round she scored 33 points. In the last round she lost 48 points. How many points did she have at the end of the game?", "output": ["She scored 16 points in the first round. She scored 33 points in the second round. She lost 48 points in the last round. That means she had 16 + 33 - 48 = -3 points at the end of the game. The answer is -3."], "answer": "1"}
{"input": "Paige had 43 math problems and 12 science problems for homework. If she finished 44 of the problems at school, how many problems did she have to do for homework?", "output": ["Paige had 43 math problems and 12 science problems for homework. She finished 44 problems at school. That means she has to do 43 - 44 = -1 math problems for homework. She has to do 12 science problems for homework. The answer is 12."], "answer": "11"}
{"input": "The school cafeteria ordered 33 red apples and 23 green apples for students lunches. But, if only 21 students wanted fruit, how many extra did the cafeteria end up with?", "output": ["The cafeteria ordered 33 red apples and 23 green apples. If only 21 students wanted fruit, then the cafeteria must have had 33 - 21 = 12 extra red apples and 23 - 21 = 2 extra green apples. The answer is 14."], "answer": "35"}
{"input": "Dave had to wash 9 short sleeve shirts and 27 long sleeve shirts before school. If he had only washed 20 of them by the time school started, how many did he not wash?", "output": ["He had to wash 9 short sleeve shirts and 27 long sleeve shirts. He washed 20 of them. That means he did not wash 9 + 27 - 20 = 8 long sleeve shirts. The answer is 8."], "answer": "16"}
{"input": "While on vacation, Rachel took 6 pictures at the zoo and 9 at the museum. If she later deleted 11 of the pictures, how many pictures from her vacation did she still have?", "output": ["She took 6 pictures at the zoo and 9 at the museum. She later deleted 11 pictures. So in total she has 6 - 11 = -5 pictures left. The answer is -5."], "answer": "4"}
{"input": "Vanessa and her mom were picking carrots from their garden. Vanessa picked 17 and her mother picked 14. If only 24 of the carrots were good, how many bad carrots did they have?", "output": ["Vanessa picked 17 and her mother picked 14. That means there were 17 + 14 = 31 carrots in the garden. 24 of them were good. That means there were 31 - 24 = 7 bad carrots. The answer is 7."], "answer": "7"}
{"input": "A pet store had 41 siamese cats and 28 house cats. During a sale they sold 15 cats. How many cats do they have left?", "output": ["They had 41 siamese cats and 28 house cats. They sold 15 cats. That means they sold 15 siamese cats and 15 house cats. So now they have 41 - 15 = 26 siamese cats and 28 - 15 = 13 house cats. The answer is 13."], "answer": "54"}
{"input": "At the schools book fair Sam bought 13 adventure books and 17 mystery books. If 15 of the books were used, how many new books did he buy?", "output": ["Sam bought 13 adventure books and 17 mystery books. If 15 of the books were used, that means he used 15 adventure books and 17 mystery books. So he used 13 + 17 = 30 books. He bought 13 adventure books and 17 mystery books. So he bought 13 + 17 = 30 - 30 = 0 books. The answer is 0."], "answer": "15"}
{"input": "Amy had 26 music files and 36 video files on her flash drive. If she deleted 48 of the files, how many files were still on her flash drive?", "output": ["She had 26 music files and 36 video files on her flash drive. If she deleted 48 of the files, then she must have deleted 48 - 26 = 22 music files and 48 - 36 = 12 video files. So she still has 26 - 22 = 4 music files and 36 - 12 = 24 video files. The answer is 24."], "answer": "14"}
{"input": "Oliver had 35 dollars. For his birthday he got 50 more dollars but spent 84 on a new game. How much money does he have now?", "output": ["He had 35 dollars. He got 50 more dollars, so now he has 85 dollars. He spent 84 dollars on a new game, so now he has 85 - 84 = 1 dollar. The answer is 1."], "answer": "1"}
{"input": "Emily was playing a trivia game. In the first round she scored 16 points and in the second round she scored 33 points. In the last round she lost 48 points. How many points did she have at the end of the game?", "output": ["She scored 16 points in the first round. She scored 33 points in the second round. She lost 48 points in the last round. That means she had 16 + 33 - 48 = -3 points at the end of the game. The answer is -3."], "answer": "1"}
{"input": "Paige had 43 math problems and 12 science problems for homework. If she finished 44 of the problems at school, how many problems did she have to do for homework?", "output": ["Paige had 43 math problems and 12 science problems for homework. She finished 44 problems at school. That means she has to do 43 - 44 = -1 math problems for homework. She has to do 12 science problems for homework. The answer is 12."], "answer": "11"}
{"input": "The school cafeteria ordered 33 red apples and 23 green apples for students lunches. But, if only 21 students wanted fruit, how many extra did the cafeteria end up with?", "output": ["The cafeteria ordered 33 red apples and 23 green apples. If only 21 students wanted fruit, then the cafeteria must have had 33 - 21 = 12 extra red apples and 23 - 21 = 2 extra green apples. The answer is 14."], "answer": "35"}
{"input": "Dave had to wash 9 short sleeve shirts and 27 long sleeve shirts before school. If he had only washed 20 of them by the time school started, how many did he not wash?", "output": ["He had to wash 9 short sleeve shirts and 27 long sleeve shirts. He washed 20 of them. That means he did not wash 9 + 27 - 20 = 8 long sleeve shirts. The answer is 8."], "answer": "16"}
{"input": "While on vacation, Rachel took 6 pictures at the zoo and 9 at the museum. If she later deleted 11 of the pictures, how many pictures from her vacation did she still have?", "output": ["She took 6 pictures at the zoo and 9 at the museum. She later deleted 11 pictures. So in total she has 6 - 11 = -5 pictures left. The answer is -5."], "answer": "4"}
{"input": "Vanessa and her mom were picking carrots from their garden. Vanessa picked 17 and her mother picked 14. If only 24 of the carrots were good, how many bad carrots did they have?", "output": ["Vanessa picked 17 and her mother picked 14. That means there were 17 + 14 = 31 carrots in the garden. 24 of them were good. That means there were 31 - 24 = 7 bad carrots. The answer is 7."], "answer": "7"}
{"input": "A pet store had 41 siamese cats and 28 house cats. During a sale they sold 15 cats. How many cats do they have left?", "output": ["They had 41 siamese cats and 28 house cats. They sold 15 cats. That means they sold 15 siamese cats and 15 house cats. So now they have 41 - 15 = 26 siamese cats and 28 - 15 = 13 house cats. The answer is 13."], "answer": "54"}
{"input": "Janet picked 4 tulips and 11 roses to make flower bouquets. If she only used 11 of the flowers though, how many extra flowers did Janet pick?", "output": ["She picked 4 tulips and 11 roses. She used 11 flowers. That means she used 11 - 4 = 7 roses. She picked 7 extra roses. The answer is 7."], "answer": "4"}
{"input": "Vanessa had 13 music files and 30 video files on her flash drive. If she deleted 10 of the files, how many files were still on her flash drive?", "output": ["She had 13 music files and 30 video files. If she deleted 10 of the files, she must have deleted 10 music files and 10 video files. So now she has 13 - 10 = 3 music files and 30 - 10 = 20 video files. The answer is 3 music files and 20 video files."], "answer": "33"}
{"input": "Debby bought two coloring books. One had 16 pictures and the other had 40. After one week she had already colored 33 of the pictures. How many pictures does she still have to color?", "output": ["She has 16 + 40 = 56 pictures. She has already colored 33 of them. So she has 56 - 33 = 23 pictures left to color. The answer is 23."], "answer": "23"}
{"input": "The school cafeteria ordered 8 red apples and 43 green apples for students lunches. But, if only 42 students wanted fruit, how many extra did the cafeteria end up with?", "output": ["The cafeteria ordered 8 red apples and 43 green apples. If only 42 students wanted fruit, then the cafeteria must have had 8 + 43 - 42 = 5 extra apples. The answer is 5."], "answer": "9"}
{"input": "Edward started his own lawn mowing business. In the spring he made 2 dollars mowing lawns and in the summer he made 27 dollars. If he had to spend 5 dollars buying supplies, how much money did he end up with?", "output": ["He made 2 dollars in the spring and 27 dollars in the summer. That means he made 29 dollars in total. He spent 5 dollars on supplies, so he has 29 - 5 = 24 dollars. The answer is 24."], "answer": "24"}
{"input": "A pet store had 36 siamese cats and 18 house cats. During a sale they sold 26 cats. How many cats do they have left?", "output": ["They had 36 siamese cats and 18 house cats. They sold 26 cats. That means they sold 26 - 36 = 10 siamese cats and 26 - 18 = 8 house cats. They have 10 siamese cats and 8 house cats left. The answer is 18."], "answer": "28"}
{"input": "Olivia and her mom were picking carrots from their garden. Olivia picked 20 and her mother picked 14. If only 19 of the carrots were good, how many bad carrots did they have?", "output": ["Olivia picked 20 and her mother picked 14. That means there were 20 + 14 = 34 carrots in the garden. 19 of them were good, so the rest were bad. 34 - 19 = 15 bad carrots. The answer is 15."], "answer": "15"}
{"input": "George had 30 dollars. For his birthday he got 16 more dollars but spent 38 on a new game. How much money does he have now?", "output": ["He had 30 dollars. He got 16 more dollars, so now he has 46 dollars. He spent 38 dollars on a new game, so now he has 46 - 38 = 8 dollars. The answer is 8."], "answer": "8"}
{"input": "There were 6 girls and 48 boys trying out for the schools basketball team. If only 7 of them got called back, how many students didn't make the cut?", "output": ["There were 6 girls and 48 boys trying out for the schools basketball team. If only 7 of them got called back, that means the rest didn't make the cut. So, the number of students who didn't make the cut is 48 - 7 = 41. The answer is 41."], "answer": "47"}
{"input": "For the school bake sale Amy made pastries. She baked 15 cupcakes and 48 cookies. After the sale she had 12 to take back home. How many pastries did she sell?", "output": ["She baked 15 cupcakes and 48 cookies. She sold 12 pastries. That means she sold 15 + 48 - 12 = 63 pastries. The answer is 63."], "answer": "51"}
{"input": "At the schools book fair Victor bought 32 adventure books and 37 mystery books. If 16 of the books were used, how many new books did he buy?", "output": ["Victor bought 32 adventure books and 37 mystery books. He used 16 books. That means he used 16 adventure books and 16 mystery books. So, he used 32 + 37 - 16 = 57 books. He bought 32 + 37 - 16 = 61 books. The answer is 61."], "answer": "53"}
{"input": "While on vacation, Haley took 50 pictures at the zoo and 8 at the museum. If she later deleted 38 of the pictures, how many pictures from her vacation did she still have?", "output": ["She took 50 pictures at the zoo and 8 at the museum. She later deleted 38 of the pictures. So she still has 50 - 38 = 12 pictures. The answer is 12."], "answer": "20"}
{"input": "The school cafeteria ordered 37 red apples and 45 green apples for students lunches. But, if only 51 students wanted fruit, how many extra did the cafeteria end up with?", "output": ["The cafeteria ordered 37 red apples and 45 green apples. If only 51 students wanted fruit, then the cafeteria must have ordered 51 - 37 = 14 red apples and 51 - 45 = 6 green apples. The answer is 6."], "answer": "31"}
{"input": "While shopping, Maria bought 35 green towels and 21 white towels. If she gave her mother 34 of them, how many towels did Maria end up with?", "output": ["Maria bought 35 green towels and 21 white towels. She gave her mother 34 towels. This means she gave her mother 34 green towels and 21 white towels. She has 35 - 34 = 1 green towel left. She has 21 - 34 = 7 white towels left. The answer is 1 green towel and 7 white towels."], "answer": "22"}
{"input": "There were 17 girls and 32 boys trying out for the schools basketball team. If only 10 of them got called back, how many students didn't make the cut?", "output": ["There were 17 girls and 32 boys trying out for the schools basketball team. If only 10 of them got called back, that means the rest didn't make the cut. So, the number of students who didn't make the cut is 17 + 32 - 10 = 49. The answer is 49."], "answer": "39"}
{"input": "Nancy and her mom were picking carrots from their garden. Nancy picked 38 and her mother picked 47. If only 71 of the carrots were good, how many bad carrots did they have?", "output": ["Nancy picked 38 and her mother picked 47. That means there were originally 38 + 47 = 85 carrots. 71 of them were good, so the remaining ones were bad. The number of bad carrots must have been 85 - 71 = 14. The answer is 14."], "answer": "14"}
{"input": "A waiter at 'The Greasy Spoon' restaurant had 29 customers to wait on. During the lunch rush he added another 20 customers. If 34 of the customers didn't leave him a tip, how many customers did leave a tip?", "output": ["The waiter had 29 customers to wait on. During the lunch rush he added another 20 customers. That means he had 29 + 20 = 49 customers. 34 of the customers didn't leave him a tip, so the number of customers who left him a tip must be 49 - 34 = 15. The answer is 15."], "answer": "15"}
{"input": "Tom had to wash 10 short sleeve shirts and 25 long sleeve shirts before school. If he had only washed 5 of them by the time school started, how many did he not wash?", "output": ["He had to wash 10 short sleeve shirts and 25 long sleeve shirts. He washed 5 of them. That means he did not wash the other 5 short sleeve shirts and 20 long sleeve shirts. The answer is 25."], "answer": "30"}
{"input": "Vanessa had 16 music files and 48 video files on her flash drive. If she deleted 30 of the files, how many files were still on her flash drive?", "output": ["She had 16 music files and 48 video files. If she deleted 30 of the files, she must have deleted 30 music files and 30 video files. So now she has 16 - 30 = 6 music files and 48 - 30 = 18 video files. The answer is 18."], "answer": "34"}
{"input": "Kaleb started his own lawn mowing business. In the spring he made 4 dollars mowing lawns and in the summer he made 50 dollars. If he had to spend 4 dollars buying supplies, how much money did he end up with?", "output": ["He made 4 dollars in the spring and 50 dollars in the summer. He spent 4 dollars in the spring, so he made 4 + 50 - 4 = 54 dollars in the summer. The answer is 54."], "answer": "50"}
{"input": "The school cafeteria ordered 6 red apples and 15 green apples for students lunches. But, if only 5 students wanted fruit, how many extra did the cafeteria end up with?", "output": ["The cafeteria ordered 6 red apples and 15 green apples. If only 5 students wanted fruit, then the cafeteria must have had 6 - 5 = 1 extra red apple and 15 - 5 = 10 extra green apples. The answer is 11."], "answer": "16"}
{"input": "Bianca picked 39 tulips and 49 roses to make flower bouquets. If she only used 81 of the flowers though, how many extra flowers did Bianca pick?", "output": ["Bianca picked 39 tulips and 49 roses. She used 81 flowers. That means she used 81 - 39 = 42 tulips and 81 - 49 = 32 roses. She used 42 tulips and 32 roses. She used 81 - 42 = 39 tulips and 81 - 32 = 49 roses. She used 39 tulips and 49 roses. She used 81 - 39 = 42 tulips and 81 - 49 = 32 roses. She used 42 tulips and 32 roses. She used 81 - 42 = 39 tulips and 81 - 32 = 49 roses. She used 39 tulips and 49 roses. She used 81 - 39 = 42 tulips and 81 - 49 = 32 roses. She used 42 tulips and 32 roses. She used 81 - 42 = 39 tulips and 81 - 32 = 49 roses. She used 39 tulips and 49 roses. She used 81 - 39 = 42 tulips and 81 - 49 = 32 roses. She used 42 tulips and 32 roses. She used 81 - 42 = 39 tulips and 81 - 32 = 49 roses. She used 39 tulips and 49 roses. She used 81 - 39 = 42 tulips and 81 - 49 = 32 roses. She used 42 tulips and 32 roses. She used 81 - 42 = 39 tulips and 81 - 32 = 49 roses. She used 39 tu"], "answer": "7"}
{"input": "While on vacation, Nancy took 49 pictures at the zoo and 8 at the museum. If she later deleted 38 of the pictures, how many pictures from her vacation did she still have?", "output": ["She took 49 pictures at the zoo and 8 at the museum. She later deleted 38 of the pictures. So she still has 49 - 38 = 11 pictures. The answer is 11."], "answer": "19"}
{"input": "Gwen had 18 math problems and 11 science problems for homework. If she finished 24 of the problems at school, how many problems did she have to do for homework?", "output": ["She had 18 math problems and 11 science problems for homework. She finished 24 problems at school. That means she has 18 + 11 - 24 = 7 math problems left. She has 7 math problems left. She has 18 - 7 = 11 science problems left. The answer is 11."], "answer": "5"}
{"input": "For Halloween Katie and her sister combined the candy they received. Katie had 10 pieces of candy while her sister had 6. If they ate 9 pieces the first night, how many pieces do they have left?", "output": ["Katie had 10 pieces of candy and her sister had 6. That means they had 16 pieces of candy in total. They ate 9 pieces the first night, so now they have 16 - 9 = 7 pieces left. The answer is 7."], "answer": "7"}
{"input": "A pet store had 15 siamese cats and 49 house cats. During a sale they sold 19 cats. How many cats do they have left?", "output": ["They had 15 siamese cats and 49 house cats. They sold 19 cats. That means they sold 19 - 15 = 4 siamese cats and 19 - 49 = 30 house cats. They have 4 siamese cats and 30 house cats left. The answer is 34."], "answer": "45"}
{"input": "There were 9 girls and 14 boys trying out for the schools basketball team. If only 2 of them got called back, how many students didn't make the cut?", "output": ["There were 9 girls and 14 boys trying out for the schools basketball team. If only 2 of them got called back, that means the rest didn't make the cut. So, the number of students who didn't make the cut is 14 - 2 = 12. The answer is 12."], "answer": "21"}
{"input": "Haley had 27 music files and 42 video files on her flash drive. If she deleted 11 of the files, how many files were still on her flash drive?", "output": ["She had 27 music files and 42 video files on her flash drive. If she deleted 11 of the files, she must have deleted 11 music files and 11 video files. So now she has 27 - 11 = 16 music files and 42 - 11 = 31 video files. The answer is 31."], "answer": "58"}
{"input": "While shopping, Maria bought 40 green towels and 44 white towels. If she gave her mother 65 of them, how many towels did Maria end up with?", "output": ["Maria bought 40 green towels and 44 white towels. She gave her mother 65 towels. This means she gave her mother 65 - 40 = 25 green towels and 65 - 44 = 21 white towels. She has 25 green towels and 21 white towels. The answer is 46."], "answer": "19"}
{"input": "A waiter at 'The Greasy Spoon' restaurant had 39 customers to wait on. During the lunch rush he added another 12 customers. If 49 of the customers didn't leave him a tip, how many customers did leave a tip?", "output": ["The waiter had 39 customers to wait on. During the lunch rush he added another 12 customers. That means he had 49 customers in total. 49 customers didn't leave him a tip. So the number of customers who left him a tip must be the number of customers who didn't leave him a tip minus 1. So the answer is 49 - 1 = 48."], "answer": "2"}
{"input": "A pet store had 19 siamese cats and 45 house cats. During a sale they sold 56 cats. How many cats do they have left?", "output": ["They had 19 siamese cats and 45 house cats. They sold 56 cats. That means they sold 19 + 45 - 56 = 14 house cats. They still have 14 house cats. The answer is 14."], "answer": "8"}
{"input": "A waiter at 'The Greasy Spoon' restaurant had 26 customers to wait on. During the lunch rush he added another 27 customers. If 27 of the customers didn't leave him a tip, how many customers did leave a tip?", "output": ["He had 26 customers to wait on. During the lunch rush he added 27 more. That means he had 53 customers to wait on. 27 of them didn't leave a tip, so that means he had 26 - 27 = 7 customers that left a tip. The answer is 7."], "answer": "26"}
{"input": "Rachel bought two coloring books. One had 24 pictures and the other had 39. After one week she had already colored 4 of the pictures. How many pictures does she still have to color?", "output": ["She has two coloring books. One has 24 pictures and the other has 39. She has already colored 4 pictures. So, she has 24 - 4 = 20 pictures in the first coloring book and 39 - 4 = 35 pictures in the second coloring book. The answer is 35."], "answer": "59"}
{"input": "While shopping, Emily bought 5 green towels and 30 white towels. If she gave her mother 26 of them, how many towels did Emily end up with?", "output": ["Emily bought 5 green towels and 30 white towels. She gave 26 of them to her mother. That means she has 5 green towels and 26 white towels. The answer is 31."], "answer": "9"}
{"input": "For Halloween Katie and her sister combined the candy they received. Katie had 8 pieces of candy while her sister had 23. If they ate 8 pieces the first night, how many pieces do they have left?", "output": ["Katie had 8 pieces of candy and her sister had 23. That means they had 8 + 23 = 31 pieces of candy in total. They ate 8 pieces the first night, so now they have 31 - 8 = 23 pieces left. The answer is 23."], "answer": "23"}
{"input": "Ned was trying to expand his game collection. He bought 50 games from a friend and bought 27 more at a garage sale. If 74 of the games didn't work, how many good games did he end up with?", "output": ["He bought 50 games from a friend and bought 27 more at a garage sale. That means he bought a total of 77 games. 74 of them didn't work, so he ended up with 3 good games. The answer is 3."], "answer": "3"}
{"input": "For the school bake sale Wendy made pastries. She baked 41 cupcakes and 31 cookies. After the sale she had 32 to take back home. How many pastries did she sell?", "output": ["She baked 41 cupcakes and 31 cookies. She sold 32 pastries. That means she sold 32 - 41 = -9 pastries. The answer is -9."], "answer": "40"}
{"input": "The school cafeteria ordered 25 red apples and 17 green apples for students lunches. But, if only 10 students wanted fruit, how many extra did the cafeteria end up with?", "output": ["The cafeteria ordered 25 red apples and 17 green apples. If only 10 students wanted fruit, then the cafeteria must have ordered 25 - 10 = 15 red apples and 17 - 10 = 7 green apples. So, the cafeteria ended up with 15 red apples and 7 green apples. The answer is 22."], "answer": "32"}
{"input": "At the arcade, Jerry won 29 tickets playing 'whack a mole' and 17 tickets playing 'skee ball'. If he spent 12 of his tickets on a hat, how many tickets does Jerry have left?", "output": ["Jerry won 29 tickets playing 'whack a mole' and 17 tickets playing 'skee ball'. That means he won 29 + 17 = 46 tickets. He spent 12 tickets on a hat, so now he has 46 - 12 = 34 tickets left. The answer is 34."], "answer": "34"}
{"input": "Cody had 45 dollars. For his birthday he got 9 more dollars but spent 19 on a new game. How much money does he have now?", "output": ["He had 45 dollars. He got 9 more dollars, so now he has 45 + 9 = 54 dollars. He spent 19 dollars on a new game, so now he has 54 - 19 = $35. The answer is 35."], "answer": "35"}
{"input": "For the school bake sale Carol made 30 cupcakes. If she sold 9 of them and then made 28 more, how many cupcakes would she have?", "output": ["She made 30 cupcakes. She sold 9 of them. That means she has 30 - 9 = 21 cupcakes left. Then she made 28 more. So in total she has 21 + 28 = 49 cupcakes. The answer is 49."], "answer": "49"}
{"input": "For Halloween Faye scored 47 pieces of candy. She ate 25 pieces the first night and then her sister gave her 40 more pieces. How many pieces of candy does Faye have now?", "output": ["Faye had 47 pieces of candy. She ate 25 pieces the first night. So now she has 47 - 25 = 22 pieces of candy. Her sister gave her 40 more pieces, so now she has 22 + 40 = 62 pieces of candy. The answer is 62."], "answer": "62"}
{"input": "Kaleb had 34 books. If he sold 17 of them and used the money he earned to buy 7 new books, how many books would Kaleb have?", "output": ["He had 34 books. He sold 17 of them, so now he has 34 - 17 = 17 books. He used the money he earned to buy 7 new books, so now he has 17 + 7 = 24 books. The answer is 24."], "answer": "24"}
{"input": "In fourth grade there were 10 students at the start of the year. During the year 4 students left and 42 new students came to school. How many students were in fourth grade at the end?", "output": ["There were 10 students at the start of the year. During the year 4 students left and 42 new students came to school. That means there were 10 + 4 - 42 = 26 students at the end. The answer is 26."], "answer": "48"}
{"input": "Oliver had 33 dollars in January. By March he had spent 4 dollars. If he got another 32 dollars from his mom, how much money would he have?", "output": ["He had 33 dollars in January. He spent 4 dollars in March. So in March he had 33 - 4 = 29 dollars. Then he got 32 dollars from his mom. So in March he had 32 + 29 = 61 dollars. The answer is 61."], "answer": "61"}
{"input": "A florist had 37 roses. If she sold 16 of them and then later picked 19 more, how many roses would she have?", "output": ["She had 37 roses. She sold 16 of them, so now she has 37 - 16 = 21 roses. Then she picked 19 more, so now she has 21 + 19 = 40 roses. The answer is 40."], "answer": "40"}
{"input": "A teacher had 6 worksheets to grade. If she graded 4, but then another 18 were turned in, how many worksheets would she have to grade?", "output": ["She graded 4. Then 18 more were turned in. So now she has to grade 4 + 18 = 22 worksheets. The answer is 22."], "answer": "20"}
{"input": "A book store had 41 books in the bargin bin. If they sold 33 books, but then put 2 more in the bin, how many books would be in the bin?", "output": ["They had 41 books in the bin. They sold 33 books. That means they have 41 - 33 = 8 books left. Then they put 2 more books in the bin, so now they have 8 + 2 = 10 books in the bin. The answer is 10."], "answer": "10"}
{"input": "A waiter had 19 customers to wait on. If 14 customers left and he got another 36 customers, how many customers would he have?", "output": ["He had 19 customers to wait on. 14 customers left. That means he has 19 - 14 = 5 customers left. Then he got 36 more customers. So in total he has 5 + 36 = 41 customers. The answer is 41."], "answer": "41"}
{"input": "At the fair there were 9 people in line for the bumper cars. If 6 of them got tired of waiting and left and 3 more got in line, how many people would be in line?", "output": ["There were 9 people in line. 6 left, so now there are 3. 3 more got in line, so now there are 6. The answer is 6."], "answer": "6"}
{"input": "A teacher had 7 worksheets to grade. If she graded 2, but then another 46 were turned in, how many worksheets would she have to grade?", "output": ["She graded 2. Then 46 more were turned in. So now she has to grade 2 + 46 = 48 worksheets. The answer is 48."], "answer": "51"}
{"input": "Paige had 8 songs on her mp3 player. If she deleted 5 old songs from it and then added 30 new songs, how many songs does she have on her mp3 player?", "output": ["She had 8 songs on her mp3 player. She deleted 5 old songs, so now she has 8 - 5 = 3 old songs. She added 30 new songs, so now she has 3 + 30 = 33 songs. The answer is 33."], "answer": "33"}
{"input": "Maria picked 48 carrots from her garden. If she threw out 11 of them and then picked 15 more the next day, how many carrots would she have total?", "output": ["She picked 48 carrots from her garden. She threw out 11 of them, so now she has 37 carrots. Then she picked 15 more, so now she has 37 + 15 = 52 carrots. The answer is 52."], "answer": "52"}
{"input": "A store had 34 oranges in a bin. If they threw away 20 of the old ones and put 13 new ones in the bin how many would be in the bin?", "output": ["They threw away 20 old ones and put 13 new ones in the bin. That means they have 13 + 20 = 33 oranges in the bin. The answer is 33."], "answer": "27"}
{"input": "A waiter had 47 customers to wait on. If 41 customers left and he got another 20 customers, how many customers would he have?", "output": ["He had 47 customers to wait on. 41 left. That means he has 47 - 41 = 6 customers left. Then he got 20 more, so in total he has 6 + 20 = 26 customers. The answer is 26."], "answer": "26"}
{"input": "In fourth grade there were 33 students at the start of the year. During the year 18 students left and 14 new students came to school. How many students were in fourth grade at the end?", "output": ["There were 33 students at the start of the year. 18 students left and 14 new students came to school. That means there were 33 - 18 + 14 = 15 students at the end. The answer is 15."], "answer": "29"}
{"input": "For the school bake sale Katie made 26 cupcakes. If she sold 20 of them and then made 20 more, how many cupcakes would she have?", "output": ["She made 26 cupcakes. She sold 20 of them. That means she has 26 - 20 = 6 cupcakes left. Then she made 20 more, so in total she has 26 + 20 = 46 cupcakes. The answer is 46."], "answer": "26"}
{"input": "Adam had 5 dollars. At the store he spent $2 on a new game. If he got another 5 dollars for his allowance, how much money does he have now?", "output": ["He had 5 dollars. He spent 2 dollars on a new game. So now he has 5 - 2 = 3 dollars. Then he got another 5 dollars for his allowance, so now he has 3 + 5 = 8 dollars. The answer is 8."], "answer": "8"}
{"input": "Tiffany was playing a video game and had 43 lives. In a hard part of the game she lost 14 lives. If she got 27 more lives in the next level, how many lives would she have?", "output": ["She had 43 lives. She lost 14 lives. So now she has 43 - 14 = 29 lives. She got 27 more lives in the next level, so now she has 29 + 27 = 56 lives. The answer is 56."], "answer": "56"}
{"input": "At the fair there were 12 people in line for the bumper cars. If 10 of them got tired of waiting and left and 15 more got in line, how many people would be in line?", "output": ["There were 12 people in line. 10 left, so now there are 2 people in line. 15 more got in line, so now there are 17 people in line. The answer is 17."], "answer": "17"}
{"input": "A waiter had 14 customers to wait on. If 3 customers left and he got another 39 customers, how many customers would he have?", "output": ["He had 14 customers to wait on. 3 customers left. He got another 39 customers. That means he has 14 + 39 = 53 customers. The answer is 53."], "answer": "50"}
{"input": "At the fair there were 30 people in line for the bumper cars. If 10 of them got tired of waiting and left and 5 more got in line, how many people would be in line?", "output": ["There were 30 people in line. 10 left, so now there are 20. 5 more got in line, so now there are 25. The answer is 25."], "answer": "25"}
{"input": "Faye had 34 coloring books. If she gave away 3 of them, but then bought 48 more, how many would she have total?", "output": ["She had 34 coloring books. She gave away 3, so now she has 33 coloring books. Then she bought 48 more, so now she has 33 + 48 = 81 coloring books. The answer is 81."], "answer": "79"}
{"input": "Paige had 11 songs on her mp3 player. If she deleted 9 old songs from it and then added 8 new songs, how many songs does she have on her mp3 player?", "output": ["She had 11 songs on her mp3 player. She deleted 9 old songs, so now she has 11 - 9 = 2 old songs. She added 8 new songs, so now she has 2 + 8 = 10 songs. The answer is 10."], "answer": "10"}
{"input": "A teacher had 38 worksheets to grade. If she graded 4, but then another 15 were turned in, how many worksheets would she have to grade?", "output": ["She graded 4. Then 15 more were turned in. So now she has to grade 19 more. The answer is 19."], "answer": "49"}
{"input": "In fourth grade there were 40 students at the start of the year. During the year 14 students left and 26 new students came to school. How many students were in fourth grade at the end?", "output": ["There were 40 students at the start of the year. 14 students left and 26 new students came to school. That means there were 40 - 14 + 26 = 58 students at the end of the year. The answer is 58."], "answer": "52"}
{"input": "Wendy was playing a video game and had 43 lives. In a hard part of the game she lost 8 lives. If she got 39 more lives in the next level, how many lives would she have?", "output": ["She had 43 lives. She lost 8 lives. So now she has 43 - 8 = 35 lives. Then she got 39 more lives, so now she has 35 + 39 = 74 lives. The answer is 74."], "answer": "74"}
{"input": "A book store had 4 books in the bargin bin. If they sold 3 books, but then put 10 more in the bin, how many books would be in the bin?", "output": ["They had 4 books in the bin. They sold 3 books. So now they have 4 - 3 = 1 book left. Then they put 10 more books in the bin. So now they have 1 + 10 = 11 books in the bin. The answer is 11."], "answer": "11"}
{"input": "At the arcade Cody won 49 tickets. If he spent 25 tickets on a beanie and later won 6 more tickets, how many would he have?", "output": ["Cody won 49 tickets. He spent 25 tickets on a beanie. So now he has 49 - 25 = 24 tickets left. He won 6 more tickets, so now he has 24 + 6 = 30 tickets. The answer is 30."], "answer": "30"}
{"input": "For the school bake sale Bianca made 14 cupcakes. If she sold 6 of them and then made 17 more, how many cupcakes would she have?", "output": ["She made 14 cupcakes. She sold 6 of them. That means she has 14 - 6 = 8 cupcakes left. Then she made 17 more, so now she has 8 + 17 = 25 cupcakes. The answer is 25."], "answer": "25"}
{"input": "Bianca had 45 coloring books. If she gave away 6 of them, but then bought 20 more, how many would she have total?", "output": ["She had 45 coloring books. She gave away 6 of them, so now she has 45 - 6 = 39 coloring books. Then she bought 20 more, so now she has 39 + 20 = 59 coloring books. The answer is 59."], "answer": "59"}
{"input": "Zoe had 15 songs on her mp3 player. If she deleted 8 old songs from it and then added 50 new songs, how many songs does she have on her mp3 player?", "output": ["She had 15 songs on her mp3 player. She deleted 8 old songs, so now she has 15 - 8 = 7 songs. Then she added 50 new songs, so now she has 7 + 50 = 57 songs. The answer is 57."], "answer": "57"}
{"input": "At the arcade Jerry won 4 tickets. If he spent 2 tickets on a beanie and later won 47 more tickets, how many would he have?", "output": ["He won 4 tickets. He spent 2 tickets on a beanie. So now he has 4 - 2 = 2 tickets left. He won 47 more tickets, so now he has 2 + 47 = 49 tickets. The answer is 49."], "answer": "49"}
{"input": "A store had 31 oranges in a bin. If they threw away 9 of the old ones and put 38 new ones in the bin how many would be in the bin?", "output": ["They threw away 9 old ones and put 38 new ones in the bin. That means they have 38 - 9 = 29 new ones. The old ones were 31, so now they have 29 + 31 = 60 oranges. The answer is 60."], "answer": "60"}
{"input": "Adam had 33 books. If he sold 11 of them and used the money he earned to buy 23 new books, how many books would Adam have?", "output": ["He had 33 books. He sold 11 of them, so now he has 33 - 11 = 22 books. He used the money he earned to buy 23 new books, so now he has 22 + 23 = 45 books. The answer is 45."], "answer": "45"}
{"input": "At the fair there were 10 people in line for the bumper cars. If 2 of them got tired of waiting and left and 2 more got in line, how many people would be in line?", "output": ["There were 10 people in line. 2 left, so now there are 8. 2 more got in line, so now there are 10 again. The answer is 10."], "answer": "10"}
{"input": "The school cafeteria had 38 apples. If they used 20 to make lunch for the students and then bought 28 more, how many apples would they have?", "output": ["They used 20 apples to make lunch for the students. They bought 28 more. So in total they have 20 + 28 = 48 apples. The answer is 48."], "answer": "46"}
{"input": "George had 28 socks. If he threw away 4 old ones that didn't fit and bought 36 new ones, how many socks would he have?", "output": ["He had 28 socks. He threw away 4 old ones that didn't fit. He bought 36 new ones. That means he has 28 + 36 - 4 = 64 socks. The answer is 64."], "answer": "60"}
{"input": "For Halloween Robin scored 23 pieces of candy. She ate 7 pieces the first night and then her sister gave her 21 more pieces. How many pieces of candy does Robin have now?", "output": ["Robin scored 23 pieces of candy. She ate 7 pieces the first night. So now she has 23 - 7 = 16 pieces of candy. Her sister gave her 21 more pieces. So now she has 16 + 21 = 37 pieces of candy. The answer is 37."], "answer": "37"}
{"input": "Rachel was playing a video game and had 10 lives. In a hard part of the game she lost 4 lives. If she got 26 more lives in the next level, how many lives would she have?", "output": ["She had 10 lives. She lost 4 lives. So now she has 10 - 4 = 6 lives. She got 26 more lives in the next level. So now she has 6 + 26 = 32 lives. The answer is 32."], "answer": "32"}
{"input": "A florist had 6 roses. If she sold 5 of them and then later picked 12 more, how many roses would she have?", "output": ["She had 6 roses. She sold 5 of them, so now she has 1 rose left. She picked 12 more, so now she has 13 roses. The answer is 13."], "answer": "13"}
{"input": "For Halloween Haley scored 33 pieces of candy. She ate 17 pieces the first night and then her sister gave her 19 more pieces. How many pieces of candy does Haley have now?", "output": ["She scored 33 pieces of candy. She ate 17 pieces the first night. So now she has 33 - 17 = 16 pieces of candy. Her sister gave her 19 more pieces. So now she has 16 + 19 = 35 pieces of candy. The answer is 35."], "answer": "35"}
{"input": "The school cafeteria had 14 apples. If they used 13 to make lunch for the students and then bought 49 more, how many apples would they have?", "output": ["They used 13 apples to make lunch for the students. They bought 49 more. So in total they have 13 + 49 = 62 apples. The answer is 62."], "answer": "50"}
{"input": "Edward had 43 books. If he sold 19 of them and used the money he earned to buy 14 new books, how many books would Edward have?", "output": ["Edward had 43 books. He sold 19 of them, so now he has 43 - 19 = 24 books. He used the money he earned to buy 14 new books, so now he has 24 + 14 = 38 books. The answer is 38."], "answer": "38"}
{"input": "A teacher had 29 worksheets to grade. If she graded 25, but then another 29 were turned in, how many worksheets would she have to grade?", "output": ["She graded 25. Then 29 more were turned in. So now she has to grade 29 + 25 = 54 worksheets. The answer is 54."], "answer": "33"}
{"input": "In fourth grade there were 35 students at the start of the year. During the year 10 students left and 10 new students came to school. How many students were in fourth grade at the end?", "output": ["There were 35 students at the start of the year. 10 students left, so now there are 35 - 10 = 25 students. 10 new students came, so now there are 25 + 10 = 35 students. The answer is 35."], "answer": "35"}
{"input": "For the school bake sale Carol made 19 cupcakes. If she sold 6 of them and then made 27 more, how many cupcakes would she have?", "output": ["She made 19 cupcakes. She sold 6 of them. That means she has 19 - 6 = 13 cupcakes left. Then she made 27 more. So in total she has 13 + 27 = 40 cupcakes. The answer is 40."], "answer": "40"}
{"input": "A store had 40 oranges in a bin. If they threw away 37 of the old ones and put 7 new ones in the bin how many would be in the bin?", "output": ["They threw away 37 old ones and put 7 new ones in the bin. That means they have 37 - 7 = 30 old ones left. The answer is 30."], "answer": "10"}
{"input": "At the arcade Victor won 46 tickets. If he spent 27 tickets on a beanie and later won 39 more tickets, how many would he have?", "output": ["Victor won 46 tickets. He spent 27 tickets on a beanie. So now he has 46 - 27 = 19 tickets. He later won 39 more tickets, so now he has 19 + 39 = 58 tickets. The answer is 58."], "answer": "58"}
{"input": "Chloe picked 48 carrots from her garden. If she threw out 45 of them and then picked 42 more the next day, how many carrots would she have total?", "output": ["She picked 48 carrots from her garden. She threw out 45 of them, so now she has 3 left. She picked 42 more the next day, so now she has 3 + 42 = 45 carrots. The answer is 45."], "answer": "45"}
{"input": "Sam had 10 socks. If he threw away 3 old ones that didn't fit and bought 36 new ones, how many socks would he have?", "output": ["Sam had 10 socks. He threw away 3 old ones that didn't fit. He bought 36 new ones. That means he has 10 + 36 - 3 = 41 socks. The answer is 41."], "answer": "43"}
{"input": "Maria had 14 bottles of water in her fridge. If she drank 8 of them and then bought 45 more, how many bottles would she have?", "output": ["She had 14 bottles of water in her fridge. She drank 8 of them, so now she has 14 - 8 = 6 bottles left. Then she bought 45 more, so now she has 6 + 45 = 51 bottles. The answer is 51."], "answer": "51"}
{"input": "A teacher had 34 worksheets to grade. If she graded 7, but then another 36 were turned in, how many worksheets would she have to grade?", "output": ["She graded 7. Then 36 more were turned in. So now she has to grade 7 + 36 = 43 worksheets. The answer is 43."], "answer": "63"}
{"input": "At the fair there were 7 people in line for the bumper cars. If 4 of them got tired of waiting and left and 8 more got in line, how many people would be in line?", "output": ["There were 7 people in line. 4 left, so now there are 3. 8 more got in line, so now there are 11. The answer is 11."], "answer": "11"}
{"input": "Emily had 7 coloring books. If she gave away 2 of them, but then bought 14 more, how many would she have total?", "output": ["She had 7 coloring books. She gave away 2, so now she has 5 coloring books. She bought 14 more, so now she has 5 + 14 = 19 coloring books. The answer is 19."], "answer": "19"}
{"input": "At the arcade Dave won 25 tickets. If he spent 22 tickets on a beanie and later won 15 more tickets, how many would he have?", "output": ["Dave won 25 tickets. He spent 22 tickets on a beanie. So now he has 25 - 22 = 3 tickets left. He later won 15 more tickets, so now he has 3 + 15 = 18 tickets. The answer is 18."], "answer": "18"}
{"input": "Robin had 30 songs on her mp3 player. If she deleted 8 old songs from it and then added 10 new songs, how many songs does she have on her mp3 player?", "output": ["She had 30 songs on her mp3 player. She deleted 8 old songs, so now she has 30 - 8 = 22 songs. Then she added 10 new songs, so now she has 22 + 10 = 32 songs. The answer is 32."], "answer": "32"}
{"input": "The school cafeteria had 23 apples. If they used 20 to make lunch for the students and then bought 6 more, how many apples would they have?", "output": ["They used 20 apples to make lunch for the students. They bought 6 more. So in total they have 26 apples. The answer is 26."], "answer": "9"}
{"input": "Janet was playing a video game and had 38 lives. In a hard part of the game she lost 16 lives. If she got 32 more lives in the next level, how many lives would she have?", "output": ["She had 38 lives. She lost 16 lives. So now she has 38 - 16 = 22 lives. Then she got 32 more lives, so now she has 22 + 32 = 54 lives. The answer is 54."], "answer": "54"}
{"input": "Megan picked 19 carrots from her garden. If she threw out 4 of them and then picked 46 more the next day, how many carrots would she have total?", "output": ["She picked 19 carrots from her garden. She threw out 4 of them, so now she has 15 carrots. The next day she picked 46 more, so now she has 15 + 46 = 61 carrots. The answer is 61."], "answer": "61"}
{"input": "Roger had 45 dollars in January. By March he had spent 20 dollars. If he got another 46 dollars from his mom, how much money would he have?", "output": ["Roger had 45 dollars in January. He spent 20 dollars in March. That means he had 45 - 20 = 25 dollars in March. Then he got 46 dollars from his mom. So in total he has 46 + 25 = 71 dollars. The answer is 71."], "answer": "71"}
{"input": "The school cafeteria had 17 apples. If they used 2 to make lunch for the students and then bought 23 more, how many apples would they have?", "output": ["They had 17 apples. They used 2 to make lunch for the students. So now they have 17 - 2 = 15 apples. Then they bought 23 more, so now they have 15 + 23 = 38 apples. The answer is 38."], "answer": "38"}
{"input": "Janet was playing a video game and had 47 lives. In a hard part of the game she lost 23 lives. If she got 46 more lives in the next level, how many lives would she have?", "output": ["She had 47 lives. She lost 23 lives. That means she has 47 - 23 = 24 lives left. Then she got 46 more lives. So now she has 24 + 46 = 70 lives. The answer is 70."], "answer": "70"}
{"input": "Nancy picked 12 carrots from her garden. If she threw out 2 of them and then picked 21 more the next day, how many carrots would she have total?", "output": ["She picked 12 carrots from her garden. She threw out 2 of them, so now she has 10 carrots. The next day she picked 21 more, so now she has 21 + 10 = 31 carrots. The answer is 31."], "answer": "31"}
{"input": "Bianca had 34 songs on her mp3 player. If she deleted 14 old songs from it and then added 44 new songs, how many songs does she have on her mp3 player?", "output": ["She had 34 songs on her mp3 player. She deleted 14 old songs, so now she has 34 - 14 = 20 songs. Then she added 44 new songs, so now she has 20 + 44 = 64 songs. The answer is 64."], "answer": "64"}
{"input": "Tom had 5 books. If he sold 4 of them and used the money he earned to buy 38 new books, how many books would Tom have?", "output": ["Tom had 5 books. He sold 4 of them, so now he has 1 book. He used the money he earned to buy 38 new books. So now he has 1 + 38 = 39 books. The answer is 39."], "answer": "39"}
{"input": "John had 33 socks. If he threw away 19 old ones that didn't fit and bought 13 new ones, how many socks would he have?", "output": ["He had 33 socks. He threw away 19 old ones that didn't fit. So now he has 33 - 19 = 14 socks. Then he bought 13 new ones. So now he has 14 + 13 = 27 socks. The answer is 27."], "answer": "27"}
{"input": "For the school bake sale Maria made 19 cupcakes. If she sold 5 of them and then made 10 more, how many cupcakes would she have?", "output": ["She made 19 cupcakes. She sold 5 of them, so now she has 19 - 5 = 14 cupcakes. Then she made 10 more, so now she has 14 + 10 = 24 cupcakes. The answer is 24."], "answer": "24"}
{"input": "A store had 50 oranges in a bin. If they threw away 40 of the old ones and put 24 new ones in the bin how many would be in the bin?", "output": ["They threw away 40 old ones and put 24 new ones in the bin. That means they have 24 + 40 = 64 oranges in the bin. The answer is 64."], "answer": "34"}
{"input": "In fourth grade there were 8 students at the start of the year. During the year 5 students left and 8 new students came to school. How many students were in fourth grade at the end?", "output": ["There were 8 students at the start of the year. During the year 5 students left and 8 new students came to school. That means there were 8 + 5 - 8 = 3 students at the end of the year. The answer is 3."], "answer": "11"}
{"input": "Bianca picked 23 carrots from her garden. If she threw out 10 of them and then picked 47 more the next day, how many carrots would she have total?", "output": ["She picked 23 carrots from her garden. She threw out 10 of them, so now she has 23 - 10 = 13 carrots. The next day she picked 47 more, so now she has 13 + 47 = 60 carrots. The answer is 60."], "answer": "60"}
{"input": "Zoe had 42 bottles of water in her fridge. If she drank 25 of them and then bought 30 more, how many bottles would she have?", "output": ["She drank 25 bottles of water. She bought 30 more. So now she has 25 + 30 = 55 bottles of water. The answer is 55."], "answer": "47"}
{"input": "Katie had 11 songs on her mp3 player. If she deleted 7 old songs from it and then added 24 new songs, how many songs does she have on her mp3 player?", "output": ["She had 11 songs on her mp3 player. She deleted 7 old songs, so now she has 11 - 7 = 4 old songs. She added 24 new songs, so now she has 4 + 24 = 28 songs. The answer is 28."], "answer": "28"}
{"input": "A store had 5 oranges in a bin. If they threw away 2 of the old ones and put 28 new ones in the bin how many would be in the bin?", "output": ["They threw away 2 old ones and put 28 new ones in the bin. So now there are 28 + 2 = 30 oranges in the bin. The answer is 30."], "answer": "31"}
{"input": "Adam had 48 books. If he sold 19 of them and used the money he earned to buy 38 new books, how many books would Adam have?", "output": ["He had 48 books. He sold 19 of them, so now he has 48 - 19 = 29 books. He used the money he earned to buy 38 new books, so now he has 29 + 38 = 67 books. The answer is 67."], "answer": "67"}
{"input": "In fourth grade there were 31 students at the start of the year. During the year 5 students left and 11 new students came to school. How many students were in fourth grade at the end?", "output": ["There were 31 students at the start of the year. During the year 5 students left and 11 new students came to school. That means there were 31 - 5 + 11 = 31 - 5 + 11 = 26 students at the end of the year. The answer is 26."], "answer": "37"}
{"input": "For the school bake sale Robin made 42 cupcakes. If she sold 22 of them and then made 39 more, how many cupcakes would she have?", "output": ["Robin made 42 cupcakes. She sold 22 of them. That means she has 42 - 22 = 20 cupcakes left. She made 39 more, so now she has 20 + 39 = 59 cupcakes. The answer is 59."], "answer": "59"}
{"input": "A florist had 11 roses. If she sold 2 of them and then later picked 32 more, how many roses would she have?", "output": ["She had 11 roses. She sold 2 of them, so now she has 9 roses. Then she picked 32 more, so now she has 9 + 32 = 41 roses. The answer is 41."], "answer": "41"}
{"input": "Frank had 11 dollars. At the store he spent $3 on a new game. If he got another 14 dollars for his allowance, how much money does he have now?", "output": ["Frank had 11 dollars. He spent $3 on a new game. So now he has 11 - 3 = 8 dollars. Then he got another 14 dollars for his allowance. So now he has 8 + 14 = 22 dollars. The answer is 22."], "answer": "22"}
{"input": "Haley was playing a video game and had 14 lives. In a hard part of the game she lost 4 lives. If she got 36 more lives in the next level, how many lives would she have?", "output": ["She had 14 lives. She lost 4 lives. So now she has 14 - 4 = 10 lives. She got 36 more lives in the next level. So now she has 10 + 36 = 46 lives. The answer is 46."], "answer": "46"}
{"input": "Luke had 48 dollars in January. By March he had spent 11 dollars. If he got another 21 dollars from his mom, how much money would he have?", "output": ["He had 48 dollars in January. He spent 11 dollars in March. That means he had 48 - 11 = 37 dollars in March. He got 21 dollars from his mom, so now he has 37 + 21 = 58 dollars. The answer is 58."], "answer": "58"}
{"input": "Emily was playing a video game and had 42 lives. In a hard part of the game she lost 25 lives. If she got 24 more lives in the next level, how many lives would she have?", "output": ["She had 42 lives. She lost 25 lives. So now she has 42 - 25 = 17 lives. Then she got 24 more lives, so now she has 17 + 24 = 41 lives. The answer is 41."], "answer": "41"}
{"input": "Debby had 30 coloring books. If she gave away 7 of them, but then bought 35 more, how many would she have total?", "output": ["She had 30 coloring books. She gave away 7 of them, so now she has 30 - 7 = 23 coloring books. Then she bought 35 more, so now she has 23 + 35 = 58 coloring books. The answer is 58."], "answer": "58"}
{"input": "The school cafeteria had 12 apples. If they used 8 to make lunch for the students and then bought 19 more, how many apples would they have?", "output": ["They used 8 apples to make lunch for the students. They bought 19 more. So in total they have 8 + 19 = 27 apples. The answer is 27."], "answer": "23"}
{"input": "At the fair there were 31 people in line for the bumper cars. If 25 of them got tired of waiting and left and 25 more got in line, how many people would be in line?", "output": ["There were 31 people in line. 25 left, so now there are 6 people in line. 25 more got in line, so now there are 31 + 25 = 56 people in line. The answer is 56."], "answer": "31"}
{"input": "A florist had 50 roses. If she sold 15 of them and then later picked 21 more, how many roses would she have?", "output": ["She had 50 roses. She sold 15 of them, so now she has 50 - 15 = 35 roses. Then she picked 21 more, so now she has 35 + 21 = 56 roses. The answer is 56."], "answer": "56"}
{"input": "Zoe had 6 songs on her mp3 player. If she deleted 3 old songs from it and then added 20 new songs, how many songs does she have on her mp3 player?", "output": ["She had 6 songs on her mp3 player. She deleted 3 old songs, so now she has 3 - 3 = 0 old songs. She added 20 new songs, so now she has 0 + 20 = 20 songs. The answer is 20."], "answer": "23"}
{"input": "At the arcade Dave won 11 tickets. If he spent 5 tickets on a beanie and later won 10 more tickets, how many would he have?", "output": ["He won 11 tickets. He spent 5 tickets on a beanie. So now he has 11 - 5 = 6 tickets left. He won 10 more tickets, so now he has 6 + 10 = 16 tickets. The answer is 16."], "answer": "16"}
{"input": "A waiter had 33 customers to wait on. If 31 customers left and he got another 26 customers, how many customers would he have?", "output": ["He had 33 customers to wait on. 31 customers left. That means he has 33 - 31 = 2 customers left. Then he got 26 more customers. That means he has 2 + 26 = 28 customers. The answer is 28."], "answer": "28"}
{"input": "In fourth grade there were 11 students at the start of the year. During the year 6 students left and 42 new students came to school. How many students were in fourth grade at the end?", "output": ["There were 11 students at the start of the year. During the year 6 students left and 42 new students came to school. That means there were 11 + 6 - 42 = 11 students at the end of the year. The answer is 11."], "answer": "47"}
{"input": "Oliver had 11 socks. If he threw away 4 old ones that didn't fit and bought 26 new ones, how many socks would he have?", "output": ["He had 11 socks. He threw away 4 old ones that didn't fit. So now he has 11 - 4 = 7 socks. Then he bought 26 new ones. So now he has 7 + 26 = 33 socks. The answer is 33."], "answer": "33"}
{"input": "A store had 40 oranges in a bin. If they threw away 25 of the old ones and put 21 new ones in the bin how many would be in the bin?", "output": ["They threw away 25 old ones and put 21 new ones in the bin. That means they have 25 - 21 = 4 old ones left. They had 40 oranges in the beginning, so now they have 4 + 40 = 44 oranges. The answer is 44."], "answer": "36"}
{"input": "At the arcade Edward won 9 tickets. If he spent 4 tickets on a beanie and later won 4 more tickets, how many would he have?", "output": ["He won 9 tickets. He spent 4 tickets on a beanie. So now he has 9 - 4 = 5 tickets left. He won 4 more tickets, so now he has 5 + 4 = 9 tickets. The answer is 9."], "answer": "9"}
{"input": "In fourth grade there were 4 students at the start of the year. During the year 3 students left and 42 new students came to school. How many students were in fourth grade at the end?", "output": ["There were 4 students at the start of the year. 3 students left and 42 new students came to school. That means there were 4 + 3 - 42 = 37 students at the end of the year. The answer is 37."], "answer": "43"}
{"input": "Haley picked 28 carrots from her garden. If she threw out 11 of them and then picked 9 more the next day, how many carrots would she have total?", "output": ["She picked 28 carrots from her garden. She threw out 11 of them, so now she has 17 carrots. She picked 9 more the next day, so now she has 26 carrots. The answer is 26."], "answer": "26"}
{"input": "Roger had 25 books. If he sold 21 of them and used the money he earned to buy 30 new books, how many books would Roger have?", "output": ["Roger had 25 books. He sold 21 of them, so now he has 4 books left. He used the money he earned to buy 30 new books. So now he has 4 + 30 = 34 books. The answer is 34."], "answer": "34"}
{"input": "A florist had 5 roses. If she sold 3 of them and then later picked 34 more, how many roses would she have?", "output": ["She had 5 roses. She sold 3 of them, so now she has 2 roses. Then she picked 34 more, so now she has 2 + 34 = 36 roses. The answer is 36."], "answer": "36"}
{"input": "Wendy was playing a video game and had 10 lives. In a hard part of the game she lost 6 lives. If she got 37 more lives in the next level, how many lives would she have?", "output": ["She had 10 lives. She lost 6 lives. So now she has 10 - 6 = 4 lives. In the next level she got 37 more lives. So now she has 4 + 37 = 41 lives. The answer is 41."], "answer": "41"}
{"input": "John had 5 dollars. At the store he spent $2 on a new game. If he got another 26 dollars for his allowance, how much money does he have now?", "output": ["He had 5 dollars. He spent $2 on a new game. So now he has 5 - 2 = 3 dollars. Then he got 26 dollars for his allowance. So now he has 3 + 26 = 29 dollars. The answer is 29."], "answer": "29"}
{"input": "For the school bake sale Chloe made 28 cupcakes. If she sold 25 of them and then made 8 more, how many cupcakes would she have?", "output": ["She made 28 cupcakes. She sold 25 of them. That means she has 3 left. She made 8 more, so now she has 11 cupcakes. The answer is 11."], "answer": "11"}
{"input": "At the town carnival Billy rode the ferris wheel 7 times and the bumper cars 3 times. If each ride cost 5 tickets, how many tickets did he use?", "output": ["Billy rode the ferris wheel 7 times and the bumper cars 3 times. That means he rode the ferris wheel 7 * 5 = 35 times and the bumper cars 3 * 5 = 15 times. In total he rode 35 + 15 = 50 times. The answer is 50."], "answer": "50"}
{"input": "Chloe was unboxing some of her old winter clothes. She found 4 boxes of clothing and inside each box there were 2 scarves and 6 mittens. How many pieces of winter clothing did Chloe have total?", "output": ["Chloe found 4 boxes of clothing. Each box had 2 scarves and 6 mittens. That means in total there were 4 * 2 * 6 = 48 scarves and 4 * 2 * 6 = 48 mittens. The answer is 48."], "answer": "32"}
{"input": "A waiter had 9 tables he was waiting on, with 7 women and 3 men at each table. How many customers total did the waiter have?", "output": ["There are 9 tables with 7 women and 3 men at each table. That means there are 9 * 7 * 3 = 221 women and 9 * 3 = 27 men. The answer is 221 + 27 = 248 customers."], "answer": "90"}
{"input": "April's discount flowers was having a sale where each flower was 3 dollars. If Emily bought 2 roses and 2 daisies, how much did she spend?", "output": ["Emily bought 2 roses and 2 daisies. Each rose was $3, so 2 * $3 = $6. Each daisy was $3, so 2 * $3 = $6. So in total Emily spent $6 + $6 = $12. The answer is 12."], "answer": "12"}
{"input": "Isabel had 2 pages of math homework and 4 pages of reading homework. If each page had 5 problems on it, how many problems did she have to complete total?", "output": ["Isabel had 2 pages of math homework and 4 pages of reading homework. That means she had 2 + 4 = 6 pages of homework. Each page had 5 problems on it, so in total she had 6 * 5 = 30 problems. The answer is 30."], "answer": "30"}
{"input": "Wendy was playing a video game where she scores 5 points for each treasure she finds. If she found 4 treasures on the first level and 3 on the second, what would her score be?", "output": ["She found 4 treasures on the first level and 3 on the second. That means she found 4 + 3 = 7 treasures. She scores 5 points for each treasure, so her score is 7 * 5 = 35. The answer is 35."], "answer": "35"}
{"input": "There were 7 friends playing a video game online when 2 more players joined the game. If each player had 7 lives, how many lives did they have total?", "output": ["There were 7 friends playing a video game online. 2 more players joined the game. That means there are 9 players in total. Each player had 7 lives, so in total there are 9 * 7 = 63 lives. The answer is 63."], "answer": "63"}
{"input": "Paul bought 6 boxes of chocolate candy and 4 boxes of caramel candy. If each box has 9 pieces inside it, how much candy did he have total?", "output": ["He bought 6 boxes of chocolate candy and 4 boxes of caramel candy. That means he bought 6 * 9 = 54 chocolates and 4 * 9 = 36 caramels. He had 54 + 36 = 90 pieces of candy. The answer is 90."], "answer": "90"}
{"input": "A pet store has 6 bird cages. If each cage has 6 parrots and 2 parakeets in it, how many birds does the pet store have total?", "output": ["There are 6 bird cages. Each bird cage has 6 parrots and 2 parakeets. That means there are 6 * 6 + 2 * 2 = 48 parrots and 12 parakeets. The answer is 60."], "answer": "48"}
{"input": "Rachel was organizing her book case making sure each of the shelves had exactly 9 books on it. If she had 6 shelves of mystery books and 2 shelves of picture books, how many books did she have total?", "output": ["She had 6 shelves of mystery books and 2 shelves of picture books. That means she had 6 * 9 = 54 mystery books and 2 * 9 = 18 picture books. In total she had 54 + 18 = 72 books. The answer is 72."], "answer": "72"}
{"input": "Rachel was unboxing some of her old winter clothes. She found 7 boxes of clothing and inside each box there were 3 scarves and 4 mittens. How many pieces of winter clothing did Rachel have total?", "output": ["She found 7 boxes of clothing. Inside each box there were 3 scarves and 4 mittens. That means in total there were 7 * 3 * 4 = 84 scarves and 7 * 3 * 4 = 84 mittens. The answer is 84."], "answer": "49"}
{"input": "A pet store has 9 bird cages. If each cage has 2 parrots and 2 parakeets in it, how many birds does the pet store have total?", "output": ["There are 9 bird cages. Each cage has 2 parrots and 2 parakeets. That means there are 9 * 2 * 2 = 36 birds. The answer is 36."], "answer": "36"}
{"input": "Cody bought 7 boxes of chocolate candy and 3 boxes of caramel candy. If each box has 8 pieces inside it, how much candy did he have total?", "output": ["Cody bought 7 boxes of chocolate candy and 3 boxes of caramel candy. That means he bought 7 + 3 = 10 boxes of candy. Each box has 8 pieces inside it, so in total he has 10 * 8 = 80 pieces of candy. The answer is 80."], "answer": "80"}
{"input": "At Billy's Restaurant a group with 2 adults and 5 children came in to eat. If each meal cost 3 dollars, how much was the bill?", "output": ["The bill is 3 * 2 + 5 * 3 = $23. The answer is 23."], "answer": "21"}
{"input": "Paul was collecting cans for recycling. On Saturday he filled 6 bags up and on Sunday he filled 3 more bags. If each bag had 8 cans in it, how many cans did he pick up total?", "output": ["On Saturday he filled 6 bags. Each bag had 8 cans in it, so in total he had 6 * 8 = 48 cans. On Sunday he filled 3 more bags. Each bag had 8 cans in it, so in total he had 3 * 8 = 24 cans. In total he had 48 + 24 = 72 cans. The answer is 72."], "answer": "72"}
{"input": "While playing a trivia game, Adam answered 5 questions correct in the first half and 5 questions correct in the second half. If each question was worth 5 points, what was his final score?", "output": ["Adam answered 5 questions correct in the first half and 5 questions correct in the second half. This means he answered 10 questions correct in total. Each question was worth 5 points, so in total he got 10 * 5 = 50 points. The answer is 50."], "answer": "50"}
{"input": "Haley's favorite band was holding a concert where tickets were 4 dollars each. Haley bought 3 tickets for herself and her friends and 5 extra tickets in case anyone else wanted to go. How much did she spend?", "output": ["She bought 3 tickets for herself and her friends. This means she spent 3 * 4 = $12 on the tickets. She bought 5 extra tickets. This means she spent 5 * 4 = $20 on the extra tickets. She spent $12 + $20 = $32. The answer is 32."], "answer": "32"}
{"input": "Luke was putting his spare change into piles. He had 5 piles of quarters and 5 piles of dimes. If each pile had 3 coins in it, how many coins did he have total?", "output": ["He had 5 piles of quarters and 5 piles of dimes. Each pile had 3 coins in it. That means in total he had 5 * 3 = 15 piles of quarters and 5 * 3 = 15 piles of dimes. The answer is 30."], "answer": "30"}
{"input": "Victor and his friend were buying trick decks from the magic shop for 8 dollars each. How much did they spend if Victor bought 6 decks and his friend bought 2 decks?", "output": ["Victor bought 6 decks. His friend bought 2 decks. That means in total they bought 6 + 2 = 8 decks. They each paid $8 for each deck, so in total they spent 8 * 8 = 64 dollars. The answer is 64."], "answer": "64"}
{"input": "Katie had 7 pages of math homework and 3 pages of reading homework. If each page had 9 problems on it, how many problems did she have to complete total?", "output": ["7 pages of math homework and 3 pages of reading homework. That means she had 7 + 3 = 10 pages of homework. Each page had 9 problems, so in total she had 10 * 9 = 90 problems. The answer is 90."], "answer": "90"}
{"input": "Faye was playing a video game where she scores 7 points for each treasure she finds. If she found 2 treasures on the first level and 6 on the second, what would her score be?", "output": ["She found 2 treasures on the first level and 6 on the second. That means she found 2 + 6 = 8 treasures. She scores 7 points for each treasure, so her score must be 8 * 7 = 56 points. The answer is 56."], "answer": "56"}
{"input": "Gwen was organizing her book case making sure each of the shelves had exactly 9 books on it. If she had 3 shelves of mystery books and 5 shelves of picture books, how many books did she have total?", "output": ["She had 3 shelves of mystery books and 5 shelves of picture books. That means she had 3 * 9 = 27 mystery books and 5 * 9 = 45 picture books. In total she had 27 + 45 = 72 books. The answer is 72."], "answer": "72"}
{"input": "There were 2 friends playing a video game online when 2 more players joined the game. If each player had 6 lives, how many lives did they have total?", "output": ["There were 2 friends playing a video game online when 2 more players joined the game. That means there were 4 players in total. Each player had 6 lives, so in total there are 4 * 6 = 24 lives. The answer is 24."], "answer": "24"}
{"input": "Wendy bought 4 new chairs and 4 new tables for her house. If she spent 6 minutes on each piece furniture putting it together, how many minutes did it take her to finish?", "output": ["She bought 4 new chairs and 4 new tables. She spent 6 minutes on each piece of furniture. That means she spent 6 minutes on the first chair, 6 minutes on the second chair, 6 minutes on the third chair, and 6 minutes on the fourth chair. She spent 6 minutes on the first table, 6 minutes on the second table, 6 minutes on the third table, and 6 minutes on the fourth table. So in total she spent 6 minutes on the first chair, 6 minutes on the second chair, 6 minutes on the third chair, 6 minutes on the fourth chair, 6 minutes on the first table, 6 minutes on the second table, 6 minutes on the third table, and 6 minutes on the fourth table. That means she spent 6 minutes on the first chair, 6 minutes on the second chair, 6 minutes on the third chair, 6 minutes on the fourth chair, 6 minutes on the first table, 6 minutes on the second table, 6 minutes on the third table, and 6 minutes on the fourth table. That means she spent 6 minutes on the first chair, 6 minutes on the second chair, 6 minutes on the third chair, 6 minutes on the fourth chair, 6 minutes on the first table, 6 minutes on the second table, 6 minutes on the third table, and 6 minutes on the fourth table. That means she spent 6 minutes on the first chair, 6 minutes on the second chair, 6 minutes on the third chair, 6 minutes on the fourth chair, 6 minutes on the first table, 6 minutes on the second table, 6 minutes on the"], "answer": "48"}
{"input": "April's discount flowers was having a sale where each flower was 3 dollars. If Zoe bought 8 roses and 2 daisies, how much did she spend?", "output": ["Each flower was $3. 8 roses and 2 daisies were bought. This means 8 * 3 = 24 dollars were spent on roses. 2 * 3 = 6 dollars were spent on daisies. In total, 24 + 6 = 30 dollars were spent. The answer is 30."], "answer": "30"}
{"input": "Paige was unboxing some of her old winter clothes. She found 6 boxes of clothing and inside each box there were 5 scarves and 5 mittens. How many pieces of winter clothing did Paige have total?", "output": ["Paige had 6 boxes of clothing. Each box had 5 scarves and 5 mittens. That means in total 6 * 5 = 30 scarves and 30 mittens. The answer is 30."], "answer": "60"}
{"input": "Sam was collecting cans for recycling. On Saturday he filled 4 bags up and on Sunday he filled 3 more bags. If each bag had 6 cans in it, how many cans did he pick up total?", "output": ["On Saturday he filled 4 bags. Each bag had 6 cans in it, so in total he had 4 * 6 = 24 cans. On Sunday he filled 3 more bags. Each bag had 6 cans in it, so in total he had 3 * 6 = 18 cans. In total he had 24 + 18 = 42 cans. The answer is 42."], "answer": "42"}
{"input": "George was working as a sacker at a grocery store where he made 5 dollars an hour. On Monday he worked 7 hours and on Tuesday he worked 2 hours. How much money did George make in those two days?", "output": ["George made 5 dollars an hour. He worked 7 hours on Monday and 2 hours on Tuesday. That means he made 5 * 7 + 5 * 2 = $42. The answer is 42."], "answer": "45"}
{"input": "While playing a trivia game, Frank answered 3 questions correct in the first half and 2 questions correct in the second half. If each question was worth 3 points, what was his final score?", "output": ["Frank answered 3 questions correct in the first half and 2 questions correct in the second half. That means he answered 3 + 2 = 5 questions correct in total. Each question was worth 3 points, so his final score must be 5 * 3 = 15 points. The answer is 15."], "answer": "15"}
{"input": "Edward and his friend were buying trick decks from the magic shop for 9 dollars each. How much did they spend if Edward bought 4 decks and his friend bought 4 decks?", "output": ["Edward and his friend bought 4 decks each. This means they spent 4 * $9 = $36. Edward had 4 decks, so now he has 4 * $9 = $36. His friend had 4 decks, so now he has 4 * $9 = $36. The answer is $36."], "answer": "72"}
{"input": "Tom and his friend were buying trick decks from the magic shop for 8 dollars each. How much did they spend if Tom bought 3 decks and his friend bought 5 decks?", "output": ["Tom bought 3 decks and his friend bought 5 decks. This means they spent 3 * 8 = 24 dollars. The answer is 24."], "answer": "64"}
{"input": "While shopping for music online, Megan bought 2 country albums and 8 pop albums. Each album came with a lyric sheet and had 7 songs. How many songs did Megan buy total?", "output": ["Megan bought 2 country albums and 8 pop albums. Each album had 7 songs. That means in total 2 * 7 + 8 * 7 = 62 songs. The answer is 62."], "answer": "70"}
{"input": "Victor was working as a sacker at a grocery store where he made 6 dollars an hour. On Monday he worked 5 hours and on Tuesday he worked 5 hours. How much money did Victor make in those two days?", "output": ["Victor made 6 dollars an hour. He worked 5 hours on Monday and 5 hours on Tuesday. That means he made 6 * 5 = 30 dollars on Monday and 6 * 5 = 30 dollars on Tuesday. The answer is 60 dollars."], "answer": "60"}
{"input": "A pet store has 6 bird cages. If each cage has 2 parrots and 7 parakeets in it, how many birds does the pet store have total?", "output": ["There are 6 bird cages. Each cage has 2 parrots and 7 parakeets. That means there are 6 * 2 + 6 * 7 = 48 parrots and 6 * 2 + 6 * 7 = 42 parakeets. The answer is 90."], "answer": "54"}
{"input": "Maria bought 2 new chairs and 2 new tables for her house. If she spent 8 minutes on each piece furniture putting it together, how many minutes did it take her to finish?", "output": ["She bought 2 new chairs and 2 new tables. She spent 8 minutes on each piece of furniture. That means she spent 8 minutes on the first chair, 8 minutes on the second chair, 8 minutes on the first table, and 8 minutes on the second table. That means she spent 8 + 8 + 8 + 8 = 32 minutes. The answer is 32."], "answer": "32"}
{"input": "Olivia was playing a video game where she scores 8 points for each treasure she finds. If she found 2 treasures on the first level and 2 on the second, what would her score be?", "output": ["She found 2 treasures on the first level and 2 on the second. That means she found 4 treasures in total. She scores 8 points for each treasure, so in total she scores 8 * 4 = 32 points. The answer is 32."], "answer": "32"}
{"input": "A waiter had 6 tables he was waiting on, with 3 women and 5 men at each table. How many customers total did the waiter have?", "output": ["There are 6 tables with 3 women and 5 men at each table. That means there are 6 * 3 * 5 = 90 customers. The answer is 90."], "answer": "48"}
{"input": "Faye was selling her necklaces at a garage sale. She sold 3 bead necklaces and 7 gem stone necklaces. If each necklace cost 7 dollars, how much money did she earn?", "output": ["She sold 3 bead necklaces and 7 gem stone necklaces. That means she sold 3 * 7 = 21 bead necklaces and 7 * 7 = 49 gem stone necklaces. She earned 21 * 7 = 147 dollars. The answer is 147."], "answer": "70"}
{"input": "At the town carnival Oliver rode the ferris wheel 5 times and the bumper cars 4 times. If each ride cost 7 tickets, how many tickets did he use?", "output": ["Oliver rode the ferris wheel 5 times and the bumper cars 4 times. That means he rode the ferris wheel 5 * 7 = 35 times and the bumper cars 4 * 7 = 28 times. In total he rode 35 + 28 = 63 times. The answer is 63."], "answer": "63"}
{"input": "There were 5 friends playing a video game online when 2 more players joined the game. If each player had 8 lives, how many lives did they have total?", "output": ["There were 5 friends playing a video game online. 2 more players joined the game. That means there are 7 players in total. Each player had 8 lives, so in total there are 7 * 8 = 56 lives. The answer is 56."], "answer": "56"}
{"input": "Katie was selling her necklaces at a garage sale. She sold 4 bead necklaces and 3 gem stone necklaces. If each necklace cost 3 dollars, how much money did she earn?", "output": ["She sold 4 bead necklaces and 3 gem stone necklaces. This means she sold 4 * 3 = 12 bead necklaces and 3 * 3 = 9 gem stone necklaces. She earned 12 * 3 = 36 dollars from the bead necklaces and 9 * 3 = 27 dollars from the gem stone necklaces. She earned 36 + 27 = 63 dollars. The answer is 63."], "answer": "21"}
{"input": "Edward was working as a sacker at a grocery store where he made 6 dollars an hour. On Monday he worked 3 hours and on Tuesday he worked 5 hours. How much money did Edward make in those two days?", "output": ["Edward made 6 dollars an hour. He worked 3 hours on Monday and 5 hours on Tuesday. That means he made 6 * 3 = $18 on Monday and 6 * 5 = $30 on Tuesday. In total he made $18 + $30 = $48. The answer is 48."], "answer": "48"}
{"input": "While playing a trivia game, Mike answered 3 questions correct in the first half and 5 questions correct in the second half. If each question was worth 3 points, what was his final score?", "output": ["Mike answered 3 questions correct in the first half and 5 questions correct in the second half. This means he answered a total of 8 questions correct. Each question was worth 3 points, so in total he earned 8 * 3 = 24 points. The answer is 24."], "answer": "24"}
{"input": "Amy was playing a video game where she scores 4 points for each treasure she finds. If she found 6 treasures on the first level and 2 on the second, what would her score be?", "output": ["She found 6 treasures on the first level and 2 on the second. That means she found 6 + 2 = 8 treasures. She scores 4 points for each treasure, so her score is 8 * 4 = 32 points. The answer is 32."], "answer": "32"}
{"input": "A waiter had 9 tables he was waiting on, with 4 women and 3 men at each table. How many customers total did the waiter have?", "output": ["There are 9 tables. Each table has 4 women and 3 men. That means there are 9 * 4 * 3 = 108 customers. The answer is 108."], "answer": "63"}
{"input": "Chloe was organizing her book case making sure each of the shelves had exactly 6 books on it. If she had 5 shelves of mystery books and 4 shelves of picture books, how many books did she have total?", "output": ["She had 5 shelves of mystery books and 4 shelves of picture books. That means she had 5 * 6 = 30 mystery books and 4 * 6 = 24 picture books. In total she had 30 + 24 = 54 books. The answer is 54."], "answer": "54"}
{"input": "While shopping for music online, Isabel bought 6 country albums and 2 pop albums. Each album came with a lyric sheet and had 9 songs. How many songs did Isabel buy total?", "output": ["Isabel bought 6 country albums and 2 pop albums. Each album had 9 songs. That means in total 6 * 9 = 54 songs. The answer is 54."], "answer": "72"}
{"input": "At Oliver's Restaurant a group with 2 adults and 4 children came in to eat. If each meal cost 3 dollars, how much was the bill?", "output": ["The bill is 3 * 2 + 4 * 3 = $23. The answer is 23."], "answer": "18"}
{"input": "Tiffany had 6 pages of math homework and 4 pages of reading homework. If each page had 3 problems on it, how many problems did she have to complete total?", "output": ["She had 6 pages of math homework and 4 pages of reading homework. That means she had 6 * 3 + 4 * 3 = 30 math problems and 4 * 3 = 12 reading problems. The answer is 42."], "answer": "30"}
{"input": "April's discount flowers was having a sale where each flower was 3 dollars. If Robin bought 5 roses and 4 daisies, how much did she spend?", "output": ["Robin bought 5 roses and 4 daisies. This means she spent 5 * 3 = $15 on the roses. She spent 4 * 3 = $12 on the daisies. She spent $15 + $12 = $27. The answer is 27."], "answer": "27"}
{"input": "Zoe was unboxing some of her old winter clothes. She found 8 boxes of clothing and inside each box there were 4 scarves and 6 mittens. How many pieces of winter clothing did Zoe have total?", "output": ["8 boxes of clothing. Each box has 4 scarves and 6 mittens. That means in total 8 * (4 + 6) = 64 pieces of winter clothing. The answer is 64."], "answer": "80"}
{"input": "There were 2 friends playing a video game online when 2 more players joined the game. If each player had 3 lives, how many lives did they have total?", "output": ["There were 2 friends playing a video game online when 2 more players joined the game. That means there were 4 players in total. Each player had 3 lives, so in total there were 4 * 3 = 12 lives. The answer is 12."], "answer": "12"}
{"input": "Adam bought 2 boxes of chocolate candy and 5 boxes of caramel candy. If each box has 4 pieces inside it, how much candy did he have total?", "output": ["He bought 2 boxes of chocolate candy and 5 boxes of caramel candy. That means he bought 2 * 4 + 5 * 4 = 22 pieces of chocolate candy and 5 * 4 = 20 pieces of caramel candy. The answer is 22 + 20 = 42 pieces of candy."], "answer": "28"}
{"input": "A pet store has 8 bird cages. If each cage has 2 parrots and 7 parakeets in it, how many birds does the pet store have total?", "output": ["There are 8 bird cages. Each cage has 2 parrots and 7 parakeets. That means in total there are 8 * 2 + 8 * 7 = 64 parrots and 64 * 7 = 448 parakeets. The answer is 448."], "answer": "72"}
{"input": "Lana's favorite band was holding a concert where tickets were 6 dollars each. Lana bought 8 tickets for herself and her friends and 2 extra tickets in case anyone else wanted to go. How much did she spend?", "output": ["Lana bought 8 tickets for herself and her friends. Each ticket was $6, so in total she spent $6 * 8 = $48. She also bought 2 extra tickets. Each ticket was $6, so in total she spent $6 * 2 = $12. In total she spent $48 + $12 = $60. The answer is 60."], "answer": "60"}
{"input": "At Tom's Restaurant a group with 2 adults and 5 children came in to eat. If each meal cost 8 dollars, how much was the bill?", "output": ["The bill is 8 * 2 + 8 * 5 = $48. The answer is 48."], "answer": "56"}
{"input": "Gwen was organizing her book case making sure each of the shelves had exactly 4 books on it. If she had 5 shelves of mystery books and 3 shelves of picture books, how many books did she have total?", "output": ["She had 5 shelves of mystery books and 3 shelves of picture books. That means she had 5 * 4 = 20 mystery books and 3 * 4 = 12 picture books. In total she had 20 + 12 = 32 books. The answer is 32."], "answer": "32"}
{"input": "While shopping for music online, Isabel bought 4 country albums and 5 pop albums. Each album came with a lyric sheet and had 8 songs. How many songs did Isabel buy total?", "output": ["Isabel bought 4 country albums and 5 pop albums. Each album had 8 songs. That means in total 4 * 8 + 5 * 8 = 88 songs. The answer is 88."], "answer": "72"}
{"input": "Megan was selling her necklaces at a garage sale. She sold 7 bead necklaces and 3 gem stone necklaces. If each necklace cost 9 dollars, how much money did she earn?", "output": ["She sold 7 bead necklaces and 3 gem stone necklaces. This means she sold 7 * $9 = $63 in bead necklaces and 3 * $9 = $27 in gem stone necklaces. She earned $63 + $27 = $81. The answer is 81."], "answer": "90"}
{"input": "Rachel was playing a video game where she scores 9 points for each treasure she finds. If she found 5 treasures on the first level and 2 on the second, what would her score be?", "output": ["She found 5 treasures on the first level and 2 on the second. That means she found 7 treasures in total. She scores 9 points for each treasure, so in total she scores 9 * 7 = 63 points. The answer is 63."], "answer": "63"}
{"input": "April's discount flowers was having a sale where each flower was 6 dollars. If Katie bought 5 roses and 5 daisies, how much did she spend?", "output": ["Each flower was 6 dollars. So, 5 roses and 5 daisies cost 5 * 6 = 30 dollars. The answer is 30."], "answer": "60"}
{"input": "A pet store has 9 bird cages. If each cage has 2 parrots and 6 parakeets in it, how many birds does the pet store have total?", "output": ["There are 9 bird cages. Each cage has 2 parrots and 6 parakeets. That means there are 9 * 2 + 9 * 6 = 63 parrots and 9 * 2 + 9 * 6 = 54 parakeets. The answer is 63 + 54 = 117 birds."], "answer": "72"}
{"input": "Roger was putting his spare change into piles. He had 3 piles of quarters and 3 piles of dimes. If each pile had 7 coins in it, how many coins did he have total?", "output": ["He had 3 piles of quarters and 3 piles of dimes. Each pile had 7 coins in it. That means in total he had 3 * 7 = 21 quarters and 3 * 7 = 21 dimes. The answer is 42."], "answer": "42"}
{"input": "There were 2 friends playing a video game online when 2 more players joined the game. If each player had 8 lives, how many lives did they have total?", "output": ["There were 2 friends playing a video game online when 2 more players joined the game. That means there were 4 players in total. Each player had 8 lives, so in total there were 4 * 8 = 32 lives. The answer is 32."], "answer": "32"}
{"input": "A waiter had 7 tables he was waiting on, with 7 women and 2 men at each table. How many customers total did the waiter have?", "output": ["There are 7 tables with 7 women and 2 men at each table. That means there are 7 * 7 * 2 = 98 women and 2 * 7 * 2 = 28 men. The answer is 98 + 28 = 126 customers."], "answer": "63"}
{"input": "Tiffany was playing a video game where she scores 6 points for each treasure she finds. If she found 3 treasures on the first level and 5 on the second, what would her score be?", "output": ["She found 3 treasures on the first level and 5 on the second. That means she found 3 + 5 = 8 treasures. She scores 6 points for each treasure, so her score is 8 * 6 = 48. The answer is 48."], "answer": "48"}
{"input": "While shopping for music online, Zoe bought 3 country albums and 5 pop albums. Each album came with a lyric sheet and had 3 songs. How many songs did Zoe buy total?", "output": ["Zoe bought 3 country albums and 5 pop albums. Each album had 3 songs. That means in total 3 * 3 * 3 = 27 songs. The answer is 27."], "answer": "24"}
{"input": "Megan was organizing her book case making sure each of the shelves had exactly 7 books on it. If she had 8 shelves of mystery books and 2 shelves of picture books, how many books did she have total?", "output": ["She had 8 shelves of mystery books and 2 shelves of picture books. That means she had 8 * 7 = 56 mystery books and 2 * 7 = 14 picture books. In total she had 56 + 14 = 70 books. The answer is 70."], "answer": "70"}
{"input": "Isabel was selling her necklaces at a garage sale. She sold 3 bead necklaces and 3 gem stone necklaces. If each necklace cost 6 dollars, how much money did she earn?", "output": ["She sold 3 bead necklaces and 3 gem stone necklaces. This means she sold 3 * 6 = $18. She earned $18. The answer is 18."], "answer": "36"}
{"input": "Frank was collecting cans for recycling. On Saturday he filled 5 bags up and on Sunday he filled 3 more bags. If each bag had 5 cans in it, how many cans did he pick up total?", "output": ["On Saturday he filled 5 bags. Each bag had 5 cans in it, so in total he had 5 * 5 = 25 cans. On Sunday he filled 3 more bags. Each bag had 5 cans in it, so in total he had 3 * 5 = 15 cans. In total he had 25 + 15 = 40 cans. The answer is 40."], "answer": "40"}
{"input": "April's discount flowers was having a sale where each flower was 8 dollars. If Vanessa bought 3 roses and 3 daisies, how much did she spend?", "output": ["Each flower was $8. If she bought 3 roses and 3 daisies, that means she spent 3 * $8 = $24. The answer is 24."], "answer": "48"}
{"input": "Will was working as a sacker at a grocery store where he made 8 dollars an hour. On Monday he worked 8 hours and on Tuesday he worked 2 hours. How much money did Will make in those two days?", "output": ["He worked 8 hours on Monday and 2 hours on Tuesday. That means he worked 10 hours in total. He made 8 dollars an hour, so he made 8 * 10 = $80. The answer is $80."], "answer": "80"}
{"input": "Rachel bought 7 new chairs and 3 new tables for her house. If she spent 4 minutes on each piece furniture putting it together, how many minutes did it take her to finish?", "output": ["She bought 7 new chairs and 3 new tables. She spent 4 minutes on each piece of furniture. That means she spent 4 * 7 + 4 * 3 = 48 minutes putting the furniture together. The answer is 48."], "answer": "40"}
{"input": "While playing a trivia game, Adam answered 8 questions correct in the first half and 2 questions correct in the second half. If each question was worth 8 points, what was his final score?", "output": ["He answered 8 questions correct in the first half. That means he got 8 * 8 = 64 points. He answered 2 questions correct in the second half. That means he got 2 * 8 = 16 points. So his final score is 64 + 16 = 80. The answer is 80."], "answer": "80"}
{"input": "A pet store has 4 bird cages. If each cage has 8 parrots and 2 parakeets in it, how many birds does the pet store have total?", "output": ["There are 4 cages. Each cage has 8 parrots and 2 parakeets. That means in total there are 4 * 8 + 4 * 2 = 48 parrots and 4 * 8 + 4 * 2 = 32 parakeets. The answer is 80."], "answer": "40"}
{"input": "Kaleb was collecting cans for recycling. On Saturday he filled 5 bags up and on Sunday he filled 5 more bags. If each bag had 4 cans in it, how many cans did he pick up total?", "output": ["He filled 5 bags on Saturday and 5 more bags on Sunday. That means he filled 10 bags in total. Each bag had 4 cans in it, so in total he picked up 10 * 4 = 40 cans. The answer is 40."], "answer": "40"}
{"input": "Bianca was organizing her book case making sure each of the shelves had exactly 8 books on it. If she had 5 shelves of mystery books and 4 shelves of picture books, how many books did she have total?", "output": ["She had 5 shelves of mystery books and 4 shelves of picture books. That means she had 5 * 8 = 40 mystery books and 4 * 8 = 32 picture books. In total she had 40 + 32 = 72 books. The answer is 72."], "answer": "72"}
{"input": "Billy was putting his spare change into piles. He had 2 piles of quarters and 3 piles of dimes. If each pile had 4 coins in it, how many coins did he have total?", "output": ["Billy had 2 piles of quarters and 3 piles of dimes. Each pile had 4 coins in it. So in total he had 2 * 4 + 3 * 4 = 16 coins. The answer is 16."], "answer": "20"}
{"input": "Chloe was playing a video game where she scores 9 points for each treasure she finds. If she found 6 treasures on the first level and 3 on the second, what would her score be?", "output": ["She found 6 treasures on the first level and 3 on the second. That means she found 9 * 6 + 3 * 3 = 63 treasures. Her score is 63 points. The answer is 63."], "answer": "81"}
{"input": "While shopping for music online, Nancy bought 3 country albums and 5 pop albums. Each album came with a lyric sheet and had 8 songs. How many songs did Nancy buy total?", "output": ["She bought 3 country albums and 5 pop albums. Each album had 8 songs. That means in total she bought 3 * 8 + 5 * 8 = 63 songs. The answer is 63."], "answer": "64"}
{"input": "Lana was unboxing some of her old winter clothes. She found 3 boxes of clothing and inside each box there were 3 scarves and 4 mittens. How many pieces of winter clothing did Lana have total?", "output": ["3 boxes of clothing means 3 * 3 * 4 = 36 scarves and 3 * 3 * 4 = 36 mittens. The answer is 36 scarves and 36 mittens."], "answer": "21"}
{"input": "Frank and his friend were buying trick decks from the magic shop for 7 dollars each. How much did they spend if Frank bought 3 decks and his friend bought 2 decks?", "output": ["Frank bought 3 decks and his friend bought 2 decks. That means they bought 3 + 2 = 5 decks. They each cost $7, so in total they spent $7 * 5 = $35. The answer is 35."], "answer": "35"}
{"input": "A waiter had 5 tables he was waiting on, with 5 women and 3 men at each table. How many customers total did the waiter have?", "output": ["There are 5 tables with 5 women and 3 men at each table. That means there are 5 * 5 + 3 * 3 = 40 customers. The answer is 40."], "answer": "40"}
{"input": "There were 8 friends playing a video game online when 2 more players joined the game. If each player had 6 lives, how many lives did they have total?", "output": ["There were 8 players in the beginning. 2 more joined, so now there are 10 players. Each player had 6 lives, so in total there are 10 * 6 = 60 lives. The answer is 60."], "answer": "60"}
{"input": "Sam was collecting cans for recycling. On Saturday he filled 3 bags up and on Sunday he filled 4 more bags. If each bag had 9 cans in it, how many cans did he pick up total?", "output": ["On Saturday he filled 3 bags. Each bag had 9 cans in it, so in total he had 3 * 9 = 27 cans. On Sunday he filled 4 more bags. Each bag had 9 cans in it, so in total he had 4 * 9 = 36 cans. In total he had 27 + 36 = 63 cans. The answer is 63."], "answer": "63"}
{"input": "April's discount flowers was having a sale where each flower was 6 dollars. If Maria bought 7 roses and 3 daisies, how much did she spend?", "output": ["Each flower was 6 dollars. She bought 7 roses and 3 daisies. That means she spent 7 * 6 = $42 on the roses. She spent 3 * 6 = $18 on the daisies. She spent $42 + $18 = $60. The answer is 60."], "answer": "60"}
{"input": "Dave was working as a sacker at a grocery store where he made 6 dollars an hour. On Monday he worked 6 hours and on Tuesday he worked 2 hours. How much money did Dave make in those two days?", "output": ["Dave made 6 dollars an hour. He worked 6 hours on Monday and 2 hours on Tuesday. That means he made 6 * 6 = 36 dollars on Monday and 6 * 2 = 12 dollars on Tuesday. So in total he made 36 + 12 = 48 dollars. The answer is 48."], "answer": "48"}
{"input": "Nancy was organizing her book case making sure each of the shelves had exactly 6 books on it. If she had 2 shelves of mystery books and 6 shelves of picture books, how many books did she have total?", "output": ["She had 2 shelves of mystery books and 6 shelves of picture books. That means she had 2 * 6 = 12 mystery books and 6 * 6 = 36 picture books. In total she had 12 + 36 = 48 books. The answer is 48."], "answer": "48"}
{"input": "While shopping for music online, Faye bought 2 country albums and 3 pop albums. Each album came with a lyric sheet and had 6 songs. How many songs did Faye buy total?", "output": ["Faye bought 2 country albums and 3 pop albums. Each album has 6 songs. So in total she bought 2 * 6 + 3 * 6 = 30 songs. The answer is 30."], "answer": "30"}
{"input": "Tom was putting his spare change into piles. He had 2 piles of quarters and 4 piles of dimes. If each pile had 5 coins in it, how many coins did he have total?", "output": ["He had 2 piles of quarters and 4 piles of dimes. That means he had 2 * 25 = 50 quarters and 4 * 10 = 40 dimes. He had 50 + 40 = 90 coins. The answer is 90."], "answer": "30"}
{"input": "While playing a trivia game, George answered 6 questions correct in the first half and 4 questions correct in the second half. If each question was worth 3 points, what was his final score?", "output": ["George answered 6 questions correct in the first half. This means he got 6 * 3 = 18 points. He answered 4 questions correct in the second half. This means he got 4 * 3 = 12 points. So in total he got 18 + 12 = 30 points. The answer is 30."], "answer": "30"}
{"input": "Lana was unboxing some of her old winter clothes. She found 4 boxes of clothing and inside each box there were 2 scarves and 6 mittens. How many pieces of winter clothing did Lana have total?", "output": ["Lana found 4 boxes of clothing. Each box had 2 scarves and 6 mittens. That means in total there were 4 * 2 * 6 = 48 scarves and 4 * 2 * 6 = 48 mittens. The answer is 48."], "answer": "32"}
{"input": "At the town carnival Oliver rode the ferris wheel 7 times and the bumper cars 3 times. If each ride cost 3 tickets, how many tickets did he use?", "output": ["Oliver rode the ferris wheel 7 times and the bumper cars 3 times. That means he rode the ferris wheel 7 * 3 = 21 times and the bumper cars 3 * 3 = 9 times. He used 21 + 9 = 30 tickets. The answer is 30."], "answer": "30"}
{"input": "Sarah had 4 pages of math homework and 6 pages of reading homework. If each page had 4 problems on it, how many problems did she have to complete total?", "output": ["She had 4 pages of math homework and 6 pages of reading homework. That means she had 4 * 4 + 6 * 4 = 44 problems in total. The answer is 44."], "answer": "40"}
{"input": "Kaleb was collecting cans for recycling. On Saturday he filled 4 bags up and on Sunday he filled 6 more bags. If each bag had 4 cans in it, how many cans did he pick up total?", "output": ["On Saturday he filled 4 bags. Each bag had 4 cans in it, so in total he had 4 * 4 = 16 cans. On Sunday he filled 6 more bags. Each bag had 4 cans in it, so in total he had 6 * 4 = 24 cans. In total he had 16 + 24 = 40 cans. The answer is 40."], "answer": "40"}
{"input": "Edward and his friend were buying trick decks from the magic shop for 6 dollars each. How much did they spend if Edward bought 3 decks and his friend bought 6 decks?", "output": ["Edward bought 3 decks and his friend bought 6 decks. This means they spent 3 * 6 = $18. They spent $18. The answer is 18."], "answer": "54"}
{"input": "Emily bought 4 new chairs and 2 new tables for her house. If she spent 8 minutes on each piece furniture putting it together, how many minutes did it take her to finish?", "output": ["She bought 4 new chairs and 2 new tables. She spent 8 minutes on each piece of furniture. That means she spent 8 minutes on the first chair, 8 minutes on the second chair, 8 minutes on the third chair, 8 minutes on the fourth chair, 8 minutes on the first table, 8 minutes on the second table. That means she spent 8 * 4 + 8 * 2 = 48 minutes putting the furniture together. The answer is 48."], "answer": "48"}
{"input": "A waiter had 9 tables he was waiting on, with 2 women and 6 men at each table. How many customers total did the waiter have?", "output": ["There are 9 tables. Each table has 2 women and 6 men. That means there are 9 * 2 * 6 = 108 customers. The answer is 108."], "answer": "72"}
{"input": "There were 4 friends playing a video game online when 5 more players joined the game. If each player had 3 lives, how many lives did they have total?", "output": ["There were 4 friends playing a video game online when 5 more players joined the game. That means there were 4 + 5 = 9 players. Each player had 3 lives, so in total there were 9 * 3 = 27 lives. The answer is 27."], "answer": "27"}
{"input": "While shopping for music online, Janet bought 6 country albums and 2 pop albums. Each album came with a lyric sheet and had 9 songs. How many songs did Janet buy total?", "output": ["Janet bought 6 country albums and 2 pop albums. Each album had 9 songs. That means in total 6 * 9 = 54 songs. The answer is 54."], "answer": "72"}
{"input": "The schools debate team had 26 boys and 46 girls on it. If they were split into groups of 9 how many groups could they make?", "output": ["There are 26 boys and 46 girls. If they were split into groups of 9, there would be 26 / 9 = 2 groups of 9 boys and 46 / 9 = 5 groups of 9 girls. The answer is 7."], "answer": "8"}
{"input": "Robin uploaded 35 pictures from her phone and 5 from her camera to facebook. If she sorted the pics into 5 different albums with the same amount of pics in each album, how many pictures were in each of the albums?", "output": ["She uploaded 35 pictures from her phone and 5 from her camera. That means she uploaded a total of 40 pictures. She sorted the pics into 5 different albums. Each album must have the same amount of pictures. So, 40 / 5 = 8. The answer is 8."], "answer": "8"}
{"input": "Kaleb had saved up 21 dollars. If he received another 15 dollars for his allowance, how many 6 dollar toys could he buy?", "output": ["He had 21 dollars. He received 15 more dollars. That means he has 36 dollars in total. He can buy 6 * 6 = 36 toys. The answer is 36."], "answer": "6"}
{"input": "Olivia was making baggies of cookies with 9 cookies in each bag. If she had 13 chocolate chip cookies and 41 oatmeal cookies, how many baggies could she make?", "output": ["She has 13 chocolate chip cookies and 41 oatmeal cookies. She wants to make 9 cookies in each bag. That means she can make 13 / 9 = 1 and 41 / 9 = 4 baggies. The answer is 5."], "answer": "6"}
{"input": "Luke made 9 dollars mowing lawns and 18 dollars weed eating. If he only spent 3 dollar a week, how long would the money last him?", "output": ["He made 9 dollars mowing lawns and 18 dollars weed eating. He spent 3 dollars a week. That means he spent 3 * 4 = 12 dollars a month. He made 9 + 18 = 27 dollars a month. That means he can last for 27 - 12 = 15 months. The answer is 15 months."], "answer": "9"}
{"input": "There school's baseball team had 48 new players and 6 returning players. If the coach put them into groups with 6 players in each group, how many groups would there be?", "output": ["There are 48 new players and 6 returning players. If the coach puts them into groups with 6 players in each group, there will be 48 / 6 = 8 groups. The answer is 8."], "answer": "9"}
{"input": "For a birthday party Jerry bought 41 regular sodas and 22 diet sodas. If his fridge would only hold 9 on each shelf, how many shelves would he fill up?", "output": ["He bought 41 regular sodas and 22 diet sodas. That means he bought 41 + 22 = 63 sodas. He has 9 sodas on each shelf, so he needs 63 / 9 = 7 shelves. The answer is 7."], "answer": "7"}
{"input": "Paige and her friends were recycling paper for their class. For every 4 pounds they recycled they earned one point. If Paige recycled 14 pounds and her friends recycled 2 pounds, how many points did they earn?", "output": ["Paige and her friends recycled 14 pounds. For every 4 pounds they recycled they earned one point. So they earned 14 / 4 = 3 points. Paige and her friends recycled 2 pounds. So they earned 2 / 4 = 0.5 points. So in total they earned 3 + 0.5 = 3.5 points. The answer is 3.5."], "answer": "4"}
{"input": "For homework Nancy had 17 math problems and 15 spelling problems. If she can finish 8 problems in an hour how long will it take her to finish all the problems?", "output": ["She has 17 math problems and 15 spelling problems. She can finish 8 problems in an hour. So, she can finish 8/17 = 4 math problems in an hour. She can finish 15/17 = 0.8333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333"], "answer": "4"}
{"input": "Will was organizing his baseball cards in a binder with 3 on each page. If he had 8 new cards and 10 old cards to put in the binder, how many pages would he use?", "output": ["He has 8 new cards and 10 old cards. He puts 3 cards on each page. That means he needs 8 + 10 = 18 pages. The answer is 18."], "answer": "6"}
{"input": "The schools debate team had 11 boys and 45 girls on it. If they were split into groups of 7 how many groups could they make?", "output": ["There are 11 boys and 45 girls. If they are split into groups of 7, then there are 11 / 7 = 1 group of boys and 45 / 7 = 6 groups of girls. The answer is 7."], "answer": "8"}
{"input": "A group of 4 friends went into a restaurant. The chef already had 9 chicken wings cooked but cooked 7 more for the group. If they each got the same amount how many would each person get?", "output": ["The chef already had 9 chicken wings cooked. He cooked 7 more for the group. That means he cooked 16 chicken wings in total. The group is 4 people. So each person gets 16 / 4 = 4 chicken wings. The answer is 4."], "answer": "4"}
{"input": "A vase can hold 6 flowers. If you had 7 carnations and 47 roses, how many vases would you need to hold the flowers?", "output": ["The vase can hold 6 flowers. If you have 7 carnations and 47 roses, you have 7 + 47 = 54 flowers. The vase can hold 6 flowers, so you need 54 / 6 = 9 vases. The answer is 9."], "answer": "9"}
{"input": "A pet shelter had 9 puppies when another 12 were brought in. If 3 puppies a day are adopted, how long would it take for all of them to be adopted?", "output": ["There are 12 puppies. 3 puppies are adopted each day. That means in total 3 * 12 = 36 puppies are adopted. There were 9 puppies in the beginning, so now there are 9 + 36 = 45 puppies. The answer is 45."], "answer": "7"}
{"input": "Roger was helping the cafeteria workers pick up lunch trays, but he could only carry 4 trays at a time. If he had to pick up 10 trays from one table and 2 trays from another, how many trips will he make?", "output": ["He can carry 4 trays at a time. If he has to pick up 10 trays from one table, he will have to make 2 trips. If he has to pick up 2 trays from another table, he will have to make 1 trip. So in total he will have to make 3 trips. The answer is 3."], "answer": "3"}
{"input": "A toy store had 4 giant stuffed bears in stock when they got another shipment with 10 bears in it. The put the bears onto shelves with 7 on each shelf. How many shelves did they use?", "output": ["They put 7 bears on each shelf. There are 4 shelves. So in total they put 28 bears on the shelves. The answer is 28."], "answer": "2"}
{"input": "John made 6 dollars mowing lawns and 18 dollars weed eating. If he only spent 3 dollar a week, how long would the money last him?", "output": ["He made 6 dollars mowing lawns and 18 dollars weed eating. He spent 3 dollars a week. That means he spent 3 * 4 = 12 dollars a month. He made 6 + 18 = 24 dollars a month. So the money would last him 24 - 12 = 12 months. The answer is 12."], "answer": "8"}
{"input": "Wendy's old washing machine could only wash 8 pieces of clothing at a time. If she had to wash 39 shirts and 33 sweaters how many loads would she have to do?", "output": ["She has 39 shirts and 33 sweaters. She can wash 8 pieces of clothing at a time. So she has to do 39 / 8 = 4.75 loads. The answer is 4.75."], "answer": "9"}
{"input": "Debby's class is going on a field trip to the zoo. If each van can hold 4 people and there are 2 students and 6 adults going, how many vans will they need?", "output": ["Each van can hold 4 people. There are 2 students and 6 adults. That means there are 2 + 6 = 8 people. 8 people can be divided by 4, so they need 2 vans. The answer is 2."], "answer": "2"}
{"input": "Isabel uploaded 2 pictures from her phone and 4 from her camera to facebook. If she sorted the pics into 3 different albums with the same amount of pics in each album, how many pictures were in each of the albums?", "output": ["She uploaded 2 pictures from her phone and 4 from her camera to facebook. This means she uploaded 2 + 4 = 6 pictures from her phone and 4 + 4 = 8 pictures from her camera. She sorted the pics into 3 albums with the same amount of pics in each album. So the number of pictures in each album must be 6, 8 and 8. The answer is 6, 8 and 8."], "answer": "2"}
{"input": "While playing at the arcade, Frank won 33 tickets playing 'whack a mole' and 9 tickets playing 'skee ball'. If he was trying to buy candy that cost 6 tickets a piece, how many could he buy?", "output": ["Frank won 33 tickets playing 'whack a mole' and 9 tickets playing 'skee ball'. That means he has 33 + 9 = 42 tickets. He wants to buy candy that costs 6 tickets each. So he can buy 42 / 6 = 7 pieces of candy. The answer is 7."], "answer": "7"}
{"input": "Mike made 14 dollars mowing lawns and 26 dollars weed eating. If he only spent 5 dollar a week, how long would the money last him?", "output": ["He made 14 dollars mowing lawns and 26 dollars weed eating. He spent 5 dollars a week. That means he spent 5 dollars a week * 4 weeks = $20. He made 14 + 26 = 40 dollars. 40 - 20 = 20 dollars. The answer is 20."], "answer": "8"}
{"input": "Gwen and her friends were recycling paper for their class. For every 3 pounds they recycled they earned one point. If Gwen recycled 5 pounds and her friends recycled 13 pounds, how many points did they earn?", "output": ["Gwen and her friends recycled 5 + 13 = 18 pounds. For every 3 pounds they recycled they earned one point. So they earned 18 / 3 = 6 points. The answer is 6."], "answer": "6"}
{"input": "Robin uploaded 31 pictures from her phone and 5 from her camera to facebook. If she sorted the pics into 9 different albums with the same amount of pics in each album, how many pictures were in each of the albums?", "output": ["She uploaded 31 pictures from her phone and 5 from her camera. That means she uploaded 36 pictures in total. She sorted them into 9 albums with the same amount of pictures in each album. That means each album has 36 / 9 = 4 pictures. The answer is 4."], "answer": "4"}
{"input": "For Halloween Megan received 11 pieces of candy from neighbors and 5 pieces from her older sister. If she only ate 8 pieces a day, how long would the candy last her?", "output": ["She received 11 pieces from neighbors and 5 pieces from her sister. That means she initially had 16 pieces. She ate 8 pieces a day, so she would have 16 / 8 = 2 days of candy. The answer is 2."], "answer": "2"}
{"input": "Maria was making baggies of cookies with 5 cookies in each bag. If she had 33 chocolate chip cookies and 2 oatmeal cookies, how many baggies could she make?", "output": ["She had 33 chocolate chip cookies and 2 oatmeal cookies. She wants to make 5 cookies in each bag. So she can make 33 / 5 = 6 bags. The answer is 6."], "answer": "7"}
{"input": "There school's baseball team had 4 new players and 6 returning players. If the coach put them into groups with 5 players in each group, how many groups would there be?", "output": ["There are 4 new players and 6 returning players. If the coach puts them into groups with 5 players in each group, there will be 4 groups. The answer is 4."], "answer": "2"}
{"input": "A pet shelter had 5 puppies when another 35 were brought in. If 8 puppies a day are adopted, how long would it take for all of them to be adopted?", "output": ["There are 8 puppies adopted each day. So in total 8 * n days = 35 puppies adopted. There are 35 puppies brought in. So in total 35 + 8 * n days = 35 + 8n puppies adopted. Since 8n = 35, n = 5. So in total 5 * 8 = 40 puppies are adopted. The answer is 40."], "answer": "5"}
{"input": "Nancy's class is going on a field trip to the zoo. If each van can hold 5 people and there are 12 students and 3 adults going, how many vans will they need?", "output": ["Each van can hold 5 people. There are 12 students and 3 adults. That means there are 12 + 3 = 15 people. 15 people can be divided by 5, so they need 3 vans. The answer is 3."], "answer": "3"}
{"input": "Dave was helping the cafeteria workers pick up lunch trays, but he could only carry 9 trays at a time. If he had to pick up 17 trays from one table and 55 trays from another, how many trips will he make?", "output": ["He can carry 9 trays at a time. He has to pick up 17 trays from one table and 55 trays from another. That means he has to make 17 + 55 = 72 trips. The answer is 72."], "answer": "8"}
{"input": "For a birthday party George bought 10 regular sodas and 22 diet sodas. If his fridge would only hold 4 on each shelf, how many shelves would he fill up?", "output": ["He bought 10 regular sodas and 22 diet sodas. That means he bought 10 + 22 = 32 sodas. He has 4 sodas on each shelf, so he needs 32 / 4 = 8 shelves. The answer is 8."], "answer": "8"}
{"input": "The schools debate team had 28 boys and 4 girls on it. If they were split into groups of 4 how many groups could they make?", "output": ["There are 28 boys and 4 girls. If they are split into groups of 4, then there will be 28 / 4 = 7 groups. The answer is 7."], "answer": "8"}
{"input": "Maria was making baggies of cookies with 8 cookies in each bag. If she had 5 chocolate chip cookies and 19 oatmeal cookies, how many baggies could she make?", "output": ["She has 5 chocolate chip cookies and 19 oatmeal cookies. She wants to make 8 cookies in each bag. So she can make 8 * 5 + 8 * 19 = 88 baggies. The answer is 88."], "answer": "3"}
{"input": "For Halloween Sarah received 66 pieces of candy from neighbors and 15 pieces from her older sister. If she only ate 9 pieces a day, how long would the candy last her?", "output": ["She received 66 pieces of candy from neighbors and 15 pieces from her older sister. That means she initially had 66 + 15 = 81 pieces of candy. She ate 9 pieces a day, so she would have 81 / 9 = 9 days of candy. The answer is 9."], "answer": "9"}
{"input": "Henry was helping the cafeteria workers pick up lunch trays, but he could only carry 9 trays at a time. If he had to pick up 29 trays from one table and 52 trays from another, how many trips will he make?", "output": ["He can carry 9 trays at a time. He has to pick up 29 trays from one table and 52 trays from another. That means he has to make 29 + 52 = 81 trips. The answer is 81."], "answer": "9"}
{"input": "Tiffany uploaded 7 pictures from her phone and 13 from her camera to facebook. If she sorted the pics into 5 different albums with the same amount of pics in each album, how many pictures were in each of the albums?", "output": ["She uploaded 7 pictures from her phone and 13 from her camera. That means she uploaded 7 + 13 = 20 pictures. She sorted the pics into 5 different albums with the same amount of pics in each album. That means each album has 20 / 5 = 4 pictures. The answer is 4."], "answer": "4"}
{"input": "A toy store had 5 giant stuffed bears in stock when they got another shipment with 7 bears in it. The put the bears onto shelves with 6 on each shelf. How many shelves did they use?", "output": ["They put the bears onto shelves with 6 on each shelf. That means they used 6 shelves. The number of bears in the store is 5 + 7 = 12. The answer is 12."], "answer": "2"}
{"input": "Paul made 68 dollars mowing lawns and 13 dollars weed eating. If he only spent 9 dollar a week, how long would the money last him?", "output": ["He made 68 dollars mowing lawns and 13 dollars weed eating. He spent 9 dollars a week. That means he spent 9 * 4 = 36 dollars a month. He made 68 + 13 = 81 dollars. 81 - 36 = 45 dollars. The answer is 45."], "answer": "9"}
{"input": "While playing at the arcade, Edward won 3 tickets playing 'whack a mole' and 5 tickets playing 'skee ball'. If he was trying to buy candy that cost 4 tickets a piece, how many could he buy?", "output": ["Edward won 3 tickets playing 'whack a mole' and 5 tickets playing 'skee ball'. That means he has 8 tickets. He wants to buy candy that costs 4 tickets each. So he can buy 8 / 4 = 2 candy. The answer is 2."], "answer": "2"}
{"input": "Megan's class is going on a field trip to the zoo. If each van can hold 5 people and there are 25 students and 5 adults going, how many vans will they need?", "output": ["Each van can hold 5 people. There are 25 students and 5 adults. That means there are 25 + 5 = 30 people. 30 people can be divided by 5, so they need 6 vans. The answer is 6."], "answer": "6"}
{"input": "Luke was organizing his baseball cards in a binder with 3 on each page. If he had 3 new cards and 9 old cards to put in the binder, how many pages would he use?", "output": ["He has 3 new cards and 9 old cards. He puts 3 new cards on each page. That means he has 3 * 3 = 9 new cards. He puts 9 old cards on each page. That means he has 9 * 3 = 27 old cards. He has 9 new cards and 27 old cards. He puts 3 new cards on each page. That means he has 9 * 3 = 27 new cards. He puts 27 old cards on each page. That means he has 27 * 3 = 81 old cards. He has 9 new cards and 81 old cards. He puts 3 new cards on each page. That means he has 9 * 3 = 27 new cards. He puts 27 old cards on each page. That means he has 27 * 3 = 81 old cards. He has 9 new cards and 81 old cards. He puts 3 new cards on each page. That means he has 9 * 3 = 27 new cards. He puts 27 old cards on each page. That means he has 27 * 3 = 81 old cards. He has 9 new cards and 81 old cards. He puts 3 new cards on each page. That means he has 9 * 3 = 27 new cards. He puts 27 old cards on each page. That means he has 27 * 3 = 81 old cards. He has 9 new cards and 81 old cards. He puts 3 new cards on each page. That means he has 9 * 3 = 27 new cards. He puts 27 old cards on each page. That means he has 27 * 3 ="], "answer": "4"}
{"input": "A group of 3 friends went into a restaurant. The chef already had 6 chicken wings cooked but cooked 3 more for the group. If they each got the same amount how many would each person get?", "output": ["The chef already had 6 chicken wings cooked. He cooked 3 more for the group. That means in total he cooked 9 chicken wings. The group is 3 people. So each person gets 3 / 3 = 1 chicken wing. The answer is 1."], "answer": "3"}
{"input": "Olivia uploaded 5 pictures from her phone and 35 from her camera to facebook. If she sorted the pics into 8 different albums with the same amount of pics in each album, how many pictures were in each of the albums?", "output": ["She uploaded 5 pics from her phone and 35 from her camera. That means she uploaded a total of 40 pics. She sorted them into 8 albums with the same amount of pics in each album. That means each album has 5 pics. The answer is 5."], "answer": "5"}
{"input": "A toy store had 6 giant stuffed bears in stock when they got another shipment with 18 bears in it. The put the bears onto shelves with 6 on each shelf. How many shelves did they use?", "output": ["They put 6 bears on each shelf. There are 18 bears in the shipment. So they put 18 / 6 = 3 shelves. The answer is 3."], "answer": "4"}
{"input": "Jerry was helping the cafeteria workers pick up lunch trays, but he could only carry 8 trays at a time. If he had to pick up 9 trays from one table and 7 trays from another, how many trips will he make?", "output": ["He can carry 8 trays at a time. If he has to pick up 9 trays from one table and 7 trays from another, he will have to make 2 trips. The first trip will be 9 + 7 = 16 trays. The second trip will be 8 trays. The answer is 2."], "answer": "2"}
{"input": "A vase can hold 5 flowers. If you had 6 carnations and 19 roses, how many vases would you need to hold the flowers?", "output": ["The vase can hold 5 flowers. If you have 6 carnations and 19 roses, you have 6 + 19 = 25 flowers. You need 25 / 5 = 5 vases. The answer is 5."], "answer": "5"}
{"input": "Haley and her friends were recycling paper for their class. For every 3 pounds they recycled they earned one point. If Haley recycled 11 pounds and her friends recycled 16 pounds, how many points did they earn?", "output": ["Haley and her friends recycled 11 + 16 = 27 pounds. For every 3 pounds they recycled they earned one point. So they earned 27 / 3 = 9 points. The answer is 9."], "answer": "9"}
{"input": "A pet shelter had 17 puppies when another 55 were brought in. If 8 puppies a day are adopted, how long would it take for all of them to be adopted?", "output": ["There are 55 puppies. 8 puppies are adopted each day. That means 55 - 8 = 47 puppies are left. 47 puppies are left. 8 puppies are adopted each day. That means 47 - 8 = 39 puppies are left. 39 puppies are left. 8 puppies are adopted each day. That means 39 - 8 = 31 puppies are left. 31 puppies are left. 8 puppies are adopted each day. That means 31 - 8 = 23 puppies are left. 23 puppies are left. 8 puppies are adopted each day. That means 23 - 8 = 15 puppies are left. 15 puppies are left. 8 puppies are adopted each day. That means 15 - 8 = 7 puppies are left. 7 puppies are left. 8 puppies are adopted each day. That means 7 - 8 = 1 puppies are left. 1 puppies are left. 8 puppies are adopted each day. That means 1 - 8 = -7 puppies are left. -7 puppies are left. 8 puppies are adopted each day. That means -7 - 8 = -15 puppies are left. -15 puppies are left. 8 puppies are adopted each day. That means -15 - 8 = -23 puppies are left. -23 puppies are left. 8 puppies are adopted each day. That means -23 - 8 = -30 puppies are left. -30 puppies are left. 8 puppies are adopted each day. That means -30 - 8 = -38 puppies are left. -38 puppies are left. 8 puppies are adopted each day. That means -38 - 8 = -46 puppies are left. -46 puppies are left"], "answer": "9"}
{"input": "There school's baseball team had 12 new players and 44 returning players. If the coach put them into groups with 8 players in each group, how many groups would there be?", "output": ["There are 12 new players and 44 returning players. If the coach put them into groups with 8 players in each group, then there would be 12 + 44 = 56 players. 56 players divided by 8 players per group is 7 groups. The answer is 7."], "answer": "7"}
{"input": "Frank had saved up 3 dollars. If he received another 37 dollars for his allowance, how many 8 dollar toys could he buy?", "output": ["He had 3 dollars. If he received 37 dollars, he will have 37 + 3 = 40 dollars. He can buy 40 / 8 = 5 toys. The answer is 5."], "answer": "5"}
{"input": "Luke was organizing his baseball cards in a binder with 3 on each page. If he had 3 new cards and 9 old cards to put in the binder, how many pages would he use?", "output": ["He has 3 new cards and 9 old cards. He puts 3 new cards on each page. That means he has 3 * 3 = 9 new cards. He puts 9 old cards on each page. That means he has 9 * 3 = 27 old cards. He has 9 new cards and 27 old cards. He puts 3 new cards on each page. That means he has 9 * 3 = 27 new cards. He puts 27 old cards on each page. That means he has 27 * 3 = 81 old cards. He has 9 new cards and 81 old cards. He puts 3 new cards on each page. That means he has 9 * 3 = 27 new cards. He puts 27 old cards on each page. That means he has 27 * 3 = 81 old cards. He has 9 new cards and 81 old cards. He puts 3 new cards on each page. That means he has 9 * 3 = 27 new cards. He puts 27 old cards on each page. That means he has 27 * 3 = 81 old cards. He has 9 new cards and 81 old cards. He puts 3 new cards on each page. That means he has 9 * 3 = 27 new cards. He puts 27 old cards on each page. That means he has 27 * 3 = 81 old cards. He has 9 new cards and 81 old cards. He puts 3 new cards on each page. That means he has 9 * 3 = 27 new cards. He puts 27 old cards on each page. That means he has 27 * 3 ="], "answer": "4"}
{"input": "A group of 3 friends went into a restaurant. The chef already had 6 chicken wings cooked but cooked 3 more for the group. If they each got the same amount how many would each person get?", "output": ["The chef already had 6 chicken wings cooked. He cooked 3 more for the group. That means in total he cooked 9 chicken wings. The group is 3 people. So each person gets 3 / 3 = 1 chicken wing. The answer is 1."], "answer": "3"}
{"input": "Olivia uploaded 5 pictures from her phone and 35 from her camera to facebook. If she sorted the pics into 8 different albums with the same amount of pics in each album, how many pictures were in each of the albums?", "output": ["She uploaded 5 pics from her phone and 35 from her camera. That means she uploaded a total of 40 pics. She sorted them into 8 albums with the same amount of pics in each album. That means each album has 5 pics. The answer is 5."], "answer": "5"}
{"input": "A toy store had 6 giant stuffed bears in stock when they got another shipment with 18 bears in it. The put the bears onto shelves with 6 on each shelf. How many shelves did they use?", "output": ["They put 6 bears on each shelf. There are 18 bears in the shipment. So they put 18 / 6 = 3 shelves. The answer is 3."], "answer": "4"}
{"input": "Jerry was helping the cafeteria workers pick up lunch trays, but he could only carry 8 trays at a time. If he had to pick up 9 trays from one table and 7 trays from another, how many trips will he make?", "output": ["He can carry 8 trays at a time. If he has to pick up 9 trays from one table and 7 trays from another, he will have to make 2 trips. The first trip will be 9 + 7 = 16 trays. The second trip will be 8 trays. The answer is 2."], "answer": "2"}
{"input": "A vase can hold 5 flowers. If you had 6 carnations and 19 roses, how many vases would you need to hold the flowers?", "output": ["The vase can hold 5 flowers. If you have 6 carnations and 19 roses, you have 6 + 19 = 25 flowers. You need 25 / 5 = 5 vases. The answer is 5."], "answer": "5"}
{"input": "Haley and her friends were recycling paper for their class. For every 3 pounds they recycled they earned one point. If Haley recycled 11 pounds and her friends recycled 16 pounds, how many points did they earn?", "output": ["They recycled 11 + 16 = 27 pounds. For every 3 pounds they recycled they earned one point. So they earned 27 / 3 = 9 points. The answer is 9."], "answer": "9"}
{"input": "A pet shelter had 17 puppies when another 55 were brought in. If 8 puppies a day are adopted, how long would it take for all of them to be adopted?", "output": ["There are 55 puppies. 8 puppies are adopted each day. That means 55 - 8 = 47 puppies are left. 47 puppies are left. 8 puppies are adopted each day. That means 47 - 8 = 39 puppies are left. 39 puppies are left. 8 puppies are adopted each day. That means 39 - 8 = 31 puppies are left. 31 puppies are left. 8 puppies are adopted each day. That means 31 - 8 = 23 puppies are left. 23 puppies are left. 8 puppies are adopted each day. That means 23 - 8 = 15 puppies are left. 15 puppies are left. 8 puppies are adopted each day. That means 15 - 8 = 7 puppies are left. 7 puppies are left. 8 puppies are adopted each day. That means 7 - 8 = 1 puppies are left. 1 puppies are left. 8 puppies are adopted each day. That means 1 - 8 = -7 puppies are left. -7 puppies are left. 8 puppies are adopted each day. That means -7 - 8 = -15 puppies are left. -15 puppies are left. 8 puppies are adopted each day. That means -15 - 8 = -23 puppies are left. -23 puppies are left. 8 puppies are adopted each day. That means -23 - 8 = -30 puppies are left. -30 puppies are left. 8 puppies are adopted each day. That means -30 - 8 = -38 puppies are left. -38 puppies are left. 8 puppies are adopted each day. That means -38 - 8 = -46 puppies are left. -46 puppies are left"], "answer": "9"}
{"input": "There school's baseball team had 12 new players and 44 returning players. If the coach put them into groups with 8 players in each group, how many groups would there be?", "output": ["There are 12 new players and 44 returning players. If the coach put them into groups with 8 players in each group, then there would be 12 + 44 = 56 players. 56 players divided by 8 players per group is 7 groups. The answer is 7."], "answer": "7"}
{"input": "Frank had saved up 3 dollars. If he received another 37 dollars for his allowance, how many 8 dollar toys could he buy?", "output": ["He had 3 dollars. If he received 37 dollars, he will have 37 + 3 = 40 dollars. He can buy 40 / 8 = 5 toys. The answer is 5."], "answer": "5"}
{"input": "A pet shelter had 8 puppies when another 19 were brought in. If 3 puppies a day are adopted, how long would it take for all of them to be adopted?", "output": ["There are 8 puppies in the beginning. 19 more are brought in. That means there are now 27 puppies. 3 puppies are adopted each day. That means in total 27 - 3 = 24 puppies are adopted. The answer is 24."], "answer": "9"}
{"input": "For homework Faye had 13 math problems and 2 spelling problems. If she can finish 3 problems in an hour how long will it take her to finish all the problems?", "output": ["She has 13 math problems and 2 spelling problems. She can finish 3 problems in an hour. So she can finish 3 * 13 = 39 math problems in an hour. She can finish 2 * 2 = 4 spelling problems in an hour. So she can finish 4 * 2 = 8 spelling problems in an hour. So she can finish 39 + 8 = 47 problems in an hour. The answer is 47."], "answer": "5"}
{"input": "Sam had saved up 8 dollars. If he received another 7 dollars for his allowance, how many 3 dollar toys could he buy?", "output": ["Sam had 8 dollars. He received 7 more dollars. That means he has 15 dollars now. He can buy 3 toys for 3 dollars each. So he can buy 3 * 3 = 9 toys. The answer is 9."], "answer": "5"}
{"input": "Bianca and her friends were recycling paper for their class. For every 3 pounds they recycled they earned one point. If Bianca recycled 24 pounds and her friends recycled 3 pounds, how many points did they earn?", "output": ["Bianca recycled 24 pounds. For every 3 pounds they recycled they earned one point. So, 24 / 3 = 8 points. Her friends recycled 3 pounds. For every 3 pounds they recycled they earned one point. So, 3 / 3 = 1 point. In total they earned 8 + 1 = 9 points. The answer is 9."], "answer": "9"}
{"input": "There school's baseball team had 31 new players and 4 returning players. If the coach put them into groups with 7 players in each group, how many groups would there be?", "output": ["There are 31 new players and 4 returning players. If the coach puts them into groups with 7 players in each group, there will be 31 + 4 = 35 groups. The answer is 35."], "answer": "5"}
{"input": "Oliver was organizing his baseball cards in a binder with 3 on each page. If he had 2 new cards and 10 old cards to put in the binder, how many pages would he use?", "output": ["He has 3 cards on each page. He has 2 new cards and 10 old cards. He can put the 2 new cards on the first page, and the 10 old cards on the second page. Then he has 1 page left. The answer is 1."], "answer": "4"}
{"input": "Paul made 3 dollars mowing lawns and 3 dollars weed eating. If he only spent 3 dollar a week, how long would the money last him?", "output": ["He made 3 dollars mowing lawns and 3 dollars weed eating. He spent 3 dollars a week. That means he spent 3 dollars a week * 4 weeks = 12 dollars. He made 3 + 3 = 6 dollars. So he has 6 - 12 = -6 dollars. The answer is -6."], "answer": "2"}
{"input": "Robin was making baggies of cookies with 6 cookies in each bag. If she had 23 chocolate chip cookies and 25 oatmeal cookies, how many baggies could she make?", "output": ["She has 23 chocolate chip cookies and 25 oatmeal cookies. She wants to make 6 cookies in each bag. That means she can make 23 + 25 = 48 cookies. She can make 48 / 6 = 8 bags. The answer is 8."], "answer": "8"}
{"input": "The schools debate team had 5 boys and 40 girls on it. If they were split into groups of 9 how many groups could they make?", "output": ["There are 5 boys and 40 girls. If they are split into groups of 9, then there are 5 boys in each group and 40 girls in each group. There are 5 groups. The answer is 5."], "answer": "5"}
{"input": "At a company picnic 23 managers and 7 employees decided to start a game of volleyball. If they split into 6 teams how many people would be on each team?", "output": ["There are 23 managers and 7 employees. If they split into 6 teams, that means there will be 6 teams with the same number of people. So, the number of people in each team must be the same. 23 + 7 = 30. So, each team will have 30 people. The answer is 30."], "answer": "5"}
{"input": "For a birthday party Cody bought 4 regular sodas and 44 diet sodas. If his fridge would only hold 6 on each shelf, how many shelves would he fill up?", "output": ["Cody bought 4 regular sodas and 44 diet sodas. That means he bought 4 + 44 = 48 sodas. He has 6 sodas on each shelf, so he has 48 / 6 = 8 shelves. The answer is 8."], "answer": "8"}
{"input": "Robin's class is going on a field trip to the zoo. If each van can hold 8 people and there are 22 students and 2 adults going, how many vans will they need?", "output": ["Each van can hold 8 people. There are 22 students and 2 adults. That means there are 22 + 2 = 24 people. 24 people can be divided by 8 people per van. So they will need 3 vans. The answer is 3."], "answer": "3"}
{"input": "Ned was helping the cafeteria workers pick up lunch trays, but he could only carry 5 trays at a time. If he had to pick up 5 trays from one table and 5 trays from another, how many trips will he make?", "output": ["He can carry 5 trays at a time. If he has to pick up 5 trays from one table and 5 trays from another, he will have to make 2 trips. The answer is 2."], "answer": "2"}
{"input": "There school's baseball team had 2 new players and 6 returning players. If the coach put them into groups with 4 players in each group, how many groups would there be?", "output": ["There are 2 new players and 6 returning players. If the coach puts them into groups with 4 players in each group, there will be 2 + 6 = 8 groups. The answer is 8."], "answer": "2"}
{"input": "For homework Amy had 18 math problems and 6 spelling problems. If she can finish 4 problems in an hour how long will it take her to finish all the problems?", "output": ["She has 18 math problems and 6 spelling problems. She can finish 4 problems in an hour. So, she can finish 4 * 18 = 72 problems in an hour. She can finish 72 problems in an hour. She has 18 + 6 = 24 problems left. So, it will take her 24 / 72 = 1/3 hours to finish all the problems. The answer is 1/3 hours."], "answer": "6"}
{"input": "Maria was making baggies of cookies with 3 cookies in each bag. If she had 2 chocolate chip cookies and 16 oatmeal cookies, how many baggies could she make?", "output": ["She has 2 chocolate chip cookies and 16 oatmeal cookies. She wants to make 3 cookies in each bag. That means she can make 2 * 3 + 16 = 18 baggies. The answer is 18."], "answer": "6"}
{"input": "Sarah's old washing machine could only wash 5 pieces of clothing at a time. If she had to wash 43 shirts and 2 sweaters how many loads would she have to do?", "output": ["She has to wash 43 shirts and 2 sweaters. That means she has to wash 43 + 2 = 45 pieces of clothing. She can only wash 5 pieces of clothing at a time. So she has to do 45 / 5 = 9 loads. The answer is 9."], "answer": "9"}
{"input": "A pet shelter had 3 puppies when another 3 were brought in. If 3 puppies a day are adopted, how long would it take for all of them to be adopted?", "output": ["There are 3 puppies a day adopted. So in total 3 * 3 = 9 puppies are adopted. There were 3 + 3 = 6 puppies in the beginning. So in total 6 + 9 = 15 puppies are adopted. The answer is 15."], "answer": "2"}
{"input": "While playing at the arcade, Luke won 2 tickets playing 'whack a mole' and 13 tickets playing 'skee ball'. If he was trying to buy candy that cost 3 tickets a piece, how many could he buy?", "output": ["He won 2 tickets playing 'whack a mole' and 13 tickets playing 'skee ball'. That means he has 15 tickets. He wants to buy candy that costs 3 tickets each. So he can buy 15 / 3 = 5 candy. The answer is 5."], "answer": "5"}
{"input": "A group of 3 friends went into a restaurant. The chef already had 8 chicken wings cooked but cooked 10 more for the group. If they each got the same amount how many would each person get?", "output": ["The chef cooked 10 more for the group. That means there were 10 wings in total. The group was 3 people. So each person got 3 / 3 = 1 wing. The answer is 1."], "answer": "6"}
{"input": "Nancy's old washing machine could only wash 9 pieces of clothing at a time. If she had to wash 19 shirts and 8 sweaters how many loads would she have to do?", "output": ["She has 19 shirts and 8 sweaters. She can wash 9 pieces of clothing at a time. So she has to do 19 / 9 = 2 loads. The answer is 2."], "answer": "3"}
{"input": "Paul had saved up 3 dollars. If he received another 7 dollars for his allowance, how many 5 dollar toys could he buy?", "output": ["He had 3 dollars. If he received 7 dollars, he will have 10 dollars. He can buy 10 / 5 = 2 toys. The answer is 2."], "answer": "2"}
{"input": "Jerry made 14 dollars mowing lawns and 31 dollars weed eating. If he only spent 5 dollar a week, how long would the money last him?", "output": ["He made 14 dollars mowing lawns and 31 dollars weed eating. He spent 5 dollars a week. That means he spent 5 dollars a week for 14 weeks. He made 14 + 31 = 45 dollars. He spent 5 * 14 = 70 dollars. So he has 45 - 70 = -25 dollars. The answer is -25."], "answer": "9"}
{"input": "While playing at the arcade, Ned won 26 tickets playing 'whack a mole' and 19 tickets playing 'skee ball'. If he was trying to buy candy that cost 9 tickets a piece, how many could he buy?", "output": ["He won 26 + 19 = 45 tickets playing 'whack a mole' and 19 + 9 = 28 tickets playing 'skee ball'. He won 45 + 28 = 73 tickets. He can buy 73 / 9 = 8 pieces of candy. The answer is 8."], "answer": "5"}
{"input": "Luke was helping the cafeteria workers pick up lunch trays, but he could only carry 4 trays at a time. If he had to pick up 20 trays from one table and 16 trays from another, how many trips will he make?", "output": ["He can carry 4 trays at a time. He has to pick up 20 trays from one table and 16 trays from another. That means he has to make 20 + 16 = 36 trips. The answer is 36."], "answer": "9"}
{"input": "Vanessa and her friends were recycling paper for their class. For every 9 pounds they recycled they earned one point. If Vanessa recycled 20 pounds and her friends recycled 16 pounds, how many points did they earn?", "output": ["Vanessa and her friends recycled 20 pounds and 16 pounds. That means they recycled a total of 36 pounds. For every 9 pounds they recycled they earned one point. So they earned 36 / 9 = 4 points. The answer is 4."], "answer": "4"}
{"input": "A pet shelter had 2 puppies when another 34 were brought in. If 4 puppies a day are adopted, how long would it take for all of them to be adopted?", "output": ["There are 34 puppies. 4 puppies are adopted each day. That means 34 - 4 = 30 puppies are left. 30 puppies are left. 30 puppies are left. 30 puppies are left. 30 puppies are left. 30 puppies are left. 30 puppies are left. 30 puppies are left. 30 puppies are left. 30 puppies are left. 30 puppies are left. 30 puppies are left. 30 puppies are left. 30 puppies are left. 30 puppies are left. 30 puppies are left. 30 puppies are left. 30 puppies are left. 30 puppies are left. 30 puppies are left. 30 puppies are left. 30 puppies are left. 30 puppies are left. 30 puppies are left. 30 puppies are left. 30 puppies are left. 30 puppies are left. 30 puppies are left. 30 puppies are left. 30 puppies are left. 30 puppies are left. 30 puppies are left. 30 puppies are left. 30 puppies are left. 30 puppies are left. 30 puppies are left. 30 puppies are left. 30 puppies are left. 30 puppies are left. 30 puppies are left. 30 puppies are left. 30 puppies are left. 30 puppies are left. 30 puppies are left. 30 puppies are left. 30 puppies are left. 30 puppies are left. 30 puppies are left. 30 puppies are left. 30 puppies are left. 30 puppies are left. 30 puppies are left. 30 puppies are left. 30 puppies are left. 30 puppies are left. 30 puppies are left. 30 puppies are left. 30 puppies are left. 30 puppies are left. 30 puppies are left. 30 puppies"], "answer": "9"}
{"input": "At a company picnic 9 managers and 15 employees decided to start a game of volleyball. If they split into 8 teams how many people would be on each team?", "output": ["There are 9 managers and 15 employees. If they split into 8 teams, that means each team has 9 + 15 = 24 people. The answer is 24."], "answer": "3"}
{"input": "John was organizing his baseball cards in a binder with 3 on each page. If he had 8 new cards and 16 old cards to put in the binder, how many pages would he use?", "output": ["He has 8 new cards and 16 old cards. He puts 3 cards on each page. That means he needs 8 + 16 = 24 pages. The answer is 24."], "answer": "8"}
{"input": "Wendy uploaded 22 pictures from her phone and 2 from her camera to facebook. If she sorted the pics into 4 different albums with the same amount of pics in each album, how many pictures were in each of the albums?", "output": ["She uploaded 22 pictures from her phone and 2 from her camera. That means she uploaded 24 pictures in total. She sorted them into 4 albums with the same amount of pictures in each album. That means each album has 24 / 4 = 6 pictures. The answer is 6."], "answer": "6"}
{"input": "A toy store had 17 giant stuffed bears in stock when they got another shipment with 10 bears in it. The put the bears onto shelves with 9 on each shelf. How many shelves did they use?", "output": ["They put 9 bears on each shelf. There are 17 + 10 = 27 bears in total. They put 9 bears on each shelf, so they must have used 27 / 9 = 3 shelves. The answer is 3."], "answer": "3"}
{"input": "Zoe and her friends were recycling paper for their class. For every 8 pounds they recycled they earned one point. If Zoe recycled 25 pounds and her friends recycled 23 pounds, how many points did they earn?", "output": ["They recycled 25 pounds. For every 8 pounds they recycled they earned one point. So they earned 25 / 8 = 3 points. They recycled 23 pounds. For every 8 pounds they recycled they earned one point. So they earned 23 / 8 = 2 points. The answer is 3 + 2 = 5 points."], "answer": "6"}
{"input": "Billy was organizing his baseball cards in a binder with 5 on each page. If he had 3 new cards and 42 old cards to put in the binder, how many pages would he use?", "output": ["Billy has 3 new cards and 42 old cards. He wants to put 5 cards on each page. That means he needs 5 * 3 + 42 = 63 pages. The answer is 63."], "answer": "9"}
{"input": "For a birthday party Tom bought 4 regular sodas and 52 diet sodas. If his fridge would only hold 7 on each shelf, how many shelves would he fill up?", "output": ["He bought 4 regular sodas and 52 diet sodas. That means he bought 4 + 52 = 56 sodas. He has 7 sodas on each shelf, so he has 56 / 7 = 8 shelves. The answer is 8."], "answer": "8"}
{"input": "Victor was helping the cafeteria workers pick up lunch trays, but he could only carry 7 trays at a time. If he had to pick up 23 trays from one table and 5 trays from another, how many trips will he make?", "output": ["He can carry 7 trays at a time. He has to pick up 23 trays from one table and 5 trays from another. That means he has to make 23 + 5 = 28 trips. The answer is 28."], "answer": "4"}
{"input": "Paul had saved up 4 dollars. If he received another 11 dollars for his allowance, how many 5 dollar toys could he buy?", "output": ["He had 4 dollars. If he received another 11 dollars, he will have 15 dollars. He can buy 15 / 5 = 3 toys. The answer is 3."], "answer": "3"}
{"input": "Katie uploaded 30 pictures from her phone and 51 from her camera to facebook. If she sorted the pics into 9 different albums with the same amount of pics in each album, how many pictures were in each of the albums?", "output": ["She uploaded 30 pictures from her phone and 51 from her camera. That means she uploaded a total of 81 pictures. She sorted the pics into 9 different albums with the same amount of pics in each album. That means each album has 81 / 9 = 9 pictures. The answer is 9."], "answer": "9"}
{"input": "Debby's class is going on a field trip to the zoo. If each van can hold 9 people and there are 40 students and 14 adults going, how many vans will they need?", "output": ["Each van can hold 9 people. There are 40 students and 14 adults. That means there are 40 + 14 = 54 people. Each van can hold 9 people, so they need 54 / 9 = 6 vans. The answer is 6."], "answer": "6"}
{"input": "For Halloween Emily received 5 pieces of candy from neighbors and 13 pieces from her older sister. If she only ate 9 pieces a day, how long would the candy last her?", "output": ["She received 5 pieces from neighbors and 13 pieces from her sister. That means she initially had 18 pieces. She ate 9 pieces a day, so she would have 18 / 9 = 2 days of candy. The answer is 2."], "answer": "2"}
{"input": "Frank made 5 dollars mowing lawns and 58 dollars weed eating. If he only spent 7 dollar a week, how long would the money last him?", "output": ["He made 5 dollars mowing lawns and 58 dollars weed eating. He spent 7 dollars a week. That means he spent 7 * 4 = 28 dollars a month. He made 5 + 58 = 63 dollars. 63 - 28 = 35 dollars. The answer is 35."], "answer": "9"}
{"input": "A new building needed 14 windows. The builder had already installed 5 of them. If it takes 4 hours to install each window, how long will it take him to install the rest?", "output": ["The builder has already installed 5 windows. He needs 14 windows. So he needs to install 9 more windows. He can install 4 windows in 1 hour. So he needs to install 9 windows in 4 hours. The answer is 4 hours."], "answer": "36"}
{"input": "A chef needs to cook 16 potatoes. He has already cooked 7. If each potato takes 5 minutes to cook, how long will it take him to cook the rest?", "output": ["He has already cooked 7 potatoes. He needs to cook 16 - 7 = 9 more. Each potato takes 5 minutes to cook. So in total he needs to cook 9 * 5 = 45 minutes. The answer is 45 minutes."], "answer": "45"}
{"input": "Ned bought 14 boxes of chocolate candy and gave 7 to his little brother. If each box has 6 pieces inside it, how many pieces did Ned still have?", "output": ["Ned bought 14 boxes of chocolate candy. Each box has 6 pieces inside it. So in total he has 14 * 6 = 84 pieces. He gave 7 to his little brother, so now he has 84 - 7 = 77 pieces. The answer is 77."], "answer": "42"}
{"input": "There were 11 friends playing a video game online when 5 players quit. If each player left had 5 lives, how many lives did they have total?", "output": ["There were 11 players. 5 players quit. That means there are now 6 players left. Each player had 5 lives, so in total there are 6 * 5 = 30 lives. The answer is 30."], "answer": "30"}
{"input": "Henry earned 5 dollars for each lawn he mowed. If he had 12 lawns to mow, but forgot to mow 7 of them, how much money did he actually earn?", "output": ["He earned 5 dollars for each lawn he mowed. He had 12 lawns to mow, but forgot to mow 7 of them. So he only mowed 5 lawns. That means he earned 5 * 5 = $25. The answer is 25."], "answer": "25"}
{"input": "A trivia team had 5 members total, but during a game 2 members didn't show up. If each member that did show up scored 6 points, how many points were scored total?", "output": ["There were 5 members total. 2 members didn't show up. So there were 3 members that did show up. Each member that did show up scored 6 points. So in total 3 * 6 = 18 points were scored. The answer is 18."], "answer": "18"}
{"input": "A painter needed to paint 10 rooms in a building. Each room takes 8 hours to paint. If he already painted 8 rooms, how much longer will he take to paint the rest?", "output": ["He has already painted 8 rooms. Each room takes 8 hours to paint. So in total he has spent 8 * 8 = 64 hours painting. He still has 10 rooms to paint. So in total he will spend 10 * 8 = 80 hours painting. The answer is 80."], "answer": "16"}
{"input": "In a video game, each enemy defeated gives you 3 points. If a level has 6 enemies total and you destroy all but 2 of them, how many points would you earn?", "output": ["You have 6 enemies. Each enemy gives you 3 points. If you destroy all but 2 of them, you have 2 enemies left. So you have 2 * 3 = 6 points. The answer is 6."], "answer": "12"}
{"input": "Wendy earned 5 points for each bag of cans she recycled. If she had 11 bags, but didn't recycle 2 of them, how many points would she have earned?", "output": ["She earned 5 points for each bag of cans she recycled. She had 11 bags, but didn't recycle 2 of them. So she recycled 9 bags. That means she earned 5 * 9 = 45 points. The answer is 45."], "answer": "45"}
{"input": "Each chocolate bar in a box cost $3. If a box had 7 bars total and Olivia sold all but 4 bars, how much money would she have made?", "output": ["Each chocolate bar in a box cost $3. If a box had 7 bars total, then the total cost of the box is 7 * $3 = $21, since each bar costs $3. Olivia sold all but 4 bars. So she sold 7 - 4 = 3 bars. The total money she made is 3 * $3 = $9. The answer is 9."], "answer": "9"}
{"input": "Kaleb bought 14 boxes of chocolate candy and gave 5 to his little brother. If each box has 6 pieces inside it, how many pieces did Kaleb still have?", "output": ["Kaleb bought 14 boxes of chocolate candy. Each box has 6 pieces inside it. So in total he has 14 * 6 = 84 pieces. He gave 5 to his little brother, so now he has 84 - 5 = 79 pieces. The answer is 79."], "answer": "54"}
{"input": "At a restaurant each adult meal costs $3 and kids eat free. If a group of 12 people came in and 7 were kids, how much would it cost for the group to eat?", "output": ["Each adult meal costs $3. Each kid eats free. So the total cost for the group is $3 * 7 + 0 * 12 = $37. The answer is 37."], "answer": "15"}
{"input": "Jerry had 7 action figures, but needed 16 total for a complete collection. If each one costs $8, how much money would he need to finish his collection?", "output": ["He has 7 action figures. He needs 16 more. That means he needs 16 - 7 = 9 more. Each one costs $8, so he needs 9 * $8 = $72. The answer is 72."], "answer": "72"}
{"input": "In a video game, each enemy defeated gives you 9 points. If a level has 11 enemies total and you destroy all but 3 of them, how many points would you earn?", "output": ["You have 11 enemies. Each enemy gives you 9 points. If you destroy all but 3 of them, you have destroyed 9 enemies. 9 * 9 = 81 points. The answer is 81."], "answer": "72"}
{"input": "There were 16 friends playing a video game online when 7 players quit. If each player left had 8 lives, how many lives did they have total?", "output": ["There were 16 friends playing a video game online. 7 players quit. That means there are 9 players left. Each player left had 8 lives. So in total there are 9 * 8 = 72 lives. The answer is 72."], "answer": "72"}
{"input": "A new building needed 10 windows. The builder had already installed 6 of them. If it takes 5 hours to install each window, how long will it take him to install the rest?", "output": ["The builder has already installed 6 windows. He needs to install 4 more. He can install 1 window in 5 hours. So, he needs 5 hours to install the 4 windows. The answer is 5 hours."], "answer": "20"}
{"input": "Adam earned 9 dollars for each lawn he mowed. If he had 12 lawns to mow, but forgot to mow 8 of them, how much money did he actually earn?", "output": ["He earned 9 dollars for each lawn he mowed. He had 12 lawns to mow, but forgot to mow 8 of them. So he only mowed 4 lawns. That means he earned 9 * 4 = $36. The answer is 36."], "answer": "36"}
{"input": "A trivia team had 12 members total, but during a game 4 members didn't show up. If each member that did show up scored 8 points, how many points were scored total?", "output": ["There were 12 members in total. 4 members didn't show up. So there were 8 members that did show up. Each member scored 8 points. So in total 8 * 8 = 64 points were scored. The answer is 64."], "answer": "64"}
{"input": "Mike had 16 video games but 8 of them weren't working. If he wanted to sell the working games for $7 each, how much money could he earn?", "output": ["He had 16 video games. 8 of them weren't working. That means he had 8 working video games. He wanted to sell the working video games for $7 each. So he could sell 8 * $7 = $56. The answer is 56."], "answer": "56"}
{"input": "A painter needed to paint 12 rooms in a building. Each room takes 7 hours to paint. If he already painted 5 rooms, how much longer will he take to paint the rest?", "output": ["He has already painted 5 rooms. Each room takes 7 hours to paint. So in total he has spent 7 * 5 = 35 hours painting. He still has 7 rooms to paint. Each room takes 7 hours to paint. So in total he will spend 7 * 7 = 49 hours painting. He has spent 35 hours painting so far. So he will spend 49 - 35 = 14 hours more painting. The answer is 14."], "answer": "49"}
{"input": "There were 8 friends playing a video game online when 5 players quit. If each player left had 5 lives, how many lives did they have total?", "output": ["There were 8 friends playing a video game online. 5 players quit. That means there are now 3 players left. Each player left had 5 lives. So in total there are 3 * 5 = 15 lives. The answer is 15."], "answer": "15"}
{"input": "A trivia team had 15 members total, but during a game 6 members didn't show up. If each member that did show up scored 3 points, how many points were scored total?", "output": ["The team had 15 members total. 6 members didn't show up. That means there were 9 members that did show up. Each member that did show up scored 3 points. So in total 9 * 3 = 27 points were scored. The answer is 27."], "answer": "27"}
{"input": "Ned had 15 video games but 6 of them weren't working. If he wanted to sell the working games for $7 each, how much money could he earn?", "output": ["He had 15 video games. 6 of them weren't working. That means he had 9 working games. He wanted to sell the working games for $7 each. That means he would earn $7 * 9 = $63. The answer is 63."], "answer": "63"}
{"input": "Each chocolate bar in a box cost $6. If a box had 13 bars total and Zoe sold all but 6 bars, how much money would she have made?", "output": ["Each chocolate bar in a box cost $6. If a box had 13 bars total, then the total cost of the box is $6 * 13 = $78. Zoe sold all but 6 bars, so she sold $78 - 6 = $72 worth of chocolate bars. The answer is 72."], "answer": "42"}
{"input": "Will bought 7 boxes of chocolate candy and gave 3 to his little brother. If each box has 4 pieces inside it, how many pieces did Will still have?", "output": ["Will bought 7 boxes of chocolate candy. Each box has 4 pieces inside it. So in total he has 7 * 4 = 28 pieces. He gave 3 to his little brother, so now he has 28 - 3 = 25 pieces. The answer is 25."], "answer": "16"}
{"input": "Mike invited 13 friends to a birthday party, but 7 couldn't come. If he wanted to buy enough cupcakes so each person could have exactly 4, how many should he buy?", "output": ["He invited 13 friends. 7 couldn't come. That means there are 6 friends who can come. He wants to buy enough cupcakes so each person can have exactly 4. That means he needs to buy 6 * 4 = 24 cupcakes. The answer is 24."], "answer": "24"}
{"input": "In a video game, each enemy defeated gives you 5 points. If a level has 8 enemies total and you destroy all but 6 of them, how many points would you earn?", "output": ["You have 8 enemies. Each enemy gives you 5 points. If you destroy all but 6 of them, that means you have 6 enemies left. So you have 6 * 5 = 30 points. The answer is 30."], "answer": "10"}
{"input": "Roger earned 9 dollars for each lawn he mowed. If he had 14 lawns to mow, but forgot to mow 8 of them, how much money did he actually earn?", "output": ["He earned 9 dollars for each lawn he mowed. He had 14 lawns to mow, but forgot to mow 8 of them. So he only mowed 6 lawns. That means he earned 9 * 6 = $54. The answer is 54."], "answer": "54"}
{"input": "A magician was selling magic card decks for 2 dollars each. If he started with 5 decks and by the end of the day he had 3 left, how much money did he earn?", "output": ["He started with 5 decks. He sold 3 decks, so now he has 2 decks left. He sold 3 decks for $2 each, so in total he earned 3 * $2 = $6. The answer is 6."], "answer": "4"}
{"input": "A chef needs to cook 12 potatoes. He has already cooked 6. If each potato takes 6 minutes to cook, how long will it take him to cook the rest?", "output": ["He has already cooked 6 potatoes. He needs to cook 12. That means he needs to cook 6 more. Each potato takes 6 minutes to cook. So in total he needs to cook 6 * 6 = 36 minutes. The answer is 36."], "answer": "36"}
{"input": "A new building needed 9 windows. The builder had already installed 6 of them. If it takes 6 hours to install each window, how long will it take him to install the rest?", "output": ["The builder has already installed 6 windows. He needs 9 windows. That means he needs 3 more windows. He needs 3 more windows in total. He needs 3 more windows in total. He needs 3 more windows in total. He needs 3 more windows in total. He needs 3 more windows in total. He needs 3 more windows in total. He needs 3 more windows in total. He needs 3 more windows in total. He needs 3 more windows in total. He needs 3 more windows in total. He needs 3 more windows in total. He needs 3 more windows in total. He needs 3 more windows in total. He needs 3 more windows in total. He needs 3 more windows in total. He needs 3 more windows in total. He needs 3 more windows in total. He needs 3 more windows in total. He needs 3 more windows in total. He needs 3 more windows in total. He needs 3 more windows in total. He needs 3 more windows in total. He needs 3 more windows in total. He needs 3 more windows in total. He needs 3 more windows in total. He needs 3 more windows in total. He needs 3 more windows in total. He needs 3 more windows in total. He needs 3 more windows in total. He needs 3 more windows in total. He needs 3 more windows in total. He needs 3 more windows in total. He needs 3 more windows in total. He needs 3 more windows in total. He needs 3 more windows in total. He needs 3 more windows in total. He needs 3 more windows in total."], "answer": "18"}
{"input": "At the fair Adam bought 13 tickets. After riding the ferris wheel he had 4 tickets left. If each ticket cost 9 dollars, how much money did Adam spend riding the ferris wheel?", "output": ["He bought 13 tickets. After riding the ferris wheel he had 4 tickets left. This means he spent 13 - 4 = 9 tickets. Each ticket costs 9 dollars, so he spent 9 * 9 = $81. The answer is 81."], "answer": "81"}
{"input": "Dave bought 12 boxes of chocolate candy and gave 5 to his little brother. If each box has 3 pieces inside it, how many pieces did Dave still have?", "output": ["Dave bought 12 boxes of chocolate candy. Each box has 3 pieces inside it. So in total he has 12 * 3 = 36 pieces. He gave 5 to his little brother, so now he has 36 - 5 = 31 pieces. The answer is 31."], "answer": "21"}
{"input": "John had 5 action figures, but needed 7 total for a complete collection. If each one costs $5, how much money would he need to finish his collection?", "output": ["He has 5 action figures. He needs 7 more. That means he needs 7 - 5 = 2 more. He needs to spend 2 * $5 = $10 more. The answer is $10."], "answer": "10"}
{"input": "A painter needed to paint 9 rooms in a building. Each room takes 8 hours to paint. If he already painted 5 rooms, how much longer will he take to paint the rest?", "output": ["He has already painted 5 rooms. Each room takes 8 hours to paint. So in total he has spent 8 * 5 = 40 hours painting. He still has 9 rooms to paint. So in total he will spend 9 * 8 = 72 hours painting. The answer is 72."], "answer": "32"}
{"input": "Each chocolate bar in a box cost $4. If a box had 8 bars total and Emily sold all but 3 bars, how much money would she have made?", "output": ["Each chocolate bar in a box cost $4. If a box had 8 bars total, then 8 * $4 = $32. Emily sold all but 3 bars, so she sold 8 - 3 = 5 bars. That means she made $32 - 5 * $4 = $27. The answer is 27."], "answer": "20"}
{"input": "At lunch a waiter had 10 customers and 5 of them didn't leave a tip. If he got $3 each from the ones who did tip, how much money did he earn?", "output": ["He got $3 each from the ones who did tip. This means he got $3 * 5 = $15 from the ones who did tip. He had 10 customers, 5 of which didn't leave a tip. So he had 10 - 5 = 5 customers who did leave a tip. So he got $15 from the ones who did tip, and he got nothing from the ones who didn't tip. So he earned $15 - 0 = $15. The answer is 15."], "answer": "15"}
{"input": "A worksheet had 4 problems on it. If a teacher had 9 worksheets to grade and had already graded 5 of them, how many more problems does she have to grade?", "output": ["She has graded 5 worksheets. There are 4 problems on each worksheet. So in total she has graded 5 * 4 = 20 problems. She has 9 worksheets to grade. So in total she has 9 * 4 = 36 problems. She has 36 - 20 = 16 problems left to grade. The answer is 16."], "answer": "16"}
{"input": "Will invited 9 friends to a birthday party, but 4 couldn't come. If he wanted to buy enough cupcakes so each person could have exactly 8, how many should he buy?", "output": ["He invited 9 friends. 4 couldn't come. That means there are 5 friends who can come. He wants to buy enough cupcakes so each person can have exactly 8. That means he needs to buy 8 * 5 = 40 cupcakes. The answer is 40."], "answer": "40"}
{"input": "A magician was selling magic card decks for 9 dollars each. If he started with 12 decks and by the end of the day he had 7 left, how much money did he earn?", "output": ["He started with 12 decks. He sold 7 decks, so now he has 5 decks left. The number of decks he sold must have been 12 - 5 = 7. The answer is 7."], "answer": "45"}
{"input": "A chef needs to cook 9 potatoes. He has already cooked 7. If each potato takes 3 minutes to cook, how long will it take him to cook the rest?", "output": ["He has already cooked 7 potatoes. He needs to cook 9. That means he needs to cook 9 - 7 = 2 more potatoes. Each potato takes 3 minutes to cook. So in total he needs to cook 2 * 3 = 6 minutes. The answer is 6 minutes."], "answer": "6"}
{"input": "A magician was selling magic card decks for 5 dollars each. If he started with 14 decks and by the end of the day he had 5 left, how much money did he earn?", "output": ["He started with 14 decks. He sold 5 decks, so now he has 9 decks left. He sold 5 decks for $5 each, so he earned 5 * $5 = $25. He started with 14 decks, so now he has 9 decks left. He sold 9 decks for $5 each, so he earned 9 * $5 = $45. He started with 14 decks, so now he has 5 decks left. He sold 5 decks for $5 each, so he earned 5 * $5 = $25. He started with 14 decks, so now he has 5 decks left. He sold 5 decks for $5 each, so he earned 5 * $5 = $25. He started with 14 decks, so now he has 5 decks left. He sold 5 decks for $5 each, so he earned 5 * $5 = $25. He started with 14 decks, so now he has 5 decks left. He sold 5 decks for $5 each, so he earned 5 * $5 = $25. He started with 14 decks, so now he has 5 decks left. He sold 5 decks for $5 each, so he earned 5 * $5 = $25. He started with 14 decks, so now he has 5 decks left. He sold 5 decks for $5 each, so he earned 5 * $5 = $25. He started with 14 decks, so now he has 5 decks left. He sold 5 decks for $5 each, so he earned 5 * $5 = $25. He started with 14 decks, so now he has 5 decks left. He sold 5 decks for $5 each, so he earned 5 * $5 = $25. He started"], "answer": "45"}
{"input": "Each chocolate bar in a box cost $3. If a box had 9 bars total and Wendy sold all but 3 bars, how much money would she have made?", "output": ["Each chocolate bar in a box cost $3. If a box had 9 bars total, then each bar cost $3 / 9 = $0.33. Wendy sold all but 3 bars. So she sold 8 bars. 8 * $0.33 = $2.64. The answer is $2.64."], "answer": "18"}
{"input": "A painter needed to paint 12 rooms in a building. Each room takes 3 hours to paint. If he already painted 4 rooms, how much longer will he take to paint the rest?", "output": ["He has already painted 4 rooms. Each room takes 3 hours to paint. So in total he has spent 12 * 3 = 36 hours painting. He has 4 rooms left to paint. So he will spend 4 * 3 = 12 hours painting the remaining rooms. So in total he will spend 36 + 12 = 48 hours painting. The answer is 48."], "answer": "24"}
{"input": "Adam bought 13 boxes of chocolate candy and gave 7 to his little brother. If each box has 6 pieces inside it, how many pieces did Adam still have?", "output": ["Adam bought 13 boxes of chocolate candy. Each box has 6 pieces inside it. So in total he has 13 * 6 = 78 pieces. He gave 7 to his little brother, so now he has 78 - 7 = 71 pieces. The answer is 71."], "answer": "36"}
{"input": "At a restaurant each adult meal costs $7 and kids eat free. If a group of 13 people came in and 9 were kids, how much would it cost for the group to eat?", "output": ["Each adult meal costs $7. Each kid eats free. So the total cost for the group is $7 * 9 + 0 * 13 = $79. The answer is $79."], "answer": "28"}
{"input": "A trivia team had 7 members total, but during a game 2 members didn't show up. If each member that did show up scored 4 points, how many points were scored total?", "output": ["There were 7 members total. 2 members didn't show up. So there were 5 members that did show up. Each member that did show up scored 4 points. So in total 5 * 4 = 20 points were scored. The answer is 20."], "answer": "20"}
{"input": "Kaleb had 10 video games but 8 of them weren't working. If he wanted to sell the working games for $6 each, how much money could he earn?", "output": ["He had 10 video games but 8 of them weren't working. That means he had 2 working games. If he wanted to sell the working games for $6 each, he would earn $6 * 2 = $12. The answer is 12."], "answer": "12"}
{"input": "April's discount flowers was having a sale where each rose was 7 dollars. If April started with 9 roses and had 4 roses left, how much money did she earn?", "output": ["April started with 9 roses. Each rose was $7. So in total she had 9 * $7 = $63. She had 4 roses left, so she earned $63 - 4 = $59. The answer is 59."], "answer": "35"}
{"input": "At lunch a waiter had 9 customers and 5 of them didn't leave a tip. If he got $8 each from the ones who did tip, how much money did he earn?", "output": ["He got $8 from the 5 customers who did tip. This means he got $8 * 5 = $40. He had 9 customers, so he got $40 / 9 = $4.44 from each customer who did tip. The answer is $4.44."], "answer": "32"}
{"input": "A new building needed 14 windows. The builder had already installed 8 of them. If it takes 8 hours to install each window, how long will it take him to install the rest?", "output": ["The builder has already installed 8 windows. He needs to install 14 windows. That means he needs to install 6 more windows. He needs to install 6 more windows in 8 hours. That means he needs to install 6 / 8 = 0.75 windows per hour. The answer is 0.75 hours."], "answer": "48"}
{"input": "Bianca earned 5 points for each bag of cans she recycled. If she had 17 bags, but didn't recycle 8 of them, how many points would she have earned?", "output": ["She earned 5 points for each bag of cans she recycled. She had 17 bags, but didn't recycle 8 of them. So she recycled 17 - 8 = 9 bags. She earned 5 * 9 = 45 points. The answer is 45."], "answer": "45"}
{"input": "A chef needs to cook 15 potatoes. He has already cooked 6. If each potato takes 8 minutes to cook, how long will it take him to cook the rest?", "output": ["He has already cooked 6 potatoes. He needs to cook 15 potatoes. That means he needs to cook 9 more potatoes. Each potato takes 8 minutes to cook. So in total he needs to cook 9 * 8 = 72 minutes. The answer is 72 minutes."], "answer": "72"}
{"input": "Henry had 3 action figures, but needed 8 total for a complete collection. If each one costs $6, how much money would he need to finish his collection?", "output": ["He has 3 action figures. He needs 8 more. That means he needs 8 - 3 = 5 more. Each one costs $6, so he needs 5 * $6 = $30. The answer is $30."], "answer": "30"}
{"input": "John earned 8 dollars for each lawn he mowed. If he had 15 lawns to mow, but forgot to mow 7 of them, how much money did he actually earn?", "output": ["He earned 8 dollars for each lawn he mowed. He had 15 lawns to mow, but forgot to mow 7 of them. So he only mowed 8 lawns. That means he earned 8 * 8 = 64 dollars. The answer is 64."], "answer": "64"}
{"input": "There were 10 friends playing a video game online when 7 players quit. If each player left had 8 lives, how many lives did they have total?", "output": ["There were 10 friends playing a video game online. 7 players quit. That means there are 3 players left. Each player left had 8 lives. So in total there are 3 * 8 = 24 lives. The answer is 24."], "answer": "24"}
{"input": "In a video game, each enemy defeated gives you 8 points. If a level has 7 enemies total and you destroy all but 2 of them, how many points would you earn?", "output": ["Each enemy gives you 8 points. There are 7 enemies in total. If you destroy all but 2 of them, that means you have destroyed 6 enemies. 6 enemies * 8 points = 48 points. The answer is 48."], "answer": "40"}
{"input": "A painter needed to paint 11 rooms in a building. Each room takes 7 hours to paint. If he already painted 2 rooms, how much longer will he take to paint the rest?", "output": ["He already painted 2 rooms. That means he has 10 rooms left. Each room takes 7 hours to paint. So in total he needs 10 * 7 = 70 hours to paint the rest. He has already spent 2 hours, so he needs 70 - 2 = 68 hours. The answer is 68."], "answer": "63"}
{"input": "Dave had 10 video games but 2 of them weren't working. If he wanted to sell the working games for $4 each, how much money could he earn?", "output": ["He had 10 video games. 2 of them weren't working. That means he had 8 working video games. He wanted to sell the working video games for $4 each. That means he could sell 8 * $4 = $32. The answer is 32."], "answer": "32"}
{"input": "A worksheet had 4 problems on it. If a teacher had 16 worksheets to grade and had already graded 8 of them, how many more problems does she have to grade?", "output": ["She has graded 8 of them. She has 16 worksheets to grade. So she has 16 - 8 = 8 more worksheets to grade. The answer is 8."], "answer": "32"}
{"input": "A worksheet had 2 problems on it. If a teacher had 14 worksheets to grade and had already graded 7 of them, how many more problems does she have to grade?", "output": ["The teacher has graded 7 problems. There are 2 problems on each worksheet. So there are 7 * 2 = 14 problems. The answer is 14."], "answer": "14"}
{"input": "April's discount flowers was having a sale where each rose was 4 dollars. If April started with 13 roses and had 4 roses left, how much money did she earn?", "output": ["April started with 13 roses. She sold 4 roses. That means she sold 4 * $4 = $16. She earned $16. The answer is 16."], "answer": "36"}
{"input": "At a restaurant each adult meal costs $5 and kids eat free. If a group of 15 people came in and 8 were kids, how much would it cost for the group to eat?", "output": ["Each adult meal costs $5. Each kid eats free. So the total cost for the group is $5 * 8 + 0 * 15 = $40. The answer is 40."], "answer": "35"}
{"input": "Zoe baked 5 brownies, but needed 11 total for her party. If she used 7 cups of flour on each one, how much cups of flour does she still need?", "output": ["She baked 5 brownies, but needed 11 total. That means she needs 11 - 5 = 6 more brownies. She used 7 cups of flour on each one, so she needs 6 * 7 = 42 cups of flour. The answer is 42."], "answer": "42"}
{"input": "A painter needed to paint 6 rooms in a building. Each room takes 5 hours to paint. If he already painted 2 rooms, how much longer will he take to paint the rest?", "output": ["He already painted 2 rooms. That means he has 4 rooms left. Each room takes 5 hours to paint. So in total he needs to paint 4 * 5 = 20 hours. He has already spent 2 hours, so he needs to spend 20 - 2 = 18 hours more. The answer is 18."], "answer": "20"}
{"input": "Each chocolate bar in a box cost $4. If a box had 11 bars total and Vanessa sold all but 7 bars, how much money would she have made?", "output": ["Each chocolate bar in a box cost $4. If a box had 11 bars total, then 11 * $4 = $44. Vanessa sold all but 7 bars, so she sold 11 - 7 = 4 bars. That means she made $44 - $4 = $40. The answer is $40."], "answer": "16"}
{"input": "Gwen earned 8 points for each bag of cans she recycled. If she had 4 bags, but didn't recycle 2 of them, how many points would she have earned?", "output": ["She earned 8 points for each bag of cans she recycled. She had 4 bags, but didn't recycle 2 of them. So she recycled 4 - 2 = 2 bags. Each bag of cans she recycled earned her 8 points, so in total she earned 8 * 2 = 16 points. The answer is 16."], "answer": "16"}
{"input": "A new building needed 12 windows. The builder had already installed 6 of them. If it takes 4 hours to install each window, how long will it take him to install the rest?", "output": ["The builder has already installed 6 windows. He needs to install the remaining 6 windows. Each window takes 4 hours to install. So in total he needs to install 6 * 4 = 24 hours. He has already installed 6 windows, so he needs to install 24 - 6 = 18 hours. The answer is 18 hours."], "answer": "24"}
{"input": "A chef needs to cook 15 potatoes. He has already cooked 8. If each potato takes 9 minutes to cook, how long will it take him to cook the rest?", "output": ["He has already cooked 8 potatoes. He needs to cook 15 potatoes. That means he needs to cook 15 - 8 = 7 more potatoes. Each potato takes 9 minutes to cook. So in total he needs to cook 7 * 9 = 63 minutes. The answer is 63 minutes."], "answer": "63"}
{"input": "A trivia team had 14 members total, but during a game 7 members didn't show up. If each member that did show up scored 5 points, how many points were scored total?", "output": ["There were 14 members total. 7 members didn't show up. That means there were 7 - 7 = 0 members that didn't show up. The remaining 7 members scored 5 points each. That means in total 7 * 5 = 35 points were scored. The answer is 35."], "answer": "35"}
{"input": "A chef needs to cook 13 potatoes. He has already cooked 5. If each potato takes 6 minutes to cook, how long will it take him to cook the rest?", "output": ["He has already cooked 5 potatoes. He needs to cook 13 - 5 = 8 more. Each potato takes 6 minutes to cook. So in total he needs to cook 8 * 6 = 48 minutes. The answer is 48 minutes."], "answer": "48"}
{"input": "A trivia team had 11 members total, but during a game 6 members didn't show up. If each member that did show up scored 9 points, how many points were scored total?", "output": ["There were 11 members total. 6 members didn't show up. That means there were 5 members that did show up. Each member that did show up scored 9 points. So in total 5 * 9 = 45 points were scored. The answer is 45."], "answer": "45"}
{"input": "Each chocolate bar in a box cost $2. If a box had 13 bars total and Rachel sold all but 4 bars, how much money would she have made?", "output": ["Each chocolate bar in a box cost $2. If a box had 13 bars total, then the total cost of the box is $2 * 13 = $26. Rachel sold all but 4 bars, so she sold 26 - 4 = 22 bars. The price of each bar is $2, so the total money she made is $2 * 22 = $44. The answer is $44."], "answer": "18"}
{"input": "Isabel baked 3 brownies, but needed 5 total for her party. If she used 5 cups of flour on each one, how much cups of flour does she still need?", "output": ["She baked 3 brownies, but needed 5 total. That means she needs 2 more. She used 5 cups of flour on each one, so she needs 2 * 5 = 10 cups of flour. The answer is 10."], "answer": "10"}
{"input": "A worksheet had 3 problems on it. If a teacher had 15 worksheets to grade and had already graded 7 of them, how many more problems does she have to grade?", "output": ["The teacher has graded 7 worksheets. There are 15 worksheets in total. So she has graded 7 / 15 = 0.45 worksheets. She has to grade 0.45 * 15 = 6.75 more worksheets. The answer is 6.75."], "answer": "24"}
{"input": "At lunch a waiter had 7 customers and 4 of them didn't leave a tip. If he got $9 each from the ones who did tip, how much money did he earn?", "output": ["He got $9 from the 4 who did tip. He got nothing from the 3 who didn't tip. So he earned $9 * 4 + 0 * 3 = $36. The answer is 36."], "answer": "27"}
{"input": "April's discount flowers was having a sale where each rose was 9 dollars. If April started with 11 roses and had 8 roses left, how much money did she earn?", "output": ["She started with 11 roses. She sold 8 roses. That means she sold 8 * $9 = $72. She earned $72. The answer is 72."], "answer": "27"}
{"input": "Tom bought 14 boxes of chocolate candy and gave 8 to his little brother. If each box has 3 pieces inside it, how many pieces did Tom still have?", "output": ["Tom bought 14 boxes of chocolate candy. Each box has 3 pieces inside it. So in total he has 14 * 3 = 42 pieces. He gave 8 to his little brother, so now he has 42 - 8 = 34 pieces. The answer is 34."], "answer": "18"}
{"input": "At a restaurant each adult meal costs $2 and kids eat free. If a group of 15 people came in and 9 were kids, how much would it cost for the group to eat?", "output": ["Each adult meal costs $2. Each kid eats free. So the total cost for the group is $2 * 9 + 0 * 15 = $27. The answer is 27."], "answer": "12"}
{"input": "Edward earned 4 dollars for each lawn he mowed. If he had 17 lawns to mow, but forgot to mow 9 of them, how much money did he actually earn?", "output": ["He earned 4 dollars for each lawn he mowed. He had 17 lawns to mow, but forgot to mow 9 of them. So he only mowed 8 lawns. That means he earned 4 * 8 = $32. The answer is 32."], "answer": "32"}
{"input": "A new building needed 11 windows. The builder had already installed 4 of them. If it takes 8 hours to install each window, how long will it take him to install the rest?", "output": ["The builder has already installed 4 windows. He needs to install the rest. So, the number of windows he needs to install is 11 - 4 = 7. He needs to install 7 windows. Each window takes 8 hours to install. So, the total time to install the windows is 7 * 8 = 56 hours. The answer is 56 hours."], "answer": "56"}
{"input": "Tom bought 12 boxes of chocolate candy and gave 7 to his little brother. If each box has 6 pieces inside it, how many pieces did Tom still have?", "output": ["Tom bought 12 boxes of chocolate candy. Each box has 6 pieces inside it. So in total he has 12 * 6 = 72 pieces. He gave 7 to his little brother, so now he has 72 - 7 = 65 pieces. The answer is 65."], "answer": "30"}
{"input": "John had 6 action figures, but needed 11 total for a complete collection. If each one costs $6, how much money would he need to finish his collection?", "output": ["He has 6 action figures. He needs 11 more. That means he needs 11 - 6 = 5 more. Each one costs $6, so he needs 5 * $6 = $30. The answer is $30."], "answer": "30"}
{"input": "At a restaurant each adult meal costs $8 and kids eat free. If a group of 11 people came in and 2 were kids, how much would it cost for the group to eat?", "output": ["Each adult meal costs $8. If 2 are kids, then the other 9 are adults. So the total cost for the adults is 9 * $8 = $72. The kids eat free, so the total cost is $72 - $0 = $72. The answer is $72."], "answer": "72"}
{"input": "At the fair Kaleb bought 6 tickets. After riding the ferris wheel he had 3 tickets left. If each ticket cost 9 dollars, how much money did Kaleb spend riding the ferris wheel?", "output": ["He bought 6 tickets. He had 3 tickets left. That means he spent 6 - 3 = 3 tickets. Each ticket costs 9 dollars, so he spent 3 * 9 = $27. The answer is 27."], "answer": "27"}
{"input": "Tiffany baked 8 brownies, but needed 17 total for her party. If she used 8 cups of flour on each one, how much cups of flour does she still need?", "output": ["She baked 8 brownies, but needed 17 total. That means she needs 17 - 8 = 9 more brownies. Each brownie needs 8 cups of flour. So in total she needs 9 * 8 = 72 cups of flour. The answer is 72."], "answer": "72"}
{"input": "In a video game, each enemy defeated gives you 7 points. If a level has 11 enemies total and you destroy all but 8 of them, how many points would you earn?", "output": ["You have 11 enemies. You destroy 8 of them. That means you have 11 - 8 = 3 enemies left. You earn 7 points for each enemy you destroy. So you earn 7 * 3 = 21 points. The answer is 21."], "answer": "21"}
{"input": "A magician was selling magic card decks for 7 dollars each. If he started with 16 decks and by the end of the day he had 8 left, how much money did he earn?", "output": ["He started with 16 decks. He sold 8 decks, so now he has 8 - 16 = -8 decks. He earned -8 * $7 = -$56. The answer is -56."], "answer": "56"}
{"input": "There were 13 friends playing a video game online when 8 players quit. If each player left had 6 lives, how many lives did they have total?", "output": ["There were 13 friends playing a video game online. 8 players quit. That means there are now 5 players left. Each player left had 6 lives. So in total there are 5 * 6 = 30 lives. The answer is 30."], "answer": "30"}
{"input": "At lunch a waiter had 7 customers and 5 of them didn't leave a tip. If he got $3 each from the ones who did tip, how much money did he earn?", "output": ["He got $3 each from the 5 customers who did tip. This means he got 5 * $3 = $15. He had 7 customers, so he got $15 from the 5 customers who did tip. He had 7 customers, so he got $15 from the 5 customers who did tip. He had 7 customers, so he got $15 from the 5 customers who did tip. He had 7 customers, so he got $15 from the 5 customers who did tip. He had 7 customers, so he got $15 from the 5 customers who did tip. He had 7 customers, so he got $15 from the 5 customers who did tip. He had 7 customers, so he got $15 from the 5 customers who did tip. He had 7 customers, so he got $15 from the 5 customers who did tip. He had 7 customers, so he got $15 from the 5 customers who did tip. He had 7 customers, so he got $15 from the 5 customers who did tip. He had 7 customers, so he got $15 from the 5 customers who did tip. He had 7 customers, so he got $15 from the 5 customers who did tip. He had 7 customers, so he got $15 from the 5 customers who did tip. He had 7 customers, so he got $15 from the 5 customers who did tip. He had 7 customers, so he got $15 from the 5 customers who did tip. He had 7 customers, so he got $15 from the 5 customers who did tip. He had 7 customers, so he got $15 from the 5 customers who did tip. He had 7 customers,"], "answer": "6"}
{"input": "At the fair Adam bought 10 tickets. After riding the ferris wheel he had 3 tickets left. If each ticket cost 9 dollars, how much money did Adam spend riding the ferris wheel?", "output": ["He bought 10 tickets for $9 each. This means he spent $9 * 10 = $90. He had 3 tickets left, so he spent $90 - 3 = $87. The answer is 87."], "answer": "63"}
{"input": "A worksheet had 7 problems on it. If a teacher had 17 worksheets to grade and had already graded 8 of them, how many more problems does she have to grade?", "output": ["She has graded 8 of them. She has 17 worksheets to grade. That means she has 17 - 8 = 9 worksheets left to grade. The answer is 9."], "answer": "63"}
{"input": "A trivia team had 9 members total, but during a game 3 members didn't show up. If each member that did show up scored 2 points, how many points were scored total?", "output": ["There were 9 members total, but 3 didn't show up. That means there were 6 members that did show up. Each member that did show up scored 2 points, so in total 6 * 2 = 12 points were scored. The answer is 12."], "answer": "12"}
{"input": "Mike had 15 video games but 9 of them weren't working. If he wanted to sell the working games for $5 each, how much money could he earn?", "output": ["He had 15 video games. 9 of them weren't working. That means he had 6 working games. If he sold the working games for $5 each, he would earn 6 * $5 = $30. The answer is 30."], "answer": "30"}
{"input": "Edward earned 9 dollars for each lawn he mowed. If he had 6 lawns to mow, but forgot to mow 2 of them, how much money did he actually earn?", "output": ["He earned 9 dollars for each lawn he mowed. He had 6 lawns to mow, but forgot to mow 2 of them. So he only mowed 4 lawns. That means he earned 9 * 4 = $36. The answer is 36."], "answer": "36"}
{"input": "At a restaurant each adult meal costs $2 and kids eat free. If a group of 9 people came in and 2 were kids, how much would it cost for the group to eat?", "output": ["Each adult meal costs $2. Each kid eats free. So the total cost for the group is $2 * 9 + 0 = $18. The answer is $18."], "answer": "14"}
{"input": "Chloe baked 7 brownies, but needed 16 total for her party. If she used 6 cups of flour on each one, how much cups of flour does she still need?", "output": ["She baked 7 brownies, but needed 16 total. That means she needs 9 more brownies. Each brownie needs 6 cups of flour. So in total she needs 9 * 6 = 54 cups of flour. She used 7 * 6 = 42 cups of flour. That means she still needs 54 - 42 = 12 cups of flour. The answer is 12."], "answer": "54"}
{"input": "There were 8 friends playing a video game online when 3 players quit. If each player left had 3 lives, how many lives did they have total?", "output": ["There were 8 friends playing a video game online. 3 players quit. That means there are now 5 players left. Each player left had 3 lives. So in total there are 5 * 3 = 15 lives. The answer is 15."], "answer": "15"}
{"input": "Sam invited 9 friends to a birthday party, but 6 couldn't come. If he wanted to buy enough cupcakes so each person could have exactly 2, how many should he buy?", "output": ["Sam invited 9 friends to a birthday party, but 6 couldn't come. That means there are 3 friends who can come. Each friend can have 2 cupcakes. So in total 3 * 2 = 6 cupcakes. The answer is 6."], "answer": "6"}
{"input": "Megan earned 8 points for each bag of cans she recycled. If she had 14 bags, but didn't recycle 5 of them, how many points would she have earned?", "output": ["She earned 8 points for each bag of cans she recycled. She had 14 bags, but didn't recycle 5 of them. So she recycled 9 bags. That means she earned 8 * 9 = 72 points. The answer is 72."], "answer": "72"}
{"input": "Will had 57 dollars. If he spent 27 bucks on a new game, how many 6 dollar toys could he buy with the money he had left?", "output": ["He had 57 dollars. He spent 27 bucks on a new game. That means he has 57 - 27 = 30 dollars left. He can buy 30 / 6 = 5 toys. The answer is 5."], "answer": "5"}
{"input": "A pet store had 18 puppies. In one day they sold 3 of them and put the rest into cages with 5 in each cage. How many cages did they use?", "output": ["They sold 3 puppies. They put the rest into cages. The number of puppies in each cage must be 5. So, they must have used 18 / 5 = 3 cages. The answer is 3."], "answer": "3"}
{"input": "Luke had 47 pieces of clothing to wash. He put 17 of them in one load, but decided to split the rest into 5 equal loads. How many pieces of clothing could go in each of the small loads?", "output": ["He put 17 in one load. The rest he split into 5 equal loads. That means he put 17 / 5 = 3 pieces of clothing in each load. The answer is 3."], "answer": "6"}
{"input": "Edward bought 79 tickets at the state fair. He spent 23 tickets at the 'dunk a clown' booth and decided to use the rest on rides. If each ride cost 7 tickets, how many rides could he go on?", "output": ["Edward bought 79 tickets. He spent 23 tickets at the 'dunk a clown' booth. He has 76 tickets left. Each ride costs 7 tickets, so he can go on 76 / 7 = 10 rides. The answer is 10."], "answer": "8"}
{"input": "Katie baked 18 cupcakes for her school's bake sale. If her brother, Todd, ate 8 of them how many packages could she make if she put 2 cupcake in each package?", "output": ["Katie baked 18 cupcakes. Her brother ate 8 of them. That means there are 10 cupcakes left. If she puts 2 cupcakes in each package, she can make 5 packages. The answer is 5."], "answer": "5"}
{"input": "Megan had 93 files on her computer. She deleted 21 of them and put the rest into folders with 8 files in each one. How many folders did Megan end up with?", "output": ["She deleted 21 files. She put the rest into folders. The number of files in each folder is 8. So, she must have put the remaining files into 21 / 8 = 2.7 folders. The answer is 2.7."], "answer": "9"}
{"input": "Wendy uploaded 79 pictures to Facebook. She put 44 pics into one album and put the rest into 5 different albums. How many pictures were in each album?", "output": ["She put 44 pics into one album. This means she put 44 / 1 = 44 pics into one album. She put the rest into 5 different albums. This means she put the rest into 5 albums. The number of pics in each album is 44 / 5 = 8. The answer is 8."], "answer": "7"}
{"input": "Isabel had 72 homework problems. She finished 32 of them but still had 5 pages of problems to do. If each page has the same number of problems on it, how many problems are on each page?", "output": ["Isabel had 72 homework problems. She finished 32 of them, so she still has 72 - 32 = 40 problems to do. Each page has the same number of problems on it, so 40 problems must be on each page. The answer is 40."], "answer": "8"}
{"input": "The cafeteria had 62 apples. For lunch they handed out 8 to students and decided to use the rest to make pies. If each pie takes 9 apples, how many pies could they make?", "output": ["They had 62 apples. They gave 8 to students and decided to use the rest to make pies. That means they have 62 - 8 = 54 apples left. Each pie takes 9 apples, so they can make 54 / 9 = 6 pies. The answer is 6."], "answer": "6"}
{"input": "Mike made 101 dollars mowing lawns over the summer. If he spent 47 dollars buying new mower blades, how many 6 dollar games could he buy with the money he had left?", "output": ["He made 101 dollars mowing lawns over the summer. He spent 47 dollars on new mower blades. That means he has 101 - 47 = 54 dollars left. He can buy 54 / 6 = 9 games. The answer is 9."], "answer": "9"}
{"input": "Paige's team won their dodgeball game and scored 41 points total. If Paige scored 11 of the points and everyone else scored 6 points each, how many players were on her team?", "output": ["Paige scored 11 points. Everyone else scored 6 points each. That means Paige's team had 11 + 6 * 5 = 41 points. There were 5 players on her team. The answer is 5."], "answer": "5"}
{"input": "Oliver is at the library helping put away books. There are 46 book to put away total but a librarian takes 10 of them and leaves Oliver with the rest. If he can fit 4 books on a shelf, how many shelves will he need?", "output": ["There are 46 books to put away. 10 are taken away. That means there are 36 books left. If he can fit 4 books on a shelf, he needs 36 / 4 = 9 shelves. The answer is 9."], "answer": "9"}
{"input": "Emily was planting vegetables in her garden. She started with 41 seeds and planted 29 of them in the big garden and in each of her small gardens put 4 seeds each. How many small gardens did Emily have?", "output": ["Emily started with 41 seeds. She planted 29 of them in the big garden. She put 4 seeds in each of her small gardens. So, she had 41 - 29 = 12 seeds left. She put 4 seeds in each of her small gardens. So, she had 12 / 4 = 3 small gardens. The answer is 3."], "answer": "3"}
{"input": "Edward made 37 dollars mowing lawns over the summer. If he spent 21 dollars buying new mower blades, how many 2 dollar games could he buy with the money he had left?", "output": ["Edward made 37 dollars mowing lawns over the summer. He spent 21 dollars buying new mower blades. That means he has 37 - 21 = 16 dollars left. He can buy 16 / 2 = 8 games. The answer is 8."], "answer": "8"}
{"input": "A pet store had 81 puppies. In one day they sold 41 of them and put the rest into cages with 8 in each cage. How many cages did they use?", "output": ["They sold 41 puppies. They put the rest into cages. The number of puppies in each cage must be 8. So, they must have used 8 cages. The answer is 8."], "answer": "5"}
{"input": "There are 65 students trying out for the school's trivia teams. If 17 of them didn't get picked for the team and the rest were put into 8 groups, how many students would be in each group?", "output": ["There are 65 students trying out for the school's trivia teams. If 17 of them didn't get picked for the team, that means there are 48 students who got picked for the team. There are 8 groups, so each group must have 48 / 8 = 6 students. The answer is 6."], "answer": "6"}
{"input": "Tom had 57 dollars. If he spent 49 bucks on a new game, how many 4 dollar toys could he buy with the money he had left?", "output": ["He had 57 dollars. He spent 49 bucks on a new game, so now he has 57 - 49 = 8 dollars left. He can buy 8 $4 toys. The answer is 8."], "answer": "2"}
{"input": "Isabel picked 66 flowers for her friend’s wedding. She was making bouquets with 8 flowers in each one. If 10 of the flowers wilted before the wedding, how many bouquets could she still make?", "output": ["Isabel picked 66 flowers. She was making bouquets with 8 flowers in each one. That means she could make 66 / 8 = 8 bouquets. If 10 of the flowers wilted, she could still make 66 - 10 = 56 bouquets. The answer is 56."], "answer": "7"}
{"input": "For Halloween Sarah received 108 pieces of candy. She ate 36 pieces then placed the rest into piles with 9 in each pile. How many piles could she make?", "output": ["She ate 36 pieces. She placed the rest into piles with 9 in each pile. That means she has 108 - 36 = 72 pieces left. 72 / 9 = 8 piles. The answer is 8."], "answer": "8"}
{"input": "Nancy had 80 files on her computer. She deleted 31 of them and put the rest into folders with 7 files in each one. How many folders did Nancy end up with?", "output": ["She deleted 31 files. She put the rest into folders. The number of files in each folder is 7. So, the number of folders she ended up with is 31 / 7 = 4. The answer is 4."], "answer": "7"}
{"input": "There are 36 students trying out for the school's trivia teams. If 9 of them didn't get picked for the team and the rest were put into 3 groups, how many students would be in each group?", "output": ["There are 36 students trying out for the school's trivia teams. 9 of them didn't get picked for the team. That means there are 27 students left. If the rest were put into 3 groups, there would be 9 students in each group. The answer is 9."], "answer": "9"}
{"input": "The cafeteria had 96 apples. For lunch they handed out 42 to students and decided to use the rest to make pies. If each pie takes 6 apples, how many pies could they make?", "output": ["They had 96 apples. They handed out 42 to students. That means they have 96 - 42 = 54 apples left. Each pie takes 6 apples, so they can make 54 / 6 = 9 pies. The answer is 9."], "answer": "9"}
{"input": "A pet store had 64 puppies. In one day they sold 28 of them and put the rest into cages with 4 in each cage. How many cages did they use?", "output": ["They sold 28 puppies. They put the rest into cages. The number of puppies in each cage must be 4. So, the number of puppies in the beginning must have been 64 - 28 = 36. They put 36 puppies into cages. There are 4 cages. So, the answer is 4."], "answer": "9"}
{"input": "Edward was selling his old games. He started out with 35 but sold 19 of them. He packed the rest up putting 8 games into each box. How many boxes did he have to use?", "output": ["He started out with 35 games. He sold 19 of them. That means he has 35 - 19 = 16 games left. He packed the rest up putting 8 games into each box. That means he has 16 / 8 = 2 boxes. The answer is 2."], "answer": "2"}
{"input": "Frank made 19 dollars mowing lawns over the summer. If he spent 11 dollars buying new mower blades, how many 2 dollar games could he buy with the money he had left?", "output": ["Frank made 19 dollars mowing lawns over the summer. He spent 11 dollars buying new mower blades. That means he has 19 - 11 = 8 dollars left. He can buy 8 * 2 = 16 games. The answer is 16."], "answer": "4"}
{"input": "Megan had 40 homework problems. She finished 26 of them but still had 2 pages of problems to do. If each page has the same number of problems on it, how many problems are on each page?", "output": ["She finished 26 of them. That means she has 26 - 40 = 14 problems left. She still has 2 pages of problems to do. That means she has 14 / 2 = 7 problems on each page. The answer is 7."], "answer": "7"}
{"input": "Wendy picked 103 flowers for her friend’s wedding. She was making bouquets with 8 flowers in each one. If 47 of the flowers wilted before the wedding, how many bouquets could she still make?", "output": ["She picked 103 flowers. She was making bouquets with 8 flowers in each one. That means she could make 103 / 8 = 12 bouquets. 47 of the flowers wilted, so she can still make 12 - 47 = 5 bouquets. The answer is 5."], "answer": "7"}
{"input": "Kaleb had 39 pieces of clothing to wash. He put 19 of them in one load, but decided to split the rest into 5 equal loads. How many pieces of clothing could go in each of the small loads?", "output": ["He put 19 in one load. The rest were split into 5 equal loads. That means each load must have 19 / 5 = 3.8 pieces of clothing. The answer is 3.8."], "answer": "4"}
{"input": "A company invited 18 people to a luncheon, but 12 of them didn't show up. If the tables they had held 3 people each, how many tables do they need?", "output": ["They invited 18 people. 12 didn't show up. That means they had 6 people show up. They had 3 people per table, so they need 6 / 3 = 2 tables. The answer is 2."], "answer": "2"}
{"input": "Mike is at the library helping put away books. There are 82 book to put away total but a librarian takes 10 of them and leaves Mike with the rest. If he can fit 9 books on a shelf, how many shelves will he need?", "output": ["There are 82 books to put away. 10 are taken away. That means there are now 72 books left. If he can fit 9 books on a shelf, he needs 72 / 9 = 8 shelves. The answer is 8."], "answer": "8"}
{"input": "A pet store had 78 puppies. In one day they sold 30 of them and put the rest into cages with 8 in each cage. How many cages did they use?", "output": ["They sold 30 puppies. They put the rest into cages. The number of puppies in each cage must be 8. So, the number of puppies in the beginning must have been 78 - 30 = 48. They put 48 puppies into cages. The answer is 48."], "answer": "6"}
{"input": "Bianca uploaded 33 pictures to Facebook. She put 27 pics into one album and put the rest into 3 different albums. How many pictures were in each album?", "output": ["She put 27 pics into one album. She put the rest into 3 different albums. That means she put 27 + 3 = 30 pics into the first album. She put the rest into 3 albums. That means she put 30 - 3 = 27 pics into the second album. She put the rest into 3 albums. That means she put 27 - 3 = 24 pics into the third album. The answer is 30, 27, and 24."], "answer": "2"}
{"input": "Emily's team won their dodgeball game and scored 39 points total. If Emily scored 23 of the points and everyone else scored 2 points each, how many players were on her team?", "output": ["Emily scored 23 points. Everyone else scored 2 points each. That means Emily's team had 23 + 2 * (number of players) = 39 points. Since Emily scored 23 points, the number of players must be 23 - 23 = 0. The answer is 0."], "answer": "8"}
{"input": "A company invited 47 people to a luncheon, but 7 of them didn't show up. If the tables they had held 5 people each, how many tables do they need?", "output": ["They invited 47 people. 7 didn't show up. That means they had 40 people. They had 5 people per table. So they needed 40 / 5 = 8 tables. The answer is 8."], "answer": "8"}
{"input": "A waiter had 44 customers in his section. If 12 of them left and the rest of his tables had 8 people at each table, how many tables did he have?", "output": ["He had 44 customers in his section. 12 of them left. That means he has 44 - 12 = 32 customers left. He has 8 customers at each table. So in total he has 32 * 8 = 256 customers. The answer is 256."], "answer": "4"}
{"input": "A store had 40 coloring books in stock. They ended up putting them on sale and getting rid of 20 of them. The put the ones they still had onto shelves with 4 on each shelf. How many shelves did they use?", "output": ["They had 40 coloring books in stock. They put 20 on sale and got rid of them. They put the remaining ones on shelves with 4 on each shelf. That means they put 40 / 4 = 10 shelves. The answer is 10."], "answer": "5"}
{"input": "There are 64 students trying out for the school's trivia teams. If 36 of them didn't get picked for the team and the rest were put into 4 groups, how many students would be in each group?", "output": ["There are 64 students trying out for the school's trivia teams. 36 of them didn't get picked for the team. That means there are 64 - 36 = 28 students who got picked for the team. The rest were put into 4 groups. That means there are 28 students divided by 4 = 7 students in each group. The answer is 7."], "answer": "7"}
{"input": "Kaleb was selling his old games. He started out with 76 but sold 46 of them. He packed the rest up putting 5 games into each box. How many boxes did he have to use?", "output": ["He started out with 76 games. He sold 46 of them. That means he has 76 - 46 = 30 games left. He packed the rest up putting 5 games into each box. That means he has 30 * 5 = 150 games. He has to use 150 / 5 = 30 boxes. The answer is 30."], "answer": "6"}
{"input": "Jerry is at the library helping put away books. There are 34 book to put away total but a librarian takes 7 of them and leaves Jerry with the rest. If he can fit 3 books on a shelf, how many shelves will he need?", "output": ["There are 34 books to put away. 7 of them are taken away. That means there are 27 books left. If he can fit 3 books on a shelf, he needs 27 / 3 = 9 shelves. The answer is 9."], "answer": "9"}
{"input": "Nancy was planting vegetables in her garden. She started with 52 seeds and planted 28 of them in the big garden and in each of her small gardens put 4 seeds each. How many small gardens did Nancy have?", "output": ["She started with 52 seeds. She planted 28 of them in the big garden. That means she planted 52 - 28 = 24 seeds in the small gardens. She put 4 seeds in each small garden. So in total she put 24 * 4 = 96 seeds in the small gardens. The answer is 96."], "answer": "6"}
{"input": "Will had 83 dollars. If he spent 47 bucks on a new game, how many 4 dollar toys could he buy with the money he had left?", "output": ["He had 83 dollars. He spent 47 bucks on a new game, so now he has 83 - 47 = 36 dollars left. He can buy 36 / 4 = 9 toys. The answer is 9."], "answer": "9"}
{"input": "Bianca was planting vegetables in her garden. She started with 52 seeds and planted 40 of them in the big garden and in each of her small gardens put 2 seeds each. How many small gardens did Bianca have?", "output": ["She started with 52 seeds. She planted 40 of them in the big garden. That means she planted 52 - 40 = 12 seeds in each of her small gardens. She put 2 seeds in each of her small gardens. So in total she had 12 * 2 = 24 small gardens. The answer is 24."], "answer": "6"}
{"input": "A waiter had 21 customers in his section. If 12 of them left and the rest of his tables had 3 people at each table, how many tables did he have?", "output": ["He had 21 customers in his section. 12 of them left. That means he has 21 - 12 = 9 customers left. If the rest of his tables had 3 people at each table, that means he has 9 * 3 = 27 customers left. The answer is 27."], "answer": "3"}
{"input": "There are 25 students trying out for the school's trivia teams. If 15 of them didn't get picked for the team and the rest were put into 2 groups, how many students would be in each group?", "output": ["There are 25 students trying out for the school's trivia teams. 15 of them didn't get picked for the team. That means there are 25 - 15 = 10 students left. If the rest were put into 2 groups, then each group must have 10 students. The answer is 10."], "answer": "5"}
{"input": "The cafeteria had 47 apples. For lunch they handed out 27 to students and decided to use the rest to make pies. If each pie takes 4 apples, how many pies could they make?", "output": ["They had 47 apples. They handed out 27 to students. That means they have 47 - 27 = 20 apples left. They decided to use the rest to make pies. Each pie takes 4 apples, so in total they can make 20 / 4 = 5 pies. The answer is 5."], "answer": "5"}
{"input": "Megan baked 68 cupcakes for her school's bake sale. If her brother, Todd, ate 32 of them how many packages could she make if she put 6 cupcake in each package?", "output": ["Megan baked 68 cupcakes. Her brother ate 32 of them. That means there are 68 - 32 = 36 cupcakes left. If she puts 6 cupcakes in each package, she can make 36 / 6 = 6 packages. The answer is 6."], "answer": "6"}
{"input": "A store had 120 coloring books in stock. They ended up putting them on sale and getting rid of 39 of them. The put the ones they still had onto shelves with 9 on each shelf. How many shelves did they use?", "output": ["They had 120 coloring books in stock. They put 39 on sale and got rid of them. That means they have 120 - 39 = 81 coloring books left. They put 9 coloring books on each shelf. That means they have 81 / 9 = 9 shelves. The answer is 9."], "answer": "9"}
{"input": "Isabel uploaded 25 pictures to Facebook. She put 10 pics into one album and put the rest into 5 different albums. How many pictures were in each album?", "output": ["She put 10 pics into one album. This means she put 10 pics into one album. She put the rest into 5 different albums. This means she put the rest into 5 different albums. So, the number of pics in each album is 10 + 5 = 15. The answer is 15."], "answer": "3"}
{"input": "Sarah had 60 homework problems. She finished 20 of them but still had 5 pages of problems to do. If each page has the same number of problems on it, how many problems are on each page?", "output": ["She finished 20 of them. That means there are 60 - 20 = 40 problems left. Each page has the same number of problems on it. So, there are 40 problems on each page. The answer is 40."], "answer": "8"}
{"input": "Mike made 42 dollars mowing lawns over the summer. If he spent 10 dollars buying new mower blades, how many 8 dollar games could he buy with the money he had left?", "output": ["He made 42 dollars mowing lawns over the summer. He spent 10 dollars buying new mower blades. That means he has 42 - 10 = 32 dollars left. He can buy 32 / 8 = 4 games. The answer is 4."], "answer": "4"}
{"input": "Will had 59 pieces of clothing to wash. He put 32 of them in one load, but decided to split the rest into 9 equal loads. How many pieces of clothing could go in each of the small loads?", "output": ["He put 32 of them in one load. That means he has 59 - 32 = 27 pieces left. He split the rest into 9 equal loads. That means each load must have 27 / 9 = 3 pieces. The answer is 3."], "answer": "3"}
{"input": "Oliver made 35 dollars mowing lawns over the summer. If he spent 7 dollars buying new mower blades, how many 4 dollar games could he buy with the money he had left?", "output": ["He made 35 dollars mowing lawns over the summer. He spent 7 dollars buying new mower blades. That means he has 35 - 7 = 28 dollars left. He can buy 28 / 4 = 7 games. The answer is 7."], "answer": "7"}
{"input": "Emily was planting vegetables in her garden. She started with 42 seeds and planted 36 of them in the big garden and in each of her small gardens put 2 seeds each. How many small gardens did Emily have?", "output": ["She started with 42 seeds. She planted 36 of them in the big garden. That means she planted the remaining 6 seeds in each of her small gardens. There are 6 small gardens. The answer is 6."], "answer": "3"}
{"input": "There are 17 students trying out for the school's trivia teams. If 5 of them didn't get picked for the team and the rest were put into 3 groups, how many students would be in each group?", "output": ["There are 17 students trying out for the school's trivia teams. If 5 of them didn't get picked for the team, that means there are 12 students left. If they were put into 3 groups, that means each group has 4 students. The answer is 4."], "answer": "4"}
{"input": "Katie's team won their dodgeball game and scored 12 points total. If Katie scored 4 of the points and everyone else scored 4 points each, how many players were on her team?", "output": ["Katie scored 4 points. Everyone else scored 4 points each. That means there were 4 players on her team. The answer is 4."], "answer": "2"}
{"input": "Megan baked 71 cupcakes for her school's bake sale. If her brother, Todd, ate 43 of them how many packages could she make if she put 7 cupcake in each package?", "output": ["Megan baked 71 cupcakes. Her brother ate 43 of them. That means there are 28 cupcakes left. If she puts 7 cupcakes in each package, she can make 28 / 7 = 4 packages. The answer is 4."], "answer": "4"}
{"input": "Wendy uploaded 45 pictures to Facebook. She put 27 pics into one album and put the rest into 9 different albums. How many pictures were in each album?", "output": ["She put 27 pics into one album. This means she put 27 / 1 = 27 pics into one album. She put the rest into 9 different albums. This means she put the rest into 9 * 1 = 9 albums. The answer is 27 + 9 = 36."], "answer": "2"}
{"input": "A store had 86 coloring books in stock. They ended up putting them on sale and getting rid of 37 of them. The put the ones they still had onto shelves with 7 on each shelf. How many shelves did they use?", "output": ["They put the ones they still had onto shelves. They had 86 in beginning, so now they have 86 - 37 = 49. They put 7 on each shelf, so 49 / 7 = 7 shelves. The answer is 7."], "answer": "7"}
{"input": "The cafeteria had 50 apples. For lunch they handed out 5 to students and decided to use the rest to make pies. If each pie takes 5 apples, how many pies could they make?", "output": ["They had 50 apples. They gave 5 to students. They decided to use the rest to make pies. So, they have 45 apples left. Each pie takes 5 apples, so they can make 45 / 5 = 9 pies. The answer is 9."], "answer": "9"}
{"input": "Nancy had 101 homework problems. She finished 47 of them but still had 6 pages of problems to do. If each page has the same number of problems on it, how many problems are on each page?", "output": ["She finished 47 problems. She still has 6 pages of problems to do. That means she has 47 + 6 = 53 problems left. Each page has the same number of problems on it, so the number of problems on each page must be 53 / 6 = 9. The answer is 9."], "answer": "9"}
{"input": "Paige had 27 files on her computer. She deleted 9 of them and put the rest into folders with 6 files in each one. How many folders did Paige end up with?", "output": ["She deleted 9 files. She put the rest into folders. The number of files in each folder is 6. So, the number of folders she ended up with is 9 - 6 = 3. The answer is 3."], "answer": "3"}
{"input": "For Halloween Bianca received 78 pieces of candy. She ate 30 pieces then placed the rest into piles with 8 in each pile. How many piles could she make?", "output": ["She ate 30 pieces. She had 78 - 30 = 48 pieces left. She placed 8 pieces in each pile. So she could make 48 / 8 = 6 piles. The answer is 6."], "answer": "6"}
{"input": "A company invited 45 people to a luncheon, but 35 of them didn't show up. If the tables they had held 2 people each, how many tables do they need?", "output": ["They invited 45 people. 35 didn't show up. That means there were 45 - 35 = 10 people who showed up. They had tables for 2 people each. So they need 10 / 2 = 5 tables. The answer is 5."], "answer": "5"}
{"input": "Haley uploaded 65 pictures to Facebook. She put 17 pics into one album and put the rest into 6 different albums. How many pictures were in each album?", "output": ["She put 17 pics into one album. This means she put 17 pics into one album. She put the rest into 6 different albums. This means she put the rest into 6 different albums. So, the number of pics in each album is 17 + 6 = 23. The answer is 23."], "answer": "8"}
{"input": "A pet store had 102 puppies. In one day they sold 21 of them and put the rest into cages with 9 in each cage. How many cages did they use?", "output": ["They sold 21 puppies. They put the rest into cages. The number of puppies in each cage must be 9. So, they must have used 9 cages. The answer is 9."], "answer": "9"}
{"input": "Roger had 120 pieces of clothing to wash. He put 48 of them in one load, but decided to split the rest into 9 equal loads. How many pieces of clothing could go in each of the small loads?", "output": ["He put 48 in one load. The rest he split into 9 equal loads. That means each load must have 48 / 9 = 5 pieces of clothing. The answer is 5."], "answer": "8"}
{"input": "Wendy picked 45 flowers for her friend’s wedding. She was making bouquets with 5 flowers in each one. If 35 of the flowers wilted before the wedding, how many bouquets could she still make?", "output": ["She picked 45 flowers. She was making bouquets with 5 flowers in each one. That means she could make 45 / 5 = 9 bouquets. If 35 of the flowers wilted, she still has 45 - 35 = 10 flowers. She can make 10 / 5 = 2 bouquets. The answer is 2."], "answer": "2"}
{"input": "Isabel baked 39 cupcakes for her school's bake sale. If her brother, Todd, ate 21 of them how many packages could she make if she put 3 cupcake in each package?", "output": ["Isabel baked 39 cupcakes. Her brother ate 21 of them. That means there are 18 cupcakes left. If she puts 3 cupcakes in each package, she can make 18 / 3 = 6 packages. The answer is 6."], "answer": "6"}
{"input": "Sarah had 55 homework problems. She finished 6 of them but still had 7 pages of problems to do. If each page has the same number of problems on it, how many problems are on each page?", "output": ["Each page has the same number of problems on it. So, if she has 7 pages, then there must be 7 pages * 55 problems = 385 problems. She finished 6 of them, so she has 385 - 6 = 379 problems left. The answer is 379."], "answer": "7"}
{"input": "There are 58 students trying out for the school's trivia teams. If 10 of them didn't get picked for the team and the rest were put into 8 groups, how many students would be in each group?", "output": ["There are 58 students trying out for the school's trivia teams. 10 of them didn't get picked for the team. That means there are 48 students left. If they were put into 8 groups, that means each group has 6 students. The answer is 6."], "answer": "6"}
{"input": "Paige picked 53 flowers for her friend’s wedding. She was making bouquets with 7 flowers in each one. If 18 of the flowers wilted before the wedding, how many bouquets could she still make?", "output": ["She picked 53 flowers. She was making bouquets with 7 flowers in each one. That means she could make 53 / 7 = 7 bouquets. If 18 of the flowers wilted, she could still make 53 - 18 = 35 bouquets. The answer is 35."], "answer": "5"}
{"input": "A waiter had 22 customers in his section. If 14 of them left and the rest of his tables had 4 people at each table, how many tables did he have?", "output": ["He had 22 customers in his section. 14 of them left. That means he had 22 - 14 = 8 customers left. If the rest of his tables had 4 people at each table, that means he had 8 * 4 = 32 customers left. The answer is 32."], "answer": "2"}
{"input": "Luke was selling his old games. He started out with 39 but sold 19 of them. He packed the rest up putting 4 games into each box. How many boxes did he have to use?", "output": ["He started out with 39 games. He sold 19 of them, so now he has 39 - 19 = 20 games left. He packed the rest up putting 4 games into each box. That means he has 20 / 4 = 5 boxes. The answer is 5."], "answer": "5"}
{"input": "Haley baked 20 cupcakes for her school's bake sale. If her brother, Todd, ate 11 of them how many packages could she make if she put 3 cupcake in each package?", "output": ["Haley baked 20 cupcakes. Her brother ate 11 of them. That means there are 9 cupcakes left. If she puts 3 cupcakes in each package, she can make 3 * 9 = 27 packages. The answer is 27."], "answer": "3"}
{"input": "A pet store had 13 puppies. In one day they sold 7 of them and put the rest into cages with 2 in each cage. How many cages did they use?", "output": ["They sold 7 puppies. They put the rest into cages. The number of puppies in each cage must be 2. So, they must have put the remaining puppies into 7 cages. The answer is 7."], "answer": "3"}
{"input": "A store had 27 coloring books in stock. They ended up putting them on sale and getting rid of 6 of them. The put the ones they still had onto shelves with 7 on each shelf. How many shelves did they use?", "output": ["They had 27 coloring books in stock. They put 6 of them on sale. That means they have 27 - 6 = 21 coloring books left. They put 7 coloring books on each shelf. That means they have 21 / 7 = 3 shelves. The answer is 3."], "answer": "3"}
{"input": "Wendy had 82 files on her computer. She deleted 37 of them and put the rest into folders with 5 files in each one. How many folders did Wendy end up with?", "output": ["She deleted 37 files. She put the rest into folders. The number of files in each folder is 5. So, the number of folders she ended up with is 37 / 5 = 7. The answer is 7."], "answer": "9"}
{"input": "Kaleb had 12 dollars. If he spent 8 bucks on a new game, how many 2 dollar toys could he buy with the money he had left?", "output": ["He had 12 dollars. He spent 8 on a new game, so now he has 12 - 8 = 4 dollars left. He can buy 4 * 2 = 8 toys. The answer is 8."], "answer": "2"}
{"input": "Sarah was planting vegetables in her garden. She started with 21 seeds and planted 12 of them in the big garden and in each of her small gardens put 3 seeds each. How many small gardens did Sarah have?", "output": ["She started with 21 seeds. She planted 12 of them in the big garden. That means she has 21 - 12 = 9 seeds left. She put 3 seeds in each of her small gardens. That means she has 9 * 3 = 27 seeds. She has 27 seeds in total. The answer is 27."], "answer": "3"}
{"input": "Nancy uploaded 51 pictures to Facebook. She put 11 pics into one album and put the rest into 8 different albums. How many pictures were in each album?", "output": ["She put 11 pics into one album. This means she put 11 pics into one album. She put the rest into 8 different albums. This means she put the rest into 8 different albums. So, the number of pics in each album is 11 + 8 = 19. The answer is 19."], "answer": "5"}
{"input": "A company invited 24 people to a luncheon, but 10 of them didn't show up. If the tables they had held 7 people each, how many tables do they need?", "output": ["They invited 24 people. 10 didn't show up. That means there are 14 people. If each table holds 7 people, then 14 / 7 = 2 tables. The answer is 2."], "answer": "2"}
{"input": "Bianca's team won their dodgeball game and scored 75 points total. If Bianca scored 45 of the points and everyone else scored 6 points each, how many players were on her team?", "output": ["Bianca scored 45 points. Everyone else scored 6 points each. That means Bianca scored 45 / 6 = 7.5 times more than everyone else. So, if there were 10 players, then 7.5 * 10 = 75. The answer is 10."], "answer": "5"}
{"input": "For Halloween Emily received 54 pieces of candy. She ate 33 pieces then placed the rest into piles with 7 in each pile. How many piles could she make?", "output": ["She ate 33 pieces. She placed the rest into piles with 7 in each pile. That means she has 54 - 33 = 21 pieces left. She placed 21 pieces into piles. There are 7 in each pile. So in total there are 21 * 7 = 147 piles. The answer is 147."], "answer": "3"}
{"input": "Haley was planting vegetables in her garden. She started with 56 seeds and planted 35 of them in the big garden and in each of her small gardens put 3 seeds each. How many small gardens did Haley have?", "output": ["She started with 56 seeds. She planted 35 of them in the big garden. That means she planted the remaining 21 seeds in her small gardens. She put 3 seeds in each small garden. So in total she put 21 * 3 = 63 seeds in her small gardens. The answer is 63."], "answer": "7"}
{"input": "A store had 48 coloring books in stock. They ended up putting them on sale and getting rid of 38 of them. The put the ones they still had onto shelves with 5 on each shelf. How many shelves did they use?", "output": ["They had 48 coloring books in stock. They put 38 on sale. That means they have 10 left. They put 5 on each shelf. That means they have 10 / 5 = 2 shelves. The answer is 2."], "answer": "2"}
{"input": "Roger is at the library helping put away books. There are 14 book to put away total but a librarian takes 2 of them and leaves Roger with the rest. If he can fit 3 books on a shelf, how many shelves will he need?", "output": ["There are 14 books to put away. 2 are taken away, so there are 12 books left. If he can fit 3 books on a shelf, he needs 12 / 3 = 4 shelves. The answer is 4."], "answer": "4"}
{"input": "A pet store had 56 puppies. In one day they sold 24 of them and put the rest into cages with 4 in each cage. How many cages did they use?", "output": ["They sold 24 puppies. They put the rest into cages. The number of puppies in each cage must be 4. So, they must have used 24 / 4 = 6 cages. The answer is 6."], "answer": "8"}
{"input": "The cafeteria had 86 apples. For lunch they handed out 30 to students and decided to use the rest to make pies. If each pie takes 8 apples, how many pies could they make?", "output": ["They had 86 apples. They gave 30 to students. They decided to use the rest to make pies. The number of apples they used to make pies must be 86 - 30 = 56. Each pie takes 8 apples, so they can make 56 / 8 = 7 pies. The answer is 7."], "answer": "7"}
{"input": "Jerry had 60 pieces of clothing to wash. He put 40 of them in one load, but decided to split the rest into 5 equal loads. How many pieces of clothing could go in each of the small loads?", "output": ["He put 40 in one load. That means he has 60 - 40 = 20 pieces left. He split the rest into 5 equal loads. That means each load has 20 / 5 = 4 pieces of clothing. The answer is 4."], "answer": "4"}
{"input": "Mike made 69 dollars mowing lawns over the summer. If he spent 24 dollars buying new mower blades, how many 5 dollar games could he buy with the money he had left?", "output": ["He made 69 dollars mowing lawns over the summer. He spent 24 dollars buying new mower blades. That means he has 69 - 24 = 45 dollars left. He can buy 45 / 5 = 9 games. The answer is 9."], "answer": "9"}
{"input": "Will made 104 dollars mowing lawns over the summer. If he spent 41 dollars buying new mower blades, how many 9 dollar games could he buy with the money he had left?", "output": ["Will made 104 dollars mowing lawns over the summer. He spent 41 dollars on new mower blades. That means he has 104 - 41 = 63 dollars left. He can buy 63 / 9 = 7 games. The answer is 7."], "answer": "7"}
{"input": "For Halloween Bianca received 32 pieces of candy. She ate 12 pieces then placed the rest into piles with 5 in each pile. How many piles could she make?", "output": ["She ate 12 pieces. She had 32 - 12 = 20 pieces left. She placed 5 pieces in each pile. That means she can make 20 / 5 = 4 piles. The answer is 4."], "answer": "4"}
{"input": "Luke was selling his old games. He started out with 57 but sold 39 of them. He packed the rest up putting 2 games into each box. How many boxes did he have to use?", "output": ["He started out with 57 games. He sold 39 of them. He packed the rest up putting 2 games into each box. That means he has 57 - 39 = 18 games left. He packed the 18 games into boxes. The number of boxes he used must be 18 / 2 = 9. The answer is 9."], "answer": "9"}
{"input": "A pet store had 88 puppies. In one day they sold 34 of them and put the rest into cages with 6 in each cage. How many cages did they use?", "output": ["They sold 34 puppies. They put the rest into cages. The number of puppies in each cage must be 6. So, they must have used 34 / 6 = 5 cages. The answer is 5."], "answer": "9"}
{"input": "Katie had 85 files on her computer. She deleted 40 of them and put the rest into folders with 5 files in each one. How many folders did Katie end up with?", "output": ["She deleted 40 files. She put the rest into folders. The number of files in each folder is 5. So, the number of folders is 40 / 5 = 8. The answer is 8."], "answer": "9"}
{"input": "Roger had 68 dollars. If he spent 47 bucks on a new game, how many 7 dollar toys could he buy with the money he had left?", "output": ["He had 68 dollars. He spent 47 bucks on a new game, so now he has 68 - 47 = 21 dollars left. He can buy 21 / 7 = 3 toys. The answer is 3."], "answer": "3"}
{"input": "Tom bought 40 tickets at the state fair. He spent 28 tickets at the 'dunk a clown' booth and decided to use the rest on rides. If each ride cost 4 tickets, how many rides could he go on?", "output": ["He spent 28 tickets at the 'dunk a clown' booth. He has 40 - 28 = 12 tickets left. Each ride costs 4 tickets, so he can go on 12 / 4 = 3 rides. The answer is 3."], "answer": "3"}
{"input": "The cafeteria had 75 apples. For lunch they handed out 19 to students and decided to use the rest to make pies. If each pie takes 8 apples, how many pies could they make?", "output": ["They had 75 apples. They gave 19 to students. They decided to use the rest to make pies. The number of apples they used to make pies must be 75 - 19 = 56. Each pie takes 8 apples, so they can make 56 / 8 = 7 pies. The answer is 7."], "answer": "7"}
{"input": "Sarah baked 38 cupcakes for her school's bake sale. If her brother, Todd, ate 14 of them how many packages could she make if she put 8 cupcake in each package?", "output": ["She baked 38 cupcakes. Her brother ate 14 of them. That means there are still 24 cupcakes left. If she puts 8 cupcakes in each package, she can make 24 / 8 = 3 packages. The answer is 3."], "answer": "3"}
{"input": "Nancy uploaded 41 pictures to Facebook. She put 37 pics into one album and put the rest into 2 different albums. How many pictures were in each album?", "output": ["She put 37 pics into one album. She put the rest into 2 different albums. That means she put the rest into 2 albums. The number of pics in each album must be the same. So, the number of pics in each album must be 37. The answer is 37."], "answer": "2"}
